[
    {
        "title": "Congress and UML scramble to resolve differences over BRI By Anil Giri Congress leaders seek to exclude strategic provisions from the plan to implement Beijing’s flagship initiative.",
        "text": "After the Nepali Congress raised “serious” objections over some of the provisions and contents of the proposed implementation plan of the Belt and Road Initiative (BRI), a meeting of the top ruling party leaders on Tuesday evening decided to narrow down the differences so that a memorandum of understanding on BRI could be signed during the China visit of Prime Minister KP Sharma Oli scheduled for the first week of December.While the prime minister and his party, CPN-UML, want to make some sort of agreement or understanding on BRI during the visit, Congress, the key backer of Oli, however, has put forward strong reservations over some components of the BRI implementation plan forwarded by the Chinese side in early 2020. The Congress party is also against taking any loans to implement the projects due to the country’s heavy debt burden. In order to narrow down the differences over the BRI implementation plan, top leaders of both parties and the ministers concerned are meeting every other day but have so far failed to reach a consensus, according to party leaders.But both documents related to the BRI—the framework agreement signed between Nepal and China in May 2017 and the proposed implementation plan—have yet to be made public and remain outside the general discourse of the House of Representatives and other public spheres.The government has not released these documents despite repeated demands from lawmakers of the Congress and the Rastriya Swatantra Party to make them public. “We have demanded the document be made public and provided to us for broader discussion,” said Raj Kishore Yadav, chairman of the International Relations and Tourism Committee of the House of Representatives. “But the Ministry of Foreign Affairs has not provided it to us.” “During the discussion at the committee in July-end with Foreign Minister Arzu Rana Deuba, the committee had asked her to provide the documents for wider discussion, but the ministry has yet to do so,” said Yadav. “We will write to them again.”“Without having the documents public, how can we initiate the debate and deliberation?” said Yadav.He said that any document related to geopolitics or proposed by neighboring countries should be discussed in public spheres and inside the House to ensure transparent and fair discussion.But without making both documents public, the Congress-UML government is preparing to sign a memorandum of understanding (MoU) on BRI during Prime Minister Oli’s visit to China, although the official date of the visit has yet to be announced.Amid disagreement over how to approach the BRI and its implementation plan proposed by China, a political mechanism of the Congress and UML headed by Oli and Congress President Sher Bahadur Deuba held talks in Baluwatar on Tuesday evening to discuss ways to narrow down the differences. They have also formed an informal task force of four members—two from each party—to resolve the differences, according to leaders.The taskforce will soon be constituted and it will rework the BRI implementation plan by making some changes, which will then be sent to the Chinese side for their consent, two leaders of the Congress and the UML told the Post.After the taskforce prepares a list of amendments Nepal needs to incorporate in the proposed BRI implementation plan, it will be finalised by Finance Minister Bishnu Paudel and Foreign Minister Rana.“We will sign an MoU on BRI during the visit, which is just an understanding between Nepal and China based on our mutual understanding in the past,” Yubaraj Khatiwada, the economic adviser to Prime Minister Oli, told the Post.The taskforce will separate certain components proposed in the BRI implementation plan, and will make significant revisions based on the understanding between Oli and Deuba during Tuesday's meeting.Besides rejecting the loan-based funding modality of the BRI, Congress leaders have been saying that, for any loans, Nepal should stick to the same conditions as with multilateral and bilateral lenders.“If 80 percent of grants provided by a particular country return to the same country, then why do we need the grant?” Pradeep Gyawali, deputy secretary general of the UML said at a press meet on Wednesday. “We selected nine projects under the BRI framework but we have yet to finalise the funding modality,” he added.One office bearer of the Nepali Congress said: “We have also objections to some of the contents of the BRI implementation plan because it looks like a political document and has some strategic and geopolitical connotations that we want to remove.”The Congress leader added: “We want to focus on project-specific agreements during the visit and agreements that deal exclusively with infrastructure, connectivity and energy-related projects.”Congress General Secretary Gagan Thapa said his party wants to collaborate with big and neighbouring countries to develop large-scale projects in Nepal.“At this moment, we want to develop such projects through grants to fulfill our development aspirations. We also want to see the execution of past accords and agreements so that we can move on to sign new ones,” Thapa said. “We also know that our partner in the government has differing views. But we will find a common ground with the UML on BRI.”During the Tuesday evening meeting, Oli and UML leaders suggested that Nepal cannot backtrack on its past commitments with China and stressed the need for expediting BRI projects for the country’s economic development.“No agreement originating from any country can be accepted if it clashes with our interests. There must be coherence between the BRI framework agreement signed in 2017 and the BRI implementation plan. But some provisions of the implementation plan do not align with the 2017 agreement. That’s why we seek significant changes,” a Congress office bearer told the Post requesting anonymity.The task force will study the nitty-gritty of the BRI implementation plan, and will remove some provisions like the implementation of the Mutual Legal Assistance agreement signed in 2019 during Chinese President Xi’s Nepal visit. Other issues, including border security cooperation, climate change cooperation, making common positions between the two countries in international forums, and cooperation in the field of science and technology, may also be excluded from the revised draft, according to Congress leaders.Bishnu Rimal, chief political adviser to Prime Minister Oli, said they are currently studying past agreements and pacts signed with China since Oli’s first visit to the northern neighbour in 2016. He said they are also working to secure previously committed Chinese aid. Since 2008, China has announced over Rs80 billion in grants to Nepal on different occasions. A larger sum, 3 billion RMB (around Rs60 billion) was promised during President Xi’s state visit in October 2019.“We failed to submit projects and programmes to the Chinese side to utilise the aid announced on different occasions. Now we are revisiting these matters and planning to pursue them during the prime minister’s visit. We are also reviewing the past agreements and accords particularly reached between Nepal and China after 2016 and taking an update on their implementation status,” said Rimal.He also said that no new projects would be proposed during the visit, as the focus will be on reviewing and implementing past accords.Foreign Minister Rana, who is set to visit China after a trip to Japan, has been tasked with making preparations for the prime minister’s visit, and wants to see some concrete developments ahead of her trip. Though an official announcement of her China visit has yet to be made, she is expected to meet her Chinese counterpart Wang Yi on November 29 in Beijing.Pradeep Gwayali, UML deputy general secretary and former foreign minister, expressed hope that Congress and UML leaders will resolve their differences before the prime minister’s visit.“During the visit, an agreement on the BRI will be signed, but no specific project will be finalised. After signing the agreement, negotiation on the funding modalities may start. Currently, none of the nine projects agreed under the BRI framework in 2018 has made any progress, as feasibility studies for some are still going on. I hope the modality of the BRI-related projects will be concluded and signed during the visit,” said Gyawali while urging the Congress not to create “unnecessary uproar over the BRI pact that was signed when the Congress was a governing partner”. ",
        "date": " November 21, 2024 ",
        "place": "Kathmandu ",
        "subject": "today News"
    },
    {
        "title": " Police probe Prasai on cybercrime as district court gives 5-day remandBy  Post ReportCrime Investigation Bureau spokesman says cybercrime probe will tell if he needs to be further investigated.",
        "text": "The Kathmandu District Court on Wednesday permitted police to hold controversial medical entrepreneur Durga Prasai in custody for five days.Police arrested Prasai on Tuesday on charges of cybercrime for disseminating false information against Prime Minister KP Sharma Oli on social media.Through a video call with another person, Prasai made some documents public alleging that Prime Minister Oli has invested Rs32.5 billion in a telecom company in Cambodia.On Tuesday, a screenshot of the allegation was widely circulated on social media, and some media outlets even published news reports based on that. In one of the videos, Prasai claims that he spent over Rs10 million to obtain the documents related to Oli’s investment.However, Oli’s purported signature on the document that Prasai made public, which went viral on social media, was false, and his name was spelt incorrectly. The Central Investigation Bureau (CIB) of Nepal Police apprehended Prasai from his residence in Bhaktapur on the charge of cybercrime that was later handed to the Cyber Bureau of Nepal Police. The bureau presented Prasai to the Kathmandu District Court on Wednesday and obtained permission to detain him for five days. Superintendent of Police Deepak Raj Awasthi, spokesperson for the Cyber Bureau, confirmed that the Kathmandu District Court on Wednesday granted them the permission. According to Awasthi, the bureau would only investigate Prasai's involvement in cybercrime.“If Prasai is to be investigated on charges other than cybercrime, the CIB will do it,” Awasthi told the Post. CIB spokesperson Hobindra Bogati said the police are investigating Prasai under section 47 of the Electronic Transaction Act 2008. The investigation report of the cybercrime will determine whether there should be further investigation on him. If yes, it will also be based on the cybercrime report, Bogati said.“As Prasai has been arrested twice under Section 47 of the Electronic Transaction Act 2008, if proven guilty, chances remain of him being punished to a maximum degree,” Bogati told the Post.Section 47 (1) of the Act states that if any person publishes or displays any material on electronic media that is prohibited from publishing or displaying by the prevailing law, they shall be liable to a fine not exceeding Rs100,000 or be punished with imprisonment not exceeding five years or with both.If any person repeats an offence as referred to in Sub-section (1), they shall be liable to the punishment for each time—one and one-half percent of the previous punishment, reads sub-section (2) of the law.Earlier, with an order from the Kathmandu District Court, the Nepal Police arrested Prasai on September 18 on charges of violating the Electronic Transaction Act-2008.However, the Kathmandu District Court on October 1 ordered his release on Rs100,000 bail. Police had arrested him based on a complaint by Rastriya Swatantra Party central committee member Tika Sangraula and other women, accusing him of character assassination.Prasai was nominated a central committee member of the CPN-UML after the 10th general convention held in November 2021 and was considered close to UML chair Oli.The UML, however, expelled Prasai from the party in February 2023 after he led a campaign to reinstate monarchy. He organised various events to felicitate former king Gyanendra Shah in his home district Jhapa. Prasai was previously affiliated to the CPN (Maoist Centre). ",
        "date": " November 21, 2024 ",
        "place": "Kathmandu ",
        "subject": "today News"
    },
    {
        "title": "Congress and UML scramble to resolve differences over BRI By Anil Giri Congress leaders seek to exclude strategic provisions from the plan to implement Beijing’s flagship initiative.",
        "text": "After the Nepali Congress raised “serious” objections over some of the provisions and contents of the proposed implementation plan of the Belt and Road Initiative (BRI), a meeting of the top ruling party leaders on Tuesday evening decided to narrow down the differences so that a memorandum of understanding on BRI could be signed during the China visit of Prime Minister KP Sharma Oli scheduled for the first week of December.While the prime minister and his party, CPN-UML, want to make some sort of agreement or understanding on BRI during the visit, Congress, the key backer of Oli, however, has put forward strong reservations over some components of the BRI implementation plan forwarded by the Chinese side in early 2020. The Congress party is also against taking any loans to implement the projects due to the country’s heavy debt burden. In order to narrow down the differences over the BRI implementation plan, top leaders of both parties and the ministers concerned are meeting every other day but have so far failed to reach a consensus, according to party leaders.But both documents related to the BRI—the framework agreement signed between Nepal and China in May 2017 and the proposed implementation plan—have yet to be made public and remain outside the general discourse of the House of Representatives and other public spheres.The government has not released these documents despite repeated demands from lawmakers of the Congress and the Rastriya Swatantra Party to make them public. “We have demanded the document be made public and provided to us for broader discussion,” said Raj Kishore Yadav, chairman of the International Relations and Tourism Committee of the House of Representatives. “But the Ministry of Foreign Affairs has not provided it to us.” “During the discussion at the committee in July-end with Foreign Minister Arzu Rana Deuba, the committee had asked her to provide the documents for wider discussion, but the ministry has yet to do so,” said Yadav. “We will write to them again.”“Without having the documents public, how can we initiate the debate and deliberation?” said Yadav.He said that any document related to geopolitics or proposed by neighboring countries should be discussed in public spheres and inside the House to ensure transparent and fair discussion.But without making both documents public, the Congress-UML government is preparing to sign a memorandum of understanding (MoU) on BRI during Prime Minister Oli’s visit to China, although the official date of the visit has yet to be announced.Amid disagreement over how to approach the BRI and its implementation plan proposed by China, a political mechanism of the Congress and UML headed by Oli and Congress President Sher Bahadur Deuba held talks in Baluwatar on Tuesday evening to discuss ways to narrow down the differences. They have also formed an informal task force of four members—two from each party—to resolve the differences, according to leaders.The taskforce will soon be constituted and it will rework the BRI implementation plan by making some changes, which will then be sent to the Chinese side for their consent, two leaders of the Congress and the UML told the Post.After the taskforce prepares a list of amendments Nepal needs to incorporate in the proposed BRI implementation plan, it will be finalised by Finance Minister Bishnu Paudel and Foreign Minister Rana.“We will sign an MoU on BRI during the visit, which is just an understanding between Nepal and China based on our mutual understanding in the past,” Yubaraj Khatiwada, the economic adviser to Prime Minister Oli, told the Post.The taskforce will separate certain components proposed in the BRI implementation plan, and will make significant revisions based on the understanding between Oli and Deuba during Tuesday's meeting.Besides rejecting the loan-based funding modality of the BRI, Congress leaders have been saying that, for any loans, Nepal should stick to the same conditions as with multilateral and bilateral lenders.“If 80 percent of grants provided by a particular country return to the same country, then why do we need the grant?” Pradeep Gyawali, deputy secretary general of the UML said at a press meet on Wednesday. “We selected nine projects under the BRI framework but we have yet to finalise the funding modality,” he added.One office bearer of the Nepali Congress said: “We have also objections to some of the contents of the BRI implementation plan because it looks like a political document and has some strategic and geopolitical connotations that we want to remove.”The Congress leader added: “We want to focus on project-specific agreements during the visit and agreements that deal exclusively with infrastructure, connectivity and energy-related projects.”Congress General Secretary Gagan Thapa said his party wants to collaborate with big and neighbouring countries to develop large-scale projects in Nepal.“At this moment, we want to develop such projects through grants to fulfill our development aspirations. We also want to see the execution of past accords and agreements so that we can move on to sign new ones,” Thapa said. “We also know that our partner in the government has differing views. But we will find a common ground with the UML on BRI.”During the Tuesday evening meeting, Oli and UML leaders suggested that Nepal cannot backtrack on its past commitments with China and stressed the need for expediting BRI projects for the country’s economic development.“No agreement originating from any country can be accepted if it clashes with our interests. There must be coherence between the BRI framework agreement signed in 2017 and the BRI implementation plan. But some provisions of the implementation plan do not align with the 2017 agreement. That’s why we seek significant changes,” a Congress office bearer told the Post requesting anonymity.The task force will study the nitty-gritty of the BRI implementation plan, and will remove some provisions like the implementation of the Mutual Legal Assistance agreement signed in 2019 during Chinese President Xi’s Nepal visit. Other issues, including border security cooperation, climate change cooperation, making common positions between the two countries in international forums, and cooperation in the field of science and technology, may also be excluded from the revised draft, according to Congress leaders.Bishnu Rimal, chief political adviser to Prime Minister Oli, said they are currently studying past agreements and pacts signed with China since Oli’s first visit to the northern neighbour in 2016. He said they are also working to secure previously committed Chinese aid. Since 2008, China has announced over Rs80 billion in grants to Nepal on different occasions. A larger sum, 3 billion RMB (around Rs60 billion) was promised during President Xi’s state visit in October 2019.“We failed to submit projects and programmes to the Chinese side to utilise the aid announced on different occasions. Now we are revisiting these matters and planning to pursue them during the prime minister’s visit. We are also reviewing the past agreements and accords particularly reached between Nepal and China after 2016 and taking an update on their implementation status,” said Rimal.He also said that no new projects would be proposed during the visit, as the focus will be on reviewing and implementing past accords.Foreign Minister Rana, who is set to visit China after a trip to Japan, has been tasked with making preparations for the prime minister’s visit, and wants to see some concrete developments ahead of her trip. Though an official announcement of her China visit has yet to be made, she is expected to meet her Chinese counterpart Wang Yi on November 29 in Beijing.Pradeep Gwayali, UML deputy general secretary and former foreign minister, expressed hope that Congress and UML leaders will resolve their differences before the prime minister’s visit.“During the visit, an agreement on the BRI will be signed, but no specific project will be finalised. After signing the agreement, negotiation on the funding modalities may start. Currently, none of the nine projects agreed under the BRI framework in 2018 has made any progress, as feasibility studies for some are still going on. I hope the modality of the BRI-related projects will be concluded and signed during the visit,” said Gyawali while urging the Congress not to create “unnecessary uproar over the BRI pact that was signed when the Congress was a governing partner”. ",
        "date": " November 21, 2024 ",
        "place": "Kathmandu ",
        "subject": "today News"
    },
    {
        "title": "Korala lesson  As Nepal seeks other countries’ support, it must be ready to shoulder its share of responsibility. ",
        "text": "The inauguration of an immigration office at Korala border point in Upper Mustang’s Lo Manthang on October 30 had given a message of improved connectivity with the northern neighbour. But the excitement didn’t last as the office, opened with fanfare, was closed without delivering service for a single day. While unveiling the commemorative plaque, Home Minister Ramesh Lekhak was flanked by a group of high profile officials. Gandaki Province Chief Minister Surendra Raj Pandey, heads of three security agencies, director general of the immigration department, among others, landed at Lo Manthang to attend the function. No sooner had the VIPs returned to Kathmandu, other officials deployed there also decamped as Tihar festival began the next day. But they didn’t go back even after the end of the festivities citing the biting cold of the high mountain. Nepal has kept the border facility closed since the inauguration citing severe cold. This is a lame excuse. The weather didn’t suddenly turn cold there, nor has the situation on the ground worsened due to a natural disaster or other unforeseen events. Everyone knew that Lo Manthang, which is situated at an altitude of 4,650 metres, would witness a freezing cold in the winter. The authorities should have prepared before the inauguration. By contrast, the offices on the Chinese side are operating just fine. Bringing the immigration and other offices into operation at Lo Manthang is important as the Korala border point not only connects Nepal and China but also has a potential to be a trilateral trade junction between Nepal, India and China. Nepal has been building the Kaligandaki Corridor national pride project that connects the Siddhartha Highway in the south to Korala in the north. When the road is complete, the route from Nepal-India border point at Sunauli to Nepal-China border point at Korala through Siddhartha Highway and Kaligandaki corridor can be an alternative trilateral trade route linking the three countries. While important religious destinations such as Lumbini and Muktinath are on the route, it also connects Nepal’s important cities including Pokhara and Chitwan.Failure to bring this border point into operation has multiple effects. First, it undermines the route’s huge potential. Second, it leaves a bad impression on the Chinese. Indian, Chinese, and other countries that have been supporting us have a serious concern about Nepal’s negligence in development works. We sign agreements or inaugurate projects with a lot of noise, but don’t work on their maintenance or sustainability.Closure of Korala immigration is a case in point. Several projects started with Indian support have met with similar fate. India’s railway company constructed the Kurta-Bijalpura rail section and handed over the rail line to the Nepal Railway Company Limited last year. It has since been helping operate the train as Nepal is still to train its own staff to run the train.As Prime Minister KP Sharma Oli works on a wish list to be presented before Chinese leaders during his Beijing visit in the first week of December, such failure in bilateral initiatives weaken Nepal’s position. When Nepal seeks other countries’ support in its development endeavours, it must at least be ready to shoulder its share of responsibility. India and China have shown ability in infrastructure development, both at home and abroad. By failing to do even the bare minimum to take them into confidence, Nepal is severely undercutting its development prospects.  ",
        "date": " November 20, 2024 ",
        "place": "kathmandu",
        "subject": "today News"
    },
    {
        "title": "PTI’s political tactics By Smruti S Pattanaik   The party’s leader, Imran Khan, has the charisma to organise rallies even while in jail. ",
        "text": "Pakistan Tehreek-e-Insaf (PTI) is bracing for a confrontation on November 24 as it has called a massive rally in Islamabad demanding the release of its leader, Imran Khan. Khan has been imprisoned for a year on several cases, including the attack on a military installation, corruption and the Al Qadir Trust case. Initially, the party leaders and its members of Parliament were set to participate in the protest; now, it has been extended to the entire nation. The PTI is apprehensive that its leaders may not join the rally as they might come under pressure. Therefore, general participation by sympathisers would keep the party’s popularity in good standing. Despite challenges and roadblocks, the party has always worked on show of strength; however, the May 9 incidents of violence and attack on the army installation, including a Corp Commander’s house, are a reminder of how such confrontation may go out of control.The PTI has put forward three demands to call off the rally. First, reversal of the ‘stolen mandate’. The PTI thinks that in the last election, the party would have won but was denied due to the ‘mechanisation’ of the establishment, which allowed the Pakistan Muslim League (N) to form a new government. However, this narrative is not new. The party spoke about this when the last election voted the PML (N) into power. Second, the release of all the political prisoners of the party, and third, the reversal of the 26th Amendment Act passed recently by the Parliament.PTI’s confrontationKhan was perceived as the blue-eyed boy of Pakistan’s military establishment when he was elected prime minister. However, he fell from grace due to his confrontationist attitude with the powerful military. He blamed General Qamar Javed Bajwa, former Army Chief, for the no-confidence motion in the Parliament that forced him to resign in 2022 and, later, his election defeat in the February 2023 election. This was despite Bajwa being granted a three-year extension by the Khan government.His attempt to promote Lieutenant General Faiz Hameed as the next Army Chief did not succeed. Gen. Hameed has been arrested and is facing court-martial on charges of corruption and abuse of power. Khan’s removal of Gen. Asim Munir, the current Chief of Army Staff, as Director-General of Inter-Services Intelligence was considered a political blunder. Yet, this was the first time the Pakistan Army was divided over their support for Khan, showing how he could create a political space for himself within the army as their best bet.The army blames Imran Khan for the May 9, 2023, attacks, which severely blew the image of Pakistan’s military as an invincible player in domestic politics. The army holds Khan responsible for the inflammatory speech that motivated his supporters to attack. The military strengthened its position after the Shehbaz Sharif government passed an amendment to the Pakistan Army Act, 1952, extending the tenure of the heads of the armed forces to five years. This would mean that Khan’s troubled relationship with the current Army Chief will not end soon. Parliamentarians from the PTI tore the bill in the National Assembly as a symbolic protest. Imran’s offer of dialogue with the government to resolve the problem notwithstanding, both for Sharif’s government and the PTI, the rally is a show of strength. This call for protest may rejuvenate the cadres and prove Khan’s political strength; however, the government will take all steps for its failure.Imran Khan and populismKhan has used his popularity for populist politics, evident through street power asking for fresh elections even after losing the election. He flags the ‘injustice’ he has suffered with false cases to motivate their workers to hold rallies. Despite attempts by the military, the leaders have remained united, fought the last election as independent candidates and desisted allurement to leave the PTI.Yet Khan feels that some Parliamentarians may not join the PTI workers on the street. He has underlined that those elected on party ticket must be in Islamabad to support the PTI leadership. Meanwhile, the government has imposed Section 144 to foil the rally. The ban on it came after Khan’s supporters fired at the police during one of the overnight raids. If the past is an indicator, the PTI supporters have broken curfews and participated in party rallies. Each member of Parliament from the PTI is asked to get as many supporters as possible to make the rally successful.Khan’s narrative is that he is innocent and is being politically persecuted for his stance on several issues of corruption and the role of the Army and external powers, especially the United States, in Pakistan’s politics. His supporters also believe that their leader is being politically victimised through the judiciary, where several corruption cases have been decided against him. Top party leaders are also in jail. So, who will lead the party and motivate the supporters to break the curfew and join the Islamabad rally? His wife, Bushra Bibi, is facing several corruption cases, and his sister, Aleema Khan, has been making statements for the past few weeks asking his supporters to march to Islamabad. She is also meeting the PTI supporters and has been critical of the party leaders who have failed to pressurise the government for the release of their leader.The PTI may not be able to hold the rally in Islamabad on November 24, but it is hell-bent on giving a fight to the establishment and putting forth their demand to release Khan. It will also demonstrate that their leader continues to hold sway over the party and has the charisma to organise rallies even while in jail. ",
        "date": " November 20, 2024 ",
        "place": "kathmandu",
        "subject": "today News"
    },
    {
        "title": "Sleeping through the Anthropocene By Kanak Mani Dixit   South Asia will be the biggest victim of the world’s destroyed natural systems. ",
        "text": "We, humans, have changed the world’s ecology beyond the point of recovery, the climate crisis being the bellwether for innumerable interventions that impact the survival of all life forms. The globe has entered the Anthropocene epoch. Geology’s official time-keepers do not accept the term, but it describes what is happening to the planet.Since all ills associated with this epoch will hurt the poorest, South Asia is getting swamped both literally and metaphorically, for we are the global centre of poverty in number and density. Sadly, South Asians are not in a position to respond locally, nationally or regionally because beyond a few scientists, we are not cognisant of the term ‘Anthropocene’, and there is no cross-border cooperation as we approach the ecological abyss.South Asia should be leading the climate emergency debate at the COP29 conference, happening now in Baku, but our positioning is weak and scattered even though the moment is existential.Film South Asia ’24As the organisers of the biennial Film South Asia festival of documentaries whittled down more than 2,000 submissions to less than 50 for screening (November 21-24), we noted that many films addressed the dangerously skewed nature-human interface. ‘Documentary in Anthropocene’ was selected as the festival theme.Documentary filmmakers are the ‘canaries in the mine’, with a vocation to inspect, understand and raise alarm. They are on to something that the mainstream media, social media and cinema have mostly neglected: That the world is approaching an ecological tipping point. And who is to say what social, psychosocial, political, economic and cultural dislocations are already playing out all around, amidst our politics and geopolitics as usual?In mountain regions, species are moving up the slopes, as warming gases are pumped into the atmosphere. The moths of the eastern Himalaya will not be left behind, as described in the documentary Nocturnes. Species are succumbing even before we get the chance to record their existence.The Indus mud flats are home to unique fish that walk on land and crabs that spit sand-balls (Sometimes Even the Shore Drowns), but Karachi city plans to build housing there. The Jamuna is now a sewer, even though there is no stopping the Chhath worshippers from wading into the toxic foam (Jamna - The River Story).Everywhere along the Himalaya, melting glaciers threaten villages below, as poignantly depicted in No Monastery, No Village. In low-lying Bangladesh, distributaries cut into villages, destroying lives and livelihoods (Whispers by the River Shore). Human efforts are no match for the fury of avenging nature in the form of Cyclone Remal (Topsy Turvy), nor can the once plentiful sea provide livelihood to fisherfolk (Against the Tide).The Anthropocene must become part of mainstream discourse, enough for it to be politically charged. Hence, ‘Anthropocene’ must be wrested from English and penetrate the societal epidermis by seeing debate in tea shops and dhabas. Rather than try to seek root words in Sanskrit, Arabic or Persian, ‘Anthropocene’ should serve the purpose.Global Real TimeThe documentaries at FSA ’24 remind us that there is no escape from 4.5 billion-year-old Earth, with the epochs, eons and eras of its existence divided into geological time. The Holocene epoch began with the end of the last ice age around 12,000 years ago, but it was with the Industrial Revolution that the biosphere came under frontal attack of humans, added the Great Acceleration after the 1950s. With the Global South copying the North’s economic models and consumption patterns, there is no stopping this race from Anthropocene to Armageddon.The cumulative impact of humans is evolving like the asteroid which banged into the Yucatan 66 million years ago, killing off 75 percent of species, from dinosaurs to ammonites. The scientific community has refused to include the Anthropocene formally in the Geologic Time Scale, but the Anthropocene is very much part of Global Real Time.The term is an appropriate descriptor of the ongoing havoc foisted on nature, incorporating much more than global warming and climate change. We are pushing the biosphere beyond repair as we allow plastics to rule over us, embank rivers, deplete groundwater, force the poor into mass migration, destroy habitat, warm the tundra, mine the sand, add acidity to the oceans and push species to extinction.Humans changing the environment is an old story, we have a name for it now. Not so long ago, the One-Horned Rhinoceros lived all the way from the Brahmaputra to the Kabul River. The spread of humans eastward shrank the ‘Great Jangal’ of the Indus-Ganga plain, and today, the western-most habitat of the rhino is a small strip of doon in Nepal’s Inner-Tarai.Those building ‘water management infrastructure’ refused to consider natural silt carried by our rivers, the unique monsoon, cloudbursts and glacial lake outburst floods. Our leaders fell victim to gigantism, and at the very start, in 1954, the Kosi Barrage was inaugurated. ‘Bihar’s Sorrow’ was jacketed between dykes for a hundred kilometres, and in seven decades since, the settling silt has lifted the Kosi’s bed many metres above the outlying plain. A decisive break in the embankment will devastate eastern Bihar, the result of misapplied engineering.The spread of canals in the upper Ganga supported the Green Revolution, but it brought moisture to the land surface in winter-time, generating extended periods of ground fog (seet lahar) that keeps tens of millions freezing over weeks on end. Meanwhile, for all the press publicity, India and Pakistan will not sit together to address the smog that smothers the population from Lahore to Delhi.If you really want to know, the advent of kite-flying was against nature’s system, though seen as the most innocent of pleasures. It was and remains a shock to birdlife which had ruled the skies since they evolved, until confronted midflight with the thread that maims and kills (All that Breathes). Southasian brown cloudAll of a sudden the famous winter fog of Kathmandu has become history, as the Valley transforms into wall-to-wall concrete. In the Valley skies, parakeets screech about whereas they were a feature of lower climes. High on Mount Everest, Sherpa climbers report gurgling water where there was once only hard ice. Climate change seems to be loosening the permafrost of the Himalaya, and all across 2,500 km chain, billions of tons of debris locked into ice may be about to release their grip.The South Asian brown cloud (or ‘black carbon’) emitted in Punjab, Punjab and Haryana (straw burning, vehicular and coal plant emissions, road and construction dust) casts a pall all the way to Chittagong. When the coating of dark dust settles on snow and ice, the sun’s radiation is absorbed rather than reflected, and we have accelerated snowmelt, glaciers retreat.In 2023, this Indus-Ganga smog crossed the delta, curled over the Bay of Bengal and reached Sri Lanka and the Maldives. How can there be a tourism industry in Shimla, Pokhara or Darjeeling if you cannot see the Himalaya, or when there is no snow on the himals? Beyond aesthetics and tourism, this loss of snow and ice cover means depleted groundwater to feed the Ganga, ultimately impacting hundreds of millions all the way to the delta.Haze diplomacyForced migration has been a constant theme of documentary films, and we are about to face the Great Migration linked to related Anthropocene phenomena—one, the rising ocean which will not only submerge the atolls but also displace tens of millions along the entire South Asian shoreline; two, the scorching heat above 50 degrees Celsius in the Indus-Ganga plain which will push people to the highlands.South Asia must be alert to the Anthropocene, our discussion must descend from scientific confabulations and COP events to the peoples’ level. For starters, Nepal needs to begin ‘haze diplomacy’. For the sake of all living beings of the subcontinent from the ocean to the mountain, Kathmandu must demand that New Delhi and Islamabad collaborate to end the South Asian brown cloud.Nepal, with its geography (steepest cross-sectional incline) and demography (diverse communities living on the gradient), is the barometer of climate change and the Anthropocene. To shake others up, we must wake up ourselves. ",
        "date": " November 20, 2024 ",
        "place": "kathmandu",
        "subject": "today News"
    },
    {
        "title": "Region to worry  The growing problem of air pollution calls for close cooperation between actors at home and near abroad. ",
        "text": "A drop in temperature has brought with it a sharp decline in air quality. Smog shrouds the skies, obscuring the hills and mountains surrounding Kathmandu Valley. While this is concerning, visuals of air pollution in the neighbouring countries have alarmed the world. Last week, images of the nearly invisible Taj Mahal and India Gate went viral. Further, the smog in parts of Pakistan and northern India was so dense that it was visible from space. According to the WHO, air with AQI values above 300 is labelled hazardous. It is only a matter of time before Kathmandu Valley and other parts of Nepal face a fate similar to India’s New Delhi and Pakistan’s Lahore, where AQI values have surpassed 1,000.Nepal is the third most polluted country in the world, according to a 2024 report by Air Quality Life Index (AQLI). Particulate pollution is the leading threat to human health in Nepal measured in life expectancy, reducing it by 3.4 years. By comparison, tobacco use cuts life expectancy by 1.9 years, while dietary risks and high blood pressure reduce it by 1.5 years each. What’s more, Nepal’s 30.7 million people live in areas where the annual average particulate pollution level exceeds the WHO guideline. Pretty much the same story repeats every year. On Thursday, Lalitpur’s air quality index reached 238 at 12:45 pm, getting closer to hazardous levels. Experts warned that air quality would go downhill in the coming days as farmers both in India and Pakistan clear fields after the autumn harvest. According to a recent report by Reuters, the burning of stubble left after harvesting rice has contributed to 40 percent of the pollution in Delhi. Such a dangerous practice in the Indo-Gangetic plains is bound to affect Nepal. We cannot solely blame our neighbours when we also indulge in harmful practices. A previous study shows that around three million tonnes of agricultural residue are burnt in the Tarai region. Besides these, emissions from vehicles, brick kilns, and open burning are among the country’s significant sources of pollution. If consumed for long, these pollutants are detrimental to our health. According to a 2024 report by the State of Global Air (SOGA), 75 percent of chronic obstructive pulmonary disease (COPD) and 39 percent of lung cancer deaths were attributed to air pollution. Even as our leaders inhale the same toxic air, their response to tackling air pollution has been woefully inadequate. While actions like banning open burning and monitoring brick kiln emissions have been introduced, they are limited to some local units. Even if vehicles pass emission testing from the Department of Transport Management and get green stickers, they still emit black smoke, as many only service them before the annual pollution tests. In response, the Kathmandu Metropolitan City has purchased a smoke metre to test emissions from such automobiles.Although these actions are commendable, the federal government must do more. Exhaust from public vehicles is a major problem. Even as nearly 12,000 battery-powered vehicles were imported last year, these were primarily private ones. The government should open avenues for people to switch to eco-friendly ways of cooking and travelling. If we act seriously to reduce particulate pollution to WHO guidelines, countless lives could be saved. Additionally, residents of Tarai and Kathmandu could gain 4.8 and 2.6 years of life expectancy, respectively. While tackling domestic sources of air pollution is essential, it is as important to acknowledge its transboundary nature. Only a coordinated, collective, multinational effort can help clean up the air we breathe.  ",
        "date": " November 19, 2024 ",
        "place": "kathmandu",
        "subject": "today News"
    },
    {
        "title": " TU Cricket Ground gets a facelift for Nepal Premier League",
        "text": "The Tribhuvan University Cricket Ground in Kirtipur is undergoing significant upgrades in preparation for the Nepal Premier League (NPL).The improvements include a revamped outfield, the installation of a digital scoreboard, and new sight screens. Practice pitches have also been added, while the boundary has been expanded.Additionally, a dedicated VIP seating arrangement, along with separate lounges for VIPs and team owners, is being constructed.The first edition of the franchise-based tournament, which will take place from November 30 to December 21, will feature eight teams. These squads represent various provinces, with two teams from Bagmati Province and one each from other regions.The competing teams include Kathmandu Gurkhas, Chitwan Rhinos, Biratnagar Kings, Janakpur Bolts, Pokhara Avengers, Lumbini Lions, Karnali Yaks, and Sudurpashchim Royals. The league will see participation from renowned international cricketers such as Shikhar Dhawan, Rohan Mustafa, Ben Cutting, Michael Levit, Saif Zaib, Brandon McMullen, and Unmukt Chand.Here are photos taken by the Post’s photojournalist Hemanta Shrestha.",
        "date": " November 21, 2024 ",
        "place": "kathmandu",
        "subject": "today News"
    },
    {
        "title": " Cooperative victims protest at Maitighar",
        "text": "Cooperative victims staged a protest at Maitighar, Kathmandu, on Wednesday, demanding the return of their savings. The demonstration turned tense as clashes broke out between the protesters and police near the Nepal Army headquarters gate.The march, which began from Thapathali, was intervened by police, leading to confrontations as the agitators attempted to advance further ahead. Several demonstrators sustained injuries during the scuffle. The victims have been demanding the return of their savings deposited in cooperatives, which they claim have been embezzled. Various studies, including the one carried out by the special parliamentary committee formed to probe irregularities in the sector, have concluded that billions of rupees from hundreds of cooperatives have been embezzled across the country.Here are some photos of the protest by the Post’s photojournalist Angad Dhakal.",
        "date": " November 20, 2024 ",
        "place": "kathmandu",
        "subject": "today News"
    },
    {
        "title": " Leaders, general public pay tribute to former Speaker Dhungana",
        "text": "People from various walks of life gathered at Sano Gaucharan on Monday to pay their respects to the late former Speaker Daman Nath Dhungana.Prime Minister KP Sharma Oli draped Dhungana’s body with the national flag. Prime Minister Oli praised Dhungana as a multifaceted leader whose impact on Nepal’s parliamentary practices remains profound. “He was successful in leaving a significant imprint on our parliamentary system, and it is important that we follow the path he laid down to strengthen our democracy,” said the prime minister during his tribute.In addition to the prime minister, Nepali Congress President Sher Bahadur Deuba, Deputy Prime Minister and Finance Minister Bishnu Paudel, Cabinet ministers, former prime ministers including Baburam Bhattarai and Jhalanath Khanal, among other politicians, paid their tributes. Angad Dhakal/TKP On Monday, the government declared a public holiday in his honour and announced Dhungana would be given a state funeral. As a mark of respect, flags at all government offices in Nepal and abroad were flown at half-mast.Dhungana, the first Speaker of the House following the restoration of democracy in 1990, was a staunch advocate for human rights and justice. Known for his unwavering support for anti-establishment forces, he remained a symbol of integrity and resilience throughout his life.He passed away on Sunday due to complications from a long-standing liver condition. Despite being rushed to Frontline Hospital in Baneshwar after suffering from breathing issues, he was declared dead upon arrival.His final rites will be performed at Pashupati Aryaghat today. Angad Dhakal/TKP ",
        "date": " November 18, 2024 ",
        "place": "kathmandu",
        "subject": "today News"
    },
    {
        "title": " Clearing the cable clutter",
        "text": "The Kathmandu Metropolitan City has removed tangled wires from utility poles in New Road and nearby areas. The haphazardly placed wires had long been criticised for defacing the city’s beauty and creating an eyesore. On Saturday, municipal workers cleared the cables, improving the appearance of these busy areas famous among tourists.",
        "date": " November 16, 2024 ",
        "place": "kathmandu",
        "subject": "today News"
    },
    {
        "title": "Brilliant Paolini leads Italy to fifth Billie Jean King Cup titleBy Reuters Paolini beat Rebecca Sramkova 6-2 6-1 in the second singles rubber to wrap up a 2-0 win over Slovakia.",
        "text": "Jasmine Paolini put on a tennis masterclass to steer Italy to a fifth Billie Jean King Cup title as she beat Rebecca Sramkova 6-2 6-1 in the second singles rubber to wrap up a 2-0 win over Slovakia in the final on Wednesday.A year after Italy suffered a heartbreaking defeat to Canada in the decider and over a decade since their last title in 2013, the charismatic Paolini demolished Sramkova before celebrating wildly with her teammates and jubilant Italian fans, including men’s world number one Jannik Sinner.Underdogs Slovakia, who had stunned Britain on their way to the final, never got going against an imperious Italy who got off the mark with Lucia Bronzetti’s dominant 6-2 6-4 win over Viktoria Hruncakova in the opening match.“It’s unbelievable, amazing, I don’t have words to describe how I feel right now, it’s just incredible,” an emotional Paolini said on court.“I think we played an unbelievable week and I'm so proud of how we did it in every match. I’m very happy that this year we finally were able to bring the title back to Italy,” the world number four added.Paolini fell to a 6-2 6-3 defeat to Canada’s Leylah Fernandez in last year’s final in Seville.Yet this time around the Wimbledon and Roland Garros finalist Paolini put in a commanding performance against the 43rd-ranked Sramkova, who tried to gut it out while suffering with cramp throughout the second set.“I think last year Leylah (Fernandez) played really well, she played better than me. That’s the way it is sometimes in sports,” Paolini said.“Today when I stepped on court I told myself that I was going to give 100%... If you win, you win. But if you lose you have to accept that. We are going to fight for every ball and today it went well for us.”Italy's perfect day started with a superb performance from 25-year-old Bronzetti, who was playing only her second BJK Cup singles match, following her debut win in the semi-final against Poland .Bronzetti was firing rockets with her serve and dominated Hruncakova in two quick sets that lasted just one hour and 20 minutes.“I’m very proud to be here, to represent Italy, I’m so happy for this win,” Bronzetti said.“It was not as easy as it may have looked. We are in the final so every match is tough. I’m very happy to have earned the point for Italy.”Paolini went about her business even quicker, beating her opponent in one hour. ",
        "date": " November 21, 2024 ",
        "place": "Spain ",
        "subject": "today News"
    },
    {
        "title": "SponsoredChina to develop new institutions for higher-standard open economyBy Statistics show that from 1979 to 2023, China’s gross domestic product has grown at an average annual rate of 8.9 percent, far exceeding the global average of 3 percent during the same period.",
        "text": "Travel and consumption during the recent National Day holiday in China became a focus of foreign media outlets, which highlighted the record-breaking passenger volume of the railway system on the first day of the holiday, the surge in outbound tourism, and the bustling crowds at popular destinations. These observations exactly underscored a vibrant and thriving China.Over the past 75 years since the founding of the People’s Republic of China, China has achieved a historic leap in economic development, comprehensive national strength, and international influence.Statistics show that from 1979 to 2023, China’s gross domestic product has grown at an average annual rate of 8.9 percent, far exceeding the global average of 3 percent during the same period. Besides, the country’s average annual contribution to global economic growth stood at 24.8 percent.Chinese President Xi Jinping said, “We will continue to advance high-quality development and Chinese modernization, enable the Chinese people to live a better life, and contribute more to sustainable development in the world. We have the confidence and determination that China’s development has a bright future.”China’s vitality in development stems from the continuous efforts to deepen reforms. The country has continuously deepened reforms with great courage and determination over the past few decades, injecting a steady stream of vitality and momentum into its development.The third plenary session of the 11th Central Committee of the Communist Party of China (CPC) ushered in a new period: one of reform, opening up, and socialist modernization. The third plenary session of the 18th CPC Central Committee marked the start of a new journey of comprehensively deepening reform in the new era with systematic and holistic plans. The third plenary session of the 20th CPC Central Committee initiated a new era and new journey, further deepening reforms and continuously exploring the broad prospects of Chinese modernization.China takes deepening reform across the board as the fundamental driving force for Chinese modernization. It is determined to get rid of all thinking and ideas and all institutional ailment that impede Chinese modernization. This way, the country is able to better adapt the relations of production to the productive forces, the superstructure to the economic base, and national governance to social development so as to provide strong impetus and institutional support for Chinese modernization.China’s vitality in development stems from the efforts to continuously expand opening up. Opening up is a defining feature of Chinese modernization. Since the initiation of reform and opening-up, China has embraced a path of achieving common development through opening up.China remains committed to the fundamental national policy of opening up to the outside world and pursues a mutually beneficial strategy of opening up. China’s development is both domestic and external oriented; while developing itself, China also shares more of its development outcomes with other countries and peoples.Chinese and foreign participants communicate at the tourism exhibition area of the 21st China-ASEAN Expo held in Guilin, south China’s Guangxi Zhuang autonomous region, Sept. 26, 2024. People’s Daily Online/Li KaiChina is pursuing high-standard opening up not just because it has achieved remarkable reform and development success through opening up, but also because this is the right way forward as shown by the laws of economy and the trend of the times.The third plenary session of the 20th CPC Central Committee stressed that China must remain committed to the basic state policy of opening to the outside world and continue to promote reform through opening up. Leveraging the strengths of China's enormous market, the country will enhance its capacity for opening up while expanding cooperation with other countries and develop new institutions for a higher-standard open economy.In the future, China will steadily expand institutional opening up, deepen foreign trade structural reform, and further reform the management systems for inward and outward investment. Additionally, China will also optimize the layout for regional opening up, and improve the mechanisms for high-quality cooperation under the Belt and Road Initiative.International observers believe that China's commitment to expanding high-standard opening up will not only pave the way for Chinese modernization, but also continuously provide new opportunities for the world through the country]s high-quality economic development.The reform and opening up policy has led to a miraculous transformation in China’s development. Looking ahead, as China further deepens reform and expands opening up comprehensively, it will continue to inject strong momentum into promoting high-quality development and advancing Chinese modernization.China will always be important opportunity for global developmentBy Guo JipingPhoto shows the artificial intelligence section and the low-carbon energy and environmental protection technology section of the 7th China International Import Expo (CIIE), Nov. 3, 2024. People’s Daily Online/Weng QiyuThe 7th China International Import Expo (CIIE) kicked off at the National Exhibition and Convention Center (Shanghai) on Nov. 5. Running from Nov. 5 to 10, the 7th CIIE has attracted 3,496 exhibitors from 129 countries and regions. It also sets a new record with 297 Fortune Global 500 companies and industry leaders attending the event.Besides, it has brought together 77 countries and international organizations to participate in the Country Exhibition, with France, Malaysia, Nicaragua, Saudi Arabia, Tanzania and Uzbekistan serving as guest countries of honour.Political and business leaders from 152 countries, regions and international organizations attended the opening ceremony. Around 3,800 Chinese and foreign journalists from more than 400 media outlets are participating in the coverage of this event. Additionally, the area dedicated to cultural exchanges exceeded 32,000 square meters, marking a new high in the history of the expo.Opening up is a defining feature of Chinese modernization and is also the core philosophy of the CIIE. Hosting the import expo is an important step for China to further open up and a concrete action China took to build an open world economy.In July this year, the 20th Central Committee of the Communist Party of China (CPC) concluded its third plenary session, drawing up a grand blueprint for further deepening reform comprehensively to advance Chinese modernization.The CPC noted that to further deepen reform comprehensively, it is a must to maintain a unified approach to reform and opening up. The deeper the reform goes, the higher the requirements for the level of opening up; the higher the level of opening up, the greater the boost to reform.As a significant economic diplomatic event held after the third plenary session of the 20th Central Committee of the CPC, this year's CIIE highlights China’s confidence, determination, and practical actions in further deepening reform comprehensively, promoting high-quality development, and advancing high-level opening-up.Based on the super-sized Chinese market, the CIIE has enabled exhibits to become traded goods and exhibitors to spot more investment opportunities. It has become a catalyst for enhancing global consensus on open cooperation and pursuing an open world economy, creating new opportunities for the world through China’s further development.Open cooperation is a defining feature of the CIIE, and the key to its success. The annual expo has leveraged the strengths of China’s enormous market and fulfilled its platform function for international procurement, investment promotion, people-to-people exchanges and open cooperation, facilitating the exchanges of cultures and ideas, as well as transactions of goods and services.The CIIE has continuously embraced innovation and green development. The previous six editions of the expo saw nearly 2,500 new products, technologies, and services make their debut. The 7th CIIE has, for the first time, established the new materials section, which showcases over 400 representative new products, technologies, and services, unleashing the vitality of innovation and green development.The expo has served as a platform of high-level opening up that allows China’s enormous market to be shared by the world. The first six editions of CIIE have generated a total intended transaction amount exceeding $420 billion.Additionally, over 1,130 foreign enterprises and investment promotion organizations have conducted targeted connections across the country. A total of 186 enterprises and institutions have achieved full attendance across all seven editions of the expo, and many exhibitors have gone on to open new stores, factories, and R&D centers in China.With a population of over 1.4 billion, a middle-income group exceeding 400 million people, a complete supply chain, a well-developed infrastructure, an abundant talent pool, and a vibrant innovation ecosystem, the Chinese market continues to unleash tremendous dividends, enabling all parties to achieve mutual benefit.“The CIIE is a unique grand event,” said Nicolas Hieronimus, CEO of L’Oreal Group. L’Oreal Group is the rotating chairman of the CIIE Enterprise Alliance. He noted that the expo, filled with opportunities, serves as an “amplifier” for new product debuts, a “catalyst” for cooperation, and a “propeller” for business development.The spring breeze of China’s openness has continuously brought warmth to all parts of the world. So far, China has signed 22 free-trade agreements with 29 countries and regions. The country has been continuously deepening regional economic and trade cooperation by applying high standards in implementing the Regional Comprehensive Economic Partnership agreement and taking proactive steps to align its economic and trade rules with the high standards of the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP) and the Digital Economy Partnership Agreement (DEPA).Staff members debug an exhibit in the venue of the 7th China International Import Expo (CIIE), Nov. 3, 2024. People’s Daily Online/Weng QiyuIn the first three quarters of this year, China’s goods trade volume exceeded 32 trillion yuan ($4.45 trillion), reaching a new high, and its trade with over 160 countries and regions around the world achieved growth.As a developing country and a natural member of the Global South, China is a staunch supporter, active participant and key contributor of South-South cooperation. By committing itself to openness to meet development challenges, foster synergy for cooperation, build the momentum of innovation, and deliver benefits to all, China has provided all nations with greater and fairer access to the fruits of development.Since its inaugural edition of the CIIE, China has offered booth installation support and other support measures to the least developed countries, such as product transportation and personnel reception, to help them showcase their products at the import expo.This year’s CIIE offered more than 120 free exhibition booths for vendors from 37 least developed countries. To expand unilateral opening to the least developed countries, the expo has also enlarged the exhibition area for African agricultural products.Starting from Dec. 1 this year, China will give all the least developed countries having diplomatic relations with China zero-tariff treatment for 100 percent tariff lines. This significant measure was announced by Chinese President Xi Jinping at the opening ceremony of the 2024 Summit of the Forum on China-Africa Cooperation (FOCAC). China is the first major developing country and major global economy to implement such a measure.The 7th CIIE has once again demonstrated to countries around the world that China remains committed to high-level opening up and open international cooperation. By further deepening reforms comprehensively and opening its doors wider to the outside world, China will always be an important opportunity for global development.China’s PV industry continues to rise, thanks to technological innovationBy Liao RuilingPhoto shows a solar farm in Tushi township, Lanshan county, Yongzhou, central China’s Hunan province.  People’s Daily Online/Huang ChuntaoChina’s photovoltaic (PV) industry maintained robust growth momentum during the first six months of this year. Data showed that during this period, the country’s output of polysilicon, silicon wafers, solar cells, and modules all rose by over 30 percent year-on-year, and exports of PV modules increased by nearly 20 percent from the same period last year.This growth is evident at a granular silicon production facility of Chinese major polysilicon supplier GCL Technology Holdings Limited in Xuzhou, east China’s Jiangsu province, where a huge number of small granular silicon particles are flowing into storage tanks, ready for quality checks and packaging.“Granular silicon, a type of polycrystalline silicon and an essential material component in the PV manufacturing industry, has advantages such as smaller volume and simpler production processes,” said Lan Tianshi, co-chief executive officer of the company.He said that the company’s four facilities for producing granular silicon in China are all running smoothly, with a steady increase in their market share.The demand for PV systems continues to rise globally as the world increasingly shifts toward renewable energy, said Liu Yiyang, deputy secretary-general and spokesperson of the China Photovoltaic Industry Association.In the first half of this year, the newly installed capacity of China’s PV industry reached 102.48GW, including 49.6 GW of centralized PV installations, 37.03 GW of commercial and industrial solar installations, and 15.85 GW of residential solar installations.“China has made significant achievements in multiple segments of the PV industry, including solar cells, modules, and silicon wafers,” said Liu.“Thanks to Chinese PV companies’ continuous technological innovation, enhanced independent R&D, and improved production efficiency, China leads the world in PV output and capacity, and multiple segments of the industrial chain,” he added.Looking back, China’s PV industry went through a tough time when it relied heavily on foreign sources for raw materials, equipment, and markets.From the early 2000s to late 2010, there was a remarkable increase in China's solar cell production. Yet the industry, which was primarily export-oriented at the time, faced serious challenges due to the global financial crisis.In the 2010s, the global PV industry encountered additional difficulties caused by the so-called anti-dumping and anti-subsidy measures enforced by some countries. In response to these challenges, the Chinese PV industry shifted its focus toward expanding the Chinese domestic market and developing core technologies.Throughout the years, driven by China's dual carbon goals of peaking carbon emissions by 2030 and achieving carbon neutrality by 2060, Chinese PV companies have intensified their R&D efforts. They have successfully developed and applied emerging technologies like perovskite PV cell technology, while also promoting the large-scale commercialization of multiple high-efficiency cell technologies, Liu said.Liu noted that in 2023, all of the world’s top 10 companies in PV cells production were from China, with a combined capacity of 681.2 GW, accounting for 66 percent of the global total.A woman works in a workshop of new energy company Ronma Solar in Jinhua, east China’s Zhejiang province.  People’s Daily Online/Shi BufaAccording to the white paper “China’s Energy Transition” recently released by China’s State Council Information Office, China has built complete industrial chains for the R&D, design, and integrated manufacturing of wind and solar PV equipment, and the high conversion efficiency of crystalline silicon/perovskite PV cell technology has established multiple world bests.Over the past decade, China has provided premium clean energy products and services to the international market. The country has also doubled its efforts in technological innovation to upgrade new energy technology at a faster pace, contributing enormously to a sharp reduction in the costs of wind power and PV power worldwide.Data from the International Energy Agency show that in 2023, China’s newly installed renewable energy capacity exceeded the total of other regions worldwide, making it the largest contributor to the development of the global renewable energy industry.To address the challenges the industry faces such as intense competition, export obstacles in some regions, and a slight supply-demand imbalance, some leading Chinese companies are increasing investment in technological upgrades to reduce costs, maintain profits, and improve efficiency, while some others are seeking new growth opportunities and expanding their global presence.Since the beginning of this year, companies like GCL Technology Holdings Limited, Trina Solar, and JinkoSolar have announced to launch PV projects in Middle East. Some firms are accelerating their global expansion by assisting their overseas counterparts in localizing industrial chains.“No matter how the market changes, innovation remains our top priority as technological strength and independent innovation capabilities are always crucial for maintaining our resilience and competitiveness,” said Lan.",
        "date": " November 8, 2024 ",
        "place": "kathmandu",
        "subject": "today News"
    },
    {
        "title": "47 Nepalis deported from Russia and BulgariaBy Hom Karki Russia deported 29 Nepalis for working illegally; Bulgaria sent back 18 trafficking victims.",
        "text": "A total of 47 Nepalis deported from Russia and Bulgaria have arrived home. Russia repatriated 29 individuals for not attending regular university classes and working without permits, while Bulgaria sent back 18 Nepalis who were victims of human trafficking.Russian authorities arrested 34 Nepalis on October 30 from a call centre in Moscow’s Kuzminki area. The following day, a local court approved their deportation. Twenty-nine of them were sent to Nepal on Monday night via an Air Arabia flight and arrived in Kathmandu on Tuesday evening. The remaining five are still undergoing deportation processes.Many of the deported students said education consultancies had misled them about opportunities in Russia. One student said, “We were told we could study and work without restrictions, but that was untrue. Living in Russia without work was impossible, and we were arrested while working.” Before deportation, they were held at a detention centre in Sakharovo, 60 km from Moscow.Most of them had gone to Russia two years ago.An immigration officer at the Tribhuvan International Airport said they didn’t investigate further. “We did not find it necessary to take them into custody for further statements,” said an immigration officer. “All of them were released through standard procedures.”The returning students said they would discuss whether to file complaints against the education consultancies. “We are all under mental stress right now,” one student said. “We will discuss what steps to take to prevent other students from being exploited like us.” Keshav Timilsina, president of the Non-Resident Nepali Association (NRNA) Russia, said the lack of proper documentation prevented them from receiving legal support.“If dissatisfied with the court’s decision, an appeal can be filed,” he said. “Relatives and friends of the detained students had contacted the NRNA for assistance. We were prepared to hire a lawyer to pursue legal remedies, but they could not provide documents such as contracts with the employer or proof of university attendance. Without these papers, the plan to appeal was cancelled.”Sushil Ghimire, Nepal’s acting ambassador to Russia, said the embassy could not assist as the students had violated local laws. “Russian law mandates attendance for students, but most were working instead. Violating labour laws left us with no legal grounds to support them,” he said.Timilsina said that most students who travelled to Russia through consultancies, except those on government scholarships, have faced such issues. “Russia provides scholarships to 200 Nepali students annually, and those receiving scholarships do not incur any expenses,” he said. “Russia is a destination for studying only through government educational scholarships. It is impossible to work while studying, as some consultancies claim.”Meanwhile, Bulgaria deported 18 Nepalis who were trafficked via India, Romania, and Hungary. They lacked proper entry documents and were detained for three months in a deportation centre in Sofia. The Nepalis were sent back to Nepal on government-sponsored tickets, arriving in Kathmandu last Thursday. The Nepali embassy in Germany, which oversees consular services for Bulgaria, said the deported individuals had been arrested for lacking official documents. ",
        "date": " November 21, 2024 ",
        "place": "Kathmandu ",
        "subject": "today News"
    },
    {
        "title": "Elon Musk’s Neuralink receives Canadian approval for brain chip trialBy Reuters The brain chip enables people with quadriplegia, or paralysis of all four limbs, to control external devices with their thoughts.",
        "text": "Elon Musk’s Neuralink said on Wednesday it has received approval to launch its first clinical trial in Canada for a device designed to give paralysed individuals the ability to use digital devices simply by thinking.The brain chip startup said the Canadian study aims to assess the safety and initial functionality of its implant which enables people with quadriplegia, or paralysis of all four limbs, to control external devices with their thoughts.Canada’s University Health Network hospital said in a separate statement that its Toronto facility had been selected to perform the complex neurosurgical procedure.Regulator Health Canada did not immediately respond to a request for comment.In the United States, Neuralink has already implanted the device in two patients. The company says the device is working well in the second trial patient, who has been using it to play video games and learn how to design 3D objects.Founded in 2016 by Musk and a group of engineers, Neuralink is also building a brain chip interface that can be implanted within the skull, which it says could eventually help disabled patients to move and communicate again, and restore vision.In September, the startup received the US Food and Drug Administration’s “breakthrough device” designation for its experimental implant aimed at restoring vision. ",
        "date": " November 21, 2024 ",
        "place": "kathmandu",
        "subject": "today News"
    },
    {
        "title": "Two dead in separate road accidents in RautahatBy Post Report Four others were injured, police say.",
        "text": "Two people were killed, and four others were injured in separate road accidents in Rautahat on Wednesday night.In Chandrapur Municipality-9, a collision between a jeep with an Indian registration number, travelling from Chandranigahapur to Gaur, and a motorcycle resulted in the death of Sheikh Jamaludin, 24, of ward 5 of Gujara Municipality. Jamaludin, who sustained multiple injuries, succumbed during treatment at Highway Trauma Hospital and Research Centre on Thursday morning, police said.The pillion rider, Majid Musalman, was critically injured and referred to Kathmandu for further treatment. He is currently undergoing treatment at B&B Hospital. The jeep driver, Krishna Nandan Yadav of ward 4 of Gadhimai Municipality, has been taken into custody, said Deputy Superintendent of Police (DSP) Raj Kumar Rai.In a separate incident, a motorcycle skidded and overturned. The rider, Samadul Ansari, 20, of ward 5 of Gujara Municipality, and the pillion rider, Sheikh Israd, sustained minor injuries. Police have detained Ansari for further investigation.Meanwhile, in Chandrapur Municipality-6, a motorcycle struck pedestrian Nikindrakumar Patel, 16, of ward 3 of Dewahi Gonahi Rural Municipality. Patel suffered an injury. The motorcycle then lost control and crashed into an electric pole, killing the rider, whose identity is yet to be established. The rider died during treatment at Chandrapur Hospital on Thursday morning. ",
        "date": " November 21, 2024 ",
        "place": "Kathmandu ",
        "subject": "today News"
    },
    {
        "title": "Seminar held on climate risks and green finance opportunities in bankingBy Post Report Participants stress the need for a regulatory framework to boost Nepal’s green finance market.",
        "text": "Participants at a seminar on climate risks and opportunities in Nepal’s banking sector discussed challenges posed by climate change and the need for a regulatory framework to promote green finance.The event was jointly organised by the Nepal Rastra Bank (NRB) and International Finance Corporation (IFC), with support from the European Union (EU), as part of the regional initiative ‘Accelerating Climate Smart and Inclusive Infrastructure in South Asia’ (ACSIIS).The organisers said that the seminar disseminated findings from a Climate Finance Risk Exposure Assessment and facilitated discussions on risks, opportunities, and potential steps to develop a regulatory framework for green finance in Nepal.“A well-defined and structured regulatory framework to develop a green finance market will enable Nepal’s financial sector to channel private sector capital towards climate-related projects, which will contribute to achieving our climate commitments,” said Bam Bahadur Mishra, deputy governor of NRB. “With support from the World Bank Group, NRB will work with the banking sector to strengthen Nepal’s financial sector to adapt to the growing challenges of climate change.”David N. Sislen, regional country director for the World Bank, said that climate change poses a significant threat to financial stability but also offers unique opportunities. “By helping integrate climate risks into operations, we can together build a more sustainable banking sector,” he said. “Making a difference on climate will require coordinated action between the public and private sectors, and the financial sector is central to that work.”Nepal is highly vulnerable to climate change, with its GDP projected to shrink by 7 percent by 2050 due to unchecked impacts, according to the World Bank.Jose Luis Vinuesa-Santamaria, head of cooperation at the EU, reiterated the EU’s commitment to supporting Nepal’s climate-resilient future. “Green finance fits within the EU’s Global Gateway approach, which mobilises private capital for climate and sustainable development projects,” he said. The strategy involves technical assistance, risk-sharing instruments, and de-risked funds to support sustainable infrastructure and green finance projects.IFC Country Representative Babacar S. Faye highlighted the importance of climate finance for Nepal’s green growth. “This will help the country build a greener economy that fosters sustainable growth and resilience,” he said. ",
        "date": " November 21, 2024 ",
        "place": "Kathmandu ",
        "subject": "today News"
    },
    {
        "title": "TU Cricket Ground gets a facelift for Nepal Premier LeagueBy Post Report Upgrades include a revamped outfield, digital scoreboard, and VIP sitting arrangements.",
        "text": "The Tribhuvan University Cricket Ground in Kirtipur is undergoing significant upgrades in preparation for the Nepal Premier League (NPL).The improvements include a revamped outfield, the installation of a digital scoreboard, and new sight screens. Practice pitches have also been added, while the boundary has been expanded.Additionally, a dedicated VIP seating arrangement, along with separate lounges for VIPs and team owners, is being constructed.The first edition of the franchise-based tournament, which will take place from November 30 to December 21, will feature eight teams. These squads represent various provinces, with two teams from Bagmati Province and one each from other regions.The competing teams include Kathmandu Gurkhas, Chitwan Rhinos, Biratnagar Kings, Janakpur Bolts, Pokhara Avengers, Lumbini Lions, Karnali Yaks, and Sudurpashchim Royals. The league will see participation from renowned international cricketers such as Shikhar Dhawan, Rohan Mustafa, Ben Cutting, Michael Levit, Saif Zaib, Brandon McMullen, and Unmukt Chand.Here are photos taken by the Post’s photojournalist Hemanta Shrestha.",
        "date": " November 21, 2024 ",
        "place": "kathmandu",
        "subject": "today News"
    },
    {
        "title": "Ukraine launches UK cruise missiles into Russia, a day after using US ATACMSBy Reuters At least 14 huge explosions could be heard, most of them preceded by the sharp whistle of what sounded like an incoming missile. ",
        "text": "Ukraine fired a volley of British Storm Shadow cruise missiles into Russia on Wednesday, the latest new Western weapon it has been permitted to use on Russian targets a day after it fired US ATACMS missiles.The strikes were widely reported by Russian war correspondents on Telegram and confirmed by an official on condition of anonymity. A spokesperson for Ukraine’s General Staff said he had no information.Moscow has said the use of Western weapons to strike Russian territory far from the border would be a major escalation in the conflict. Kyiv says it needs the capability to defend itself by hitting Russian rear bases used to support Moscow’s invasion, which entered its 1,000th day this week.Accounts of Russian war correspondents on Telegram posted video they said included the sound of the missiles striking Kursk region, which borders northeastern Ukraine.At least 14 huge explosions could be heard, most of them preceded by the sharp whistle of what sounded like an incoming missile. The video, shot in a residential area, showed black smoke rising in the distance.The pro-Russian Two Majors channel on Telegram said Ukraine fired up to 12 Storm Shadows into the Kursk region and carried pictures of missile pieces with the name Storm Shadow clearly visible.A spokesperson for British Prime Minister Keir Starmer declined to comment.Britain had previously allowed Ukraine to use Storm Shadows, which have a range in excess of 250 km (155 miles), within Ukrainian territory.The Kyiv government has been pressing Western partners for permission to use such weapons to strike targets deep inside Russia, and it obtained the all-clear from US President Joe Biden to use the ATACMS this week, two months before Biden leaves office.As Ukraine’s use of the missiles raised tensions, the United States shut its embassy in Kyiv on Wednesday as a precaution due to what it called the threat of a significant air attack. It later said the embassy would reopen on Thursday.The Pentagon on Wednesday also announced $275 million in military aid to Ukraine that included more ammunition for the HIMARS rocket system, and the Biden administration moved to forgive $4.7 billion in US loans to Ukraine as outgoing officials sought to do what they could to bolster Kyiv before they leave office.Anticipating Trump administrationBiden’s successor, President-elect Donald Trump, has said he will end the war, without saying how, and criticised billions of dollars in aid for Ukraine under Biden. The warring sides believe Trump is likely to push for peace talks - not known to have been held since the war’s earliest months - and are trying to attain strong positions before negotiations.Kyiv says Moscow, which invaded Ukraine in February 2022, has previously taken advantage of limits on Ukraine’s use of weapons, particularly to strike Ukrainian cities from the air with heavy guided bombs.Western countries say the arrival of more than 10,000 North Korean troops to fight for Russia in recent weeks was an escalation that merited a response.The first use of the US ATACMS on Tuesday, fired at a Russian arsenal in the Bryansk region on Ukraine’s northern border, prompted firm words from Moscow, which announced a change to its nuclear doctrine to lower the threshold for the use of atomic weapons. Washington has said it sees no need to adjust its own nuclear posture and accused Moscow of resorting to irresponsible rhetoric.Military analysts have said the longer-range missiles are unlikely to give Ukraine a decisive edge in the war but could strengthen its position, especially in the battle for a sliver of land inside Russia’s Kursk region it seized in August.An air raid siren in Kyiv in the early afternoon on Wednesday jangled nerves. But Ukraine’s military spy agency said a widely reported threat of massive drone and missile attacks across the country was fake, and it accused Russia of trying to sow panic by circulating online messages about it.“The enemy, unable to subdue Ukrainians by force, resorts to measures of intimidation and psychological pressure on society. We ask you to be vigilant and steadfast,” it said.With the US embassy’s temporary closure, the Italian, Spanish and Greek embassies said they too had closed their doors in Kyiv. Canada said it suspended in-person services at its mission. The French embassy remained open but urged its citizens to be cautious. The Kremlin said it had no comment.Russian foreign intelligence chief Sergei Naryshkin said in an interview published on Wednesday that Moscow would retaliate against NATO countries that facilitate long-range Ukrainian missile strikes against Russian territory.The war is at a volatile juncture, with nearly a fifth of Ukrainian territory in Russian hands, North Korean troops deployed in Russia’s Kursk region and doubts over the future of Western aid under Trump, whose nominees for administration posts include sceptics of support for Kyiv.On Sunday, Russia staged a missile and drone strike on Ukraine’s national power grid that killed seven people and renewed fears over the durability of the hobbled energy network. ",
        "date": " November 21, 2024 ",
        "place": "Kyiv ",
        "subject": "today News"
    },
    {
        "title": "Billionaire Gautam Adani of India’s Adani Group charged in US with bribery, fraudBy Reuters The 62-year-old Adani is worth $69.8 billion according to Forbes magazine, and one of the few billionaires formally accused in the United States of criminal wrongdoing.",
        "text": "Gautam Adani, the billionaire chair of Indian conglomerate Adani Group and one of the world’s richest people, has been indicted in New York over his role in an alleged multibillion-dollar bribery and fraud scheme, US prosecutors said on Wednesday.Authorities said Adani and seven other defendants, including his nephew Sagar Adani, agreed to pay about $265 million in bribes to Indian government officials to obtain contracts expected to yield $2 billion of profit over 20 years, and develop India’s largest solar power plant project.Prosecutors also said the Adanis and another executive at Adani Green Energy, former CEO Vneet Jaain, raised more than $3 billion in loans and bonds by hiding their corruption from lenders and investors.According to an indictment, some conspirators referred privately to Gautam Adani with the code names “Numero uno” and “the big man,” while Sagar Adani allegedly used his cellphone to track specifics about the bribes.Adani Group did not immediately respond to requests for comment outside business hours in India, where the charges were announced early Thursday morning.India’s embassy in Washington did not immediately respond to requests for comment. Lawyers for the defendants could not immediately be identified.Gautam Adani, Sagar Adani and Jaain were charged with securities fraud, securities fraud conspiracy and wire fraud conspiracy, and the Adanis were also charged in a US Securities and Exchange Commission civil case.The other five defendants were charged with conspiring to violate the Foreign Corrupt Practices Act, a US anti-bribery law, and four were charged with conspiring to obstruct justice.None of the defendants is in custody, a spokesperson for US Attorney Breon Peace in Brooklyn said. Gautam Adani is believed to be in India.Built empireThe 62-year-old Adani is worth $69.8 billion according to Forbes magazine, and one of the few billionaires formally accused in the United States of criminal wrongdoing.His fortune makes him the world’s 22nd-richest person, and second-richest in India behind Reliance Industries (RELI.NS), Chair Mukesh Ambani, Forbes said.Adani grew up in India’s Gujarat state, and dropped out of school at age 16.He founded Adani Group in 1988 as a commodities trading firm, and built a business empire that has included airports, shipping ports, power generation, energy transmission and mining companies.The charges were announced hours after Adani on Wednesday raised $600 million by selling 20-year “green” bonds.They also came nearly two years after US short-seller Hindenburg Research accused Adani Group of using offshore tax havens improperly, which the company denied.Hindenburg’s January 2023 report sparked an approximately $150 billion meltdown in Adani Group stocks.Adani planned investments, congratulated TrumpOthers who were criminally charged on Wednesday include Ranjit Gupta and Rupesh Agarwal, respectively a former CEO and former chief strategy and commercial officer of Azure Power Global, which authorities said agreed to pay some of the bribes.The remaining criminal defendants worked for Caisse de Depot et Placement du Quebec, a Canadian institutional investor, and included Cyril Cabanes, who was also an Azure director. He was also charged with wrongdoing by the SEC.All of the defendants are Indian citizens apart from Cabanes, a dual French-Australian citizen who has lived in Singapore, prosecutors said.According to court records, a judge has issued arrest warrants for Gautam Adani and Sagar Adani, and prosecutors plan to hand those warrants to foreign law enforcement.Last week, Gautam Adani posted on social media platform X that his conglomerate planned to invest $10 billion in US energy security and infrastructure projects, creating a potential 15,000 jobs, without providing a timetable.Adani announced the investment while also congratulating US President-elect Donald Trump on his election win.Trump has pledged to make it easier for energy companies to drill on federal land and build new pipelines.Indian Prime Minister Narendra Modi, also from Gujarat, has been accused by political opponents of protecting Adani and his companies, including from Hindenburg’s accusations. Modi has dismissed the opposition’s claims as “lies and abuses.” ",
        "date": " November 21, 2024 ",
        "place": "New York ",
        "subject": "today News"
    },
    {
        "title": "Today’s weather: November 21, 2024By Post Report Stay informed and prepared: Plan your day with The Kathmandu Post’s weather updates.",
        "text": "The weather will be partly cloudy in the hilly areas of the country on Thursday, with fair skies across most of the country. Light rain is likely in one or two places in the hilly regions of Koshi, Bagmati, and Gandaki provinces. Some high-altitude areas in these provinces may also experience light snowfall. Tonight, the hilly regions will remain partly cloudy, while the rest of the country will have mainly fair weather. The Meteorological Forecasting Division attributed the current conditions to the partial influence of westerly winds.On Wednesday, Janakpur reported the highest temperature at 33°C, while Jumla experienced the lowest temperature at -3.1°C. In Kathmandu, the maximum temperature reached 21.5°C, with a minimum of 9.2°C. ",
        "date": " November 21, 2024 ",
        "place": "Kathmandu ",
        "subject": "today News"
    },
    {
        "title": "Telling Nepal’s storyBy Anish Ghimire English writer and journalist Thomas Bell discusses coming to Nepal two decades ago, the state of contemporary journalism and his new book ‘Human Nature’.",
        "text": "Thomas Bell is a man of few words. When we decided to meet at Cafe Cheeno in Patandhoka following the launch of his book, ‘Human Nature’, I expected our conversation to last for an hour, but we were done within twenty minutes. Bell studied at the University of Oxford and the Courtauld Institute of Art in London. Fresh from graduation, he came to Kathmandu for the first time in 2002 as an international correspondent to cover the ongoing civil war. He ended up staying longer than he would have imagined—eighteen years. His books, ‘Kathmandu’ (2014) and ‘Human Nature’ (2024), result from his in-depth reporting, travels and research on Nepal and the Nepali people.Currently living in the UK, Bell, a former South East Asia correspondent for the UK Daily Telegraph, is more inclined towards books than journalism. In this chat with the Post’s Anish Ghimire, Bell discusses coming to Nepal, the state of contemporary journalism and his new book ‘Human Nature’.Have you always wanted to be a journalist? Not exactly. After I finished university, I began looking around, thinking about what I should do, and journalism seemed like it would combine a few things I was interested in: politics, travel, and writing. So it was a choice I made later.What made you come to Nepal during a difficult period and write ‘Kathmandu’?Well, I came here because it was a difficult period. I had recently graduated in history and wanted to be a foreign correspondent. So, I looked around, considered a few options, and chose Nepal. It felt like the right option because of what was happening in the country. Right after the royal massacre, the Maoists were making progress in the countryside, and the world was paying attention to Nepal. It seemed like a nice place to travel around as well. The country grew on me, and I ended up staying for about eighteen years.How did your time in Nepal shape your understanding of the complex relationship between the country’s history, culture and politics? I was primed to think about those relationships because of what I studied at the university. Alongside a degree in history, I also acquired another degree in architectural history. So, writing about it came naturally. Plus, I was interested in learning about the country’s culture, politics, and architecture. I dug deeper to write about how the streets, the squares, the chowks, and the buildings worked together.I have done something similar with the new book, ‘Human Nature’, but instead of built-in environments, it’s about the hills, mountains, forests, and rivers. You’ve been in journalism for a long time, having worked for the Economist and The Daily Telegraph. How has journalism changed since you arrived in Nepal for the first time? Journalism around the world has changed a lot. Today, there is a lot less money in it. When I started, Nepal was going through a difficult period, and there were plenty of stories to report. A young man like me could make a decent living abroad because newspapers paid my freelance work a modest amount.However, that is not the case anymore because of industry changes and the emergence of the internet. The media worldwide lacks resources, and people get their news by other means. Another big difference is when I first came here, a few Nepali journalists reported in English for foreign media. Now, that space is filled up by many local reporters who can do much better than an outsider. So, that’s good progress.Some of the changes in the industry brought about by the internet have also affected the domestic media landscape here. Newspapers are struggling for business. For the last few days, I have been trying to find newspapers in the market; there weren’t many shops selling them.Your new book, ‘Human Nature’, explores Nepal’s history. What aspect of the country do you believe is most misunderstood?This book looks at Nepal’s history but from a particular lens—in terms of the relationships between society, culture, and the environment. So, it’s kind of an environmental history. Something that might be new to the readers is the discussion of the role of agriculture.Prithvi Narayan Shah is celebrated as a military and political genius who rose from the micro-kingdom of Gorkha to unify Nepal. By his death in 1775, he had conquered the Kathmandu Valley and established it as his capital. He laid the foundation for the Gorkhali Empire, which briefly spanned the Himalayas from Sikkim to Punjab. His success is often attributed to his strategic brilliance and patriotic vision, portraying him as a unifier of a fragmented land. A key aspect of his strategy was rewarding soldiers with land, creating a land-military system that fueled his empire’s expansion. However, this narrative is intertwined with a more profound history: the rise of agriculture, particularly rice farming. Rice cultivation had been spreading eastward in Nepal long before King Shah’s time, fostering the growth of small kingdoms. Unlike foraging or pastoralism, rice farming produced surplus food, which brought about taxation and the establishment of villages, kings, laws, and temples. This agricultural transformation necessitated greater social and military organisation, creating the conditions for unification. King Shah and his successors finalised this process, consolidating the numerous ‘rice kingdoms’ into a single nation, completing a centuries-long evolution of agrarian society into a centralised state.How similar or different is writing a piece and writing a book?I don’t do much journalism these days. The only writing I do is for my books, which come out occasionally. But yeah, the writing process is very different. Writing a short piece is merely a thousand words, whereas a book is about eighty thousand words. The difference is like running a marathon and a sprint, I guess. Thomas Bell’s book recommendationsThe Cat’s Table Author: Michael OndaatjePublisher: VintageYear: 2011Ondaatje’s novels are extraordinary, and this is probably my favourite. It’s about a boy’s journey on a large ship’s three-week voyage.The Wayward Daughter Author: Shradha GhalePublisher: Speaking Tiger BooksYear: 2018The book convincingly captures the journey of a middle-class girl growing up in Kathmandu during the Nepali civil war.Changes in the LandAuthor: William CrononPublisher: Hill and WangYear: 1983It’s a remarkable work that provides a slim environmental history of the encounter between Native Americans and New England settlers.Crow Author: Ted HughesPublisher: Faber and FaberYear: 1970Hughes’s book is a dark and brilliant anthology of poems telling how God and a crow created the world.Beyond a BoundaryAuthor: CLR James Publisher: HutchinsonYear: 1963The famous Trinidadian Marxist historian was into cricket. This is his masterpiece on colonialism and the sport. ",
        "date": " November 21, 2024 ",
        "place": "kathmandu",
        "subject": "today News"
    },
    {
        "title": "Bandipur, a hill station where time stands stillBy Samjhana Rasaili Tourists have started returning to Bandipur to observe its traditional art and culture, feast their eyes on natural views, and enjoy a clean environment.",
        "text": "When Tanahun’s headquarters shifted to Damauli from Bandipur in November 1968, hordes of traders from Bandipur left for key cities like Chitwan, Damauli, Kathmandu, and Pokhara. The identity of Bandipur was at risk when the traders, along with the district headquarters, shifted.However, Bandipur has changed its identity due to the role of locals in cultural heritage conservation through community participation.Bikram Piya, a 55-year-old local, said that after the construction of the Prithvi Highway, if the headquarters had remained in Bandipur, people residing in the western part of Tanahun would be greatly inconvenienced in accessing government services.  “Therefore, Damauli is perfect for the district headquarters from the accessibility point of view.”Bandipur's history, a hilltop settlement 143 km west of Kathmandu and 80 km east of Pokhara, began in the 19th century when Newars from Bhaktapur arrived.Before that, it was inhabited mainly by Magars. After Prithvi Narayan Shah conquered Kathmandu Valley, the Newar merchants chose Bandipur as a trade route between India and Tibet. The merchants built their houses so as to reflect their style, architecture, and culture. Thus, the houses consist of pagoda-style roofs, lattice windows, and ornate doorways.Today, it is one of the most famous tourist destinations of Nepal. “The living culture, structure and natural beauty are the defining features of Bandipur,” said Piya.The Magars used to live in Bandipur and gave the place its name. In the Magar language, ‘Ban’ means forest, ‘Di’ means water, and ‘Pur’ means place. Civilisations have relied on forests and water since ancient times.According to old local documents, first Piya, then Pradhan, Shrestha, and Joshi settled here, and then other Newar types came.Bikram, a ninth-generation settler, says: “Bandipur is a living museum of Newari art and culture.”“Bandipur sits in the best of nature. It is also an appropriate place for business. That’s why it became a big draw for Newars from Bhaktapur,” said Chij Kumar Shrestha, an 80-year-old local. “Ancestors settled where there was water, land and jungle. Mine did the same too.”Trade was the major occupation of Newars. They supplied salt, edible oil, and other goods from Thori, Chitwan, on the Nepal-India border, and sold them in Bandipur Bazaar.Shrestha said that Bandipur developed as a trading point between the south and north. Goods imported from India used to be supplied to the hills and mountain areas like Tanahun, Kaski, Lamjung, and Gorkha, and goods brought from the hills and mountains would be supplied to the south from Bandipur.As highway expansion took place and traders started shifting to Chitwan, Kathmandu, Damauli, Pokhara, and Dumre, business activities in Bandipur started to slow down.“As young people moved away, the villages were left with old people. Even if tourists, by any chance, were found in Bandipur, they called it a ghost town,” said Sujan Shrestha, a 50-year-old local.Moved by the situation, people from Bandipur living in Kathmandu formed the Bandipur Social Development Committee in 1992. The committee's president, Sujan Shrestha, said the objective was to unite the people of Bandipur in tourism, education, and health.Sujan said Bandipur was promoted internationally because it represents different ethnicities' natural and cultural richness.“Foreign tourists started arriving, and homestays started to open,” said Sujan. “Training sessions on hospitability were provided on services ranging from tea brewing to homestay operations.” All types of vehicles started operating in Bandipur Bazaar in 1999. However, they were restricted due to the paving of market areas with stones.Bandipur is a destination preferred by those who want to escape crowds and pollution. A pleasant mountain range can be observed from the high hill of Bandipur, including the view of the rising and setting sun. A wide view of mountains is another feature of Bandipur.An open area stretches 3 km on the horizon, and hills can be observed from Tundikhel, a 10 minute walk from Bandipur.From top to bottom, mountain ranges like Langtang, Ganesh, Gorkha (Manaslu, Himchuli, and Boudha), Annapurna, Dhaulagiri, Machhapuchchhre, and Kanjirowa can be observed.A natural view tower, the land area near Marsyangdi River can also be observed from Bandipur.Developed as one of the outstanding tourism destinations of Gandaki province, Bandipur is also known as the ‘Queen of Hills.’ Located at a height of 1,317 metres, Bandipur is popular for its perfect view of mountain ranges and its cultural and religious significance. The living culture and natural beauty are the defining features of the old Tanahun district headquarters, says a 55-year-old local resident.  Post Photo “Agro-eco tourism and adventure tourism is the big draw of Bandipur,” said Kishan Pradhan, president of the Bandipur Tourism Development Committee.Tourism activity, which has slowed down due to the devastating earthquake of 2015 and the Covid-19 pandemic, is gradually reviving.“The presence of domestic and international visitors is now good,” said Pradhan.Bipin Pradhan, a hotelier, said traditional art and culture, natural views, and a clean environment are the reasons why domestic and foreign tourists come.Siddha Cave in Bandipur, a rural municipality, is claimed to be Asia’s largest.Basanta Poudel, secretary of Bandipur Tourism Development Committee, said Bandipur is also an appropriate place for hiking.“Bhanjyang and resting area located at the height of 1,150 metres from sea level, paragliding from Gurungche Hill attracts tourists,” said Basanta.Around 90 big and small hotels and restaurants are operating in Bandipur, while four community homestays in the market area and 11 in the rural municipality are in operation.The hotel and homestay services in Bandipur can cater to 5,000 people.To increase tourists' stay, a mini great wall was constructed in 2019. The 6-km wall is being constructed from Thanimai temple to Mukundeshwari hill.The construction of the mini-great wall is expected to cost around Rs20 million.“The construction of structures like this can attract tourists,” said Surendra Bahadur Thapa, chairman of the rural municipality.Construction of projects like Thanimai temple, selfie garden, paragliding area, horse riding arena, Pushpalal memorial garden, Mukundeshwari garden, and a glass bridge is moving ahead. ",
        "date": " November 21, 2024 ",
        "place": "Tanahun ",
        "subject": "today News"
    },
    {
        "title": "Antimicrobial resistance widespread among intensive care patients in NepalBy Post Report Misuse of antibiotics in healthcare and agriculture is fuelling a ‘silent pandemic,’ experts warn.",
        "text": "Antimicrobial resistance is a common problem for most patients requiring intensive care in hospitals. What alarms doctors and experts is that the problem is not limited to patients with serious ailments but it also affects those seeking outpatient care.The irrational use of antimicrobials in humans, animals, and plants has led to a ‘silent pandemic’, and many people, including policymakers, have not taken the issue seriously.“Misuse, random use, and irrational use of antimicrobials, which can be purchased over-the-counter, has been leading to a serious crisis in our country,” said Dr Raju Pangeni, a pulmonary and critical care physician at Hams Hospital. “Most patients arrive at the hospital after using higher-grade antibiotics.”Experts warn that antimicrobials, which have saved millions of lives throughout the world, could soon become ineffective due to the high resistance rate caused by their irrational use.The World Health Organisation said antimicrobial resistance occurs when bacteria, viruses, fungi and parasites evolve over time and no longer respond to medicines, making infections harder to treat and increasing the risk of disease spread, severe illness, and death. As a result, medicines become ineffective and infections persist in the body, increasing the risk of their spread to others.Antibiotics, despite being prescription drugs, can be easily purchased over the counter in Nepal. Many people buy them without explaining their exact problems to pharmacists. And in many cases, pharmacists do not bother to inquire and fail to emphasise the importance of completing the prescribed course of medicine, which is among the main reasons for the growing rate of antimicrobial resistance, according to experts.Moreover, doctors usually prescribe antibiotics based on clinical diagnoses, even before receiving laboratory test reports. Experts say antibiotics do not work if the underlying infection is caused by a virus. According to experts, a patient’s sensitivity to antibiotics must be known before prescribing them, but very few doctors take the time to understand their patients' sensitivity to the drugs they prescribe. Patients are also unaware that the course of antibiotics must be completed and stopping them halfway could render the same antibiotic ineffective in the future. According to a 2021 study of the Nepal Health Research Council (NHRC), only 32 percent of the doctors and health workers have access to laboratories for antibiotic susceptibility testing. Among them, only 49 percent recommend antibiotic susceptibility testing before prescribing antibiotics. This means that only 16 percent of doctors recommend antibiotics after conducting susceptibility testing.“There is a significant reason influencing rational prescriptions of antibiotics,” the report stated. The study also shows that more than one-third—37.8 percent—of prescribed medicines were antibiotics, which is higher than the World Health Organisation’s standards.The study shows about one-fourth (22 percent) of the outpatients did not consume a full course of antibiotics. Similarly, about 10 percent of outpatients consume antibiotics as prophylaxis while eight percent take double-dose antibiotics for a quick recovery. Around 22 percent of them save leftover antibiotics for the treatment of similar symptoms in the future. Additionally, around 28 percent of outpatients said they buy antibiotics without doctors’ or health workers’ prescriptions. While human antibiotic use contributes to antibiotic resistance, the widespread use of antibiotics in agricultural applications—most notably livestock and poultry production—is also a potential driver. Doctors say agricultural antibiotics contribute to the presence of resistant bacteria in meat and poultry products. Also, resistant organisms are released from farms into soil, groundwater, and surface waterways, leading to contamination of water sources used for crop irrigation and domestic purposes.The NHRC study showed around 70 percent of farmers used progressively higher doses of antibiotics and more frequently for faster recovery of sick animals or fowls. The study identified major shortcomings in the awareness and availability of national guidelines for prescribing antibiotics and infrastructures for recommending antibiotic susceptibility tests among human and animal health professionals. In a study of human, animal, and environmental samples carried out in the past, antimicrobial resistance genes were detected in 81 percent of the total samples on which antimicrobial resistance tests were carried out. ",
        "date": " November 21, 2024 ",
        "place": "Kathmandu ",
        "subject": "today News"
    },
    {
        "title": "Land mounds offer refuge to wildlife during floodingBy Ramesh Kumar Paudel Chitwan’s Baghmara Buffer Zone Community Forest has constructed two land mounds, each 36 metres long, 25 metres wide, and about seven feet high.",
        "text": "The forest area in Baghmara, a buffer zone community forest and major tourist destination near Sauraha in Chitwan, is inundated each year during the rainy season. Floodwaters from the Budhi Rapti river enters the forest area of Baghmara, severely affecting wildlife. Many wild animals, according to conservationists, are swept away by the flooding and inundation.To address the recurring problem, the Baghmara Buffer Zone Community Forest has constructed land mounds in the forest areas. According to Jit Bahadur Tamang, the chairman of the Baghmara Buffer Zone Community Forest Users’ Committee, the land mounds were built in the central and the southern parts of the forest before summer season this year. \"The land mounds have been a huge relief for wildlife like deer, rabbits,\" said Tamang. The community forest, spread over an area of 215 hectares, is home to diverse flora and fauna. Wildlife enthusiasts visit the area to get a glimpse of spotted deer, rhinos, several species of birds, and even tigers.The Budhi Rapti river passes through Baghmara Buffer Zone Community Forest and empties into the Rapti river to the south. With much of the forest located in lowlands near the riverbanks, almost 70 percent of the forest area gets inundated during the rainy season, according to Tamang.Baghmara Buffer Zone Community Forest Users’ Committee constructed the land mounds in April-May. Each mound is 36 metres long and 25 metres wide, and about seven feet high.\"Floodwaters can rise as high as five feet on the mounds, but animals can climb up and stay safe,\" said Tamang, adding that he saw many animals taking refuge on the mounds during the recent floods.Each mound covers around three kattha of land and the forest users' committee spent Rs1.1 million on the construction.\"This year, the Baghmara forest area saw big flooding, but the wild animals remained largely unaffected thanks to the mounds, which were constructed right before the rainy season. In 2017, floods swept away many animals and some of them died,\" said Tamang.Baghmara forest is a favoured destination for visitors to Sauraha, a popular wildlife tourism hub. Tourists often visit the forest for boat rides along the Budhi Rapti river and splendid views of the forest from the view tower constructed in the middle of the forest. The area is renowned for its elephant safaris and is home to spotted deer, one-horned rhinos, wild boars and leopards. Tigers are also spotted in the area quite frequently.\"So it is very essential to protect wildlife in the Baghmara area and promote tourism. It seems that more such mounds are needed in three other parts of the community forest,\" said Tamang.Conservationists have hailed the Baghmara Buffer Zone Community Forest Users’ Committee for constructing the mounds. Abinash Thapa Magar, information officer at the Chitwan National Park, praised the mounds for protecting animals from floods.\"Such land mounds have proven effective in buffer zone forests. Some areas of the national park area are also prone to flooding, but no such structures have been built there,\" said Thapa Magar.Floods in the Chitwan National Park, the country's first national park, and its surroundings often sweep away large animals, including rhinos, some of which are carried as far as India. ",
        "date": " November 21, 2024 ",
        "place": "Chitwan ",
        "subject": "today News"
    },
    {
        "title": "Police probe Prasai on cybercrime as district court gives 5-day remandBy Post Report Crime Investigation Bureau spokesman says cybercrime probe will tell if he needs to be further investigated.",
        "text": "The Kathmandu District Court on Wednesday permitted police to hold controversial medical entrepreneur Durga Prasai in custody for five days.Police arrested Prasai on Tuesday on charges of cybercrime for disseminating false information against Prime Minister KP Sharma Oli on social media.Through a video call with another person, Prasai made some documents public alleging that Prime Minister Oli has invested Rs32.5 billion in a telecom company in Cambodia.On Tuesday, a screenshot of the allegation was widely circulated on social media, and some media outlets even published news reports based on that. In one of the videos, Prasai claims that he spent over Rs10 million to obtain the documents related to Oli’s investment.However, Oli’s purported signature on the document that Prasai made public, which went viral on social media, was false, and his name was spelt incorrectly. The Central Investigation Bureau (CIB) of Nepal Police apprehended Prasai from his residence in Bhaktapur on the charge of cybercrime that was later handed to the Cyber Bureau of Nepal Police. The bureau presented Prasai to the Kathmandu District Court on Wednesday and obtained permission to detain him for five days. Superintendent of Police Deepak Raj Awasthi, spokesperson for the Cyber Bureau, confirmed that the Kathmandu District Court on Wednesday granted them the permission. According to Awasthi, the bureau would only investigate Prasai's involvement in cybercrime.“If Prasai is to be investigated on charges other than cybercrime, the CIB will do it,” Awasthi told the Post. CIB spokesperson Hobindra Bogati said the police are investigating Prasai under section 47 of the Electronic Transaction Act 2008. The investigation report of the cybercrime will determine whether there should be further investigation on him. If yes, it will also be based on the cybercrime report, Bogati said.“As Prasai has been arrested twice under Section 47 of the Electronic Transaction Act 2008, if proven guilty, chances remain of him being punished to a maximum degree,” Bogati told the Post.Section 47 (1) of the Act states that if any person publishes or displays any material on electronic media that is prohibited from publishing or displaying by the prevailing law, they shall be liable to a fine not exceeding Rs100,000 or be punished with imprisonment not exceeding five years or with both.If any person repeats an offence as referred to in Sub-section (1), they shall be liable to the punishment for each time—one and one-half percent of the previous punishment, reads sub-section (2) of the law.Earlier, with an order from the Kathmandu District Court, the Nepal Police arrested Prasai on September 18 on charges of violating the Electronic Transaction Act-2008.However, the Kathmandu District Court on October 1 ordered his release on Rs100,000 bail. Police had arrested him based on a complaint by Rastriya Swatantra Party central committee member Tika Sangraula and other women, accusing him of character assassination.Prasai was nominated a central committee member of the CPN-UML after the 10th general convention held in November 2021 and was considered close to UML chair Oli.The UML, however, expelled Prasai from the party in February 2023 after he led a campaign to reinstate monarchy. He organised various events to felicitate former king Gyanendra Shah in his home district Jhapa. Prasai was previously affiliated to the CPN (Maoist Centre). ",
        "date": " November 21, 2024 ",
        "place": "Kathmandu ",
        "subject": "today News"
    },
    {
        "title": "Congress and UML scramble to resolve differences over BRI ",
        "text": "After the Nepali Congress raised “serious” objections over some of the provisions and contents of the proposed implementation plan of the Belt and Road Initiative (BRI), a meeting of the top ruling party leaders on Tuesday evening decided to narrow down the differences so that a memorandum of understanding on BRI could be signed during the China visit of Prime Minister KP Sharma Oli scheduled for the first week of December.While the prime minister and his party, CPN-UML, want to make some sort of agreement or understanding on BRI during the visit, Congress, the key backer of Oli, however, has put forward strong reservations over some components of the BRI implementation plan forwarded by the Chinese side in early 2020. The Congress party is also against taking any loans to implement the projects due to the country’s heavy debt burden. In order to narrow down the differences over the BRI implementation plan, top leaders of both parties and the ministers concerned are meeting every other day but have so far failed to reach a consensus, according to party leaders.But both documents related to the BRI—the framework agreement signed between Nepal and China in May 2017 and the proposed implementation plan—have yet to be made public and remain outside the general discourse of the House of Representatives and other public spheres.The government has not released these documents despite repeated demands from lawmakers of the Congress and the Rastriya Swatantra Party to make them public. “We have demanded the document be made public and provided to us for broader discussion,” said Raj Kishore Yadav, chairman of the International Relations and Tourism Committee of the House of Representatives. “But the Ministry of Foreign Affairs has not provided it to us.” “During the discussion at the committee in July-end with Foreign Minister Arzu Rana Deuba, the committee had asked her to provide the documents for wider discussion, but the ministry has yet to do so,” said Yadav. “We will write to them again.”“Without having the documents public, how can we initiate the debate and deliberation?” said Yadav.He said that any document related to geopolitics or proposed by neighboring countries should be discussed in public spheres and inside the House to ensure transparent and fair discussion.But without making both documents public, the Congress-UML government is preparing to sign a memorandum of understanding (MoU) on BRI during Prime Minister Oli’s visit to China, although the official date of the visit has yet to be announced.Amid disagreement over how to approach the BRI and its implementation plan proposed by China, a political mechanism of the Congress and UML headed by Oli and Congress President Sher Bahadur Deuba held talks in Baluwatar on Tuesday evening to discuss ways to narrow down the differences. They have also formed an informal task force of four members—two from each party—to resolve the differences, according to leaders.The taskforce will soon be constituted and it will rework the BRI implementation plan by making some changes, which will then be sent to the Chinese side for their consent, two leaders of the Congress and the UML told the Post.After the taskforce prepares a list of amendments Nepal needs to incorporate in the proposed BRI implementation plan, it will be finalised by Finance Minister Bishnu Paudel and Foreign Minister Rana.“We will sign an MoU on BRI during the visit, which is just an understanding between Nepal and China based on our mutual understanding in the past,” Yubaraj Khatiwada, the economic adviser to Prime Minister Oli, told the Post.The taskforce will separate certain components proposed in the BRI implementation plan, and will make significant revisions based on the understanding between Oli and Deuba during Tuesday's meeting.Besides rejecting the loan-based funding modality of the BRI, Congress leaders have been saying that, for any loans, Nepal should stick to the same conditions as with multilateral and bilateral lenders.“If 80 percent of grants provided by a particular country return to the same country, then why do we need the grant?” Pradeep Gyawali, deputy secretary general of the UML said at a press meet on Wednesday. “We selected nine projects under the BRI framework but we have yet to finalise the funding modality,” he added.One office bearer of the Nepali Congress said: “We have also objections to some of the contents of the BRI implementation plan because it looks like a political document and has some strategic and geopolitical connotations that we want to remove.”The Congress leader added: “We want to focus on project-specific agreements during the visit and agreements that deal exclusively with infrastructure, connectivity and energy-related projects.”Congress General Secretary Gagan Thapa said his party wants to collaborate with big and neighbouring countries to develop large-scale projects in Nepal.“At this moment, we want to develop such projects through grants to fulfill our development aspirations. We also want to see the execution of past accords and agreements so that we can move on to sign new ones,” Thapa said. “We also know that our partner in the government has differing views. But we will find a common ground with the UML on BRI.”During the Tuesday evening meeting, Oli and UML leaders suggested that Nepal cannot backtrack on its past commitments with China and stressed the need for expediting BRI projects for the country’s economic development.“No agreement originating from any country can be accepted if it clashes with our interests. There must be coherence between the BRI framework agreement signed in 2017 and the BRI implementation plan. But some provisions of the implementation plan do not align with the 2017 agreement. That’s why we seek significant changes,” a Congress office bearer told the Post requesting anonymity.The task force will study the nitty-gritty of the BRI implementation plan, and will remove some provisions like the implementation of the Mutual Legal Assistance agreement signed in 2019 during Chinese President Xi’s Nepal visit. Other issues, including border security cooperation, climate change cooperation, making common positions between the two countries in international forums, and cooperation in the field of science and technology, may also be excluded from the revised draft, according to Congress leaders.Bishnu Rimal, chief political adviser to Prime Minister Oli, said they are currently studying past agreements and pacts signed with China since Oli’s first visit to the northern neighbour in 2016. He said they are also working to secure previously committed Chinese aid. Since 2008, China has announced over Rs80 billion in grants to Nepal on different occasions. A larger sum, 3 billion RMB (around Rs60 billion) was promised during President Xi’s state visit in October 2019.“We failed to submit projects and programmes to the Chinese side to utilise the aid announced on different occasions. Now we are revisiting these matters and planning to pursue them during the prime minister’s visit. We are also reviewing the past agreements and accords particularly reached between Nepal and China after 2016 and taking an update on their implementation status,” said Rimal.He also said that no new projects would be proposed during the visit, as the focus will be on reviewing and implementing past accords.Foreign Minister Rana, who is set to visit China after a trip to Japan, has been tasked with making preparations for the prime minister’s visit, and wants to see some concrete developments ahead of her trip. Though an official announcement of her China visit has yet to be made, she is expected to meet her Chinese counterpart Wang Yi on November 29 in Beijing.Pradeep Gwayali, UML deputy general secretary and former foreign minister, expressed hope that Congress and UML leaders will resolve their differences before the prime minister’s visit.“During the visit, an agreement on the BRI will be signed, but no specific project will be finalised. After signing the agreement, negotiation on the funding modalities may start. Currently, none of the nine projects agreed under the BRI framework in 2018 has made any progress, as feasibility studies for some are still going on. I hope the modality of the BRI-related projects will be concluded and signed during the visit,” said Gyawali while urging the Congress not to create “unnecessary uproar over the BRI pact that was signed when the Congress was a governing partner”. ",
        "date": " November 21, 2024 ",
        "place": "Kathmandu ",
        "subject": "today News"
    },
    {
        "title": "Indian Army Chief General Dwivedi arrives in Kathmandu ",
        "text": "Indian Army Chief General Upendra Dwivedi arrived in Kathmandu on Wednesday on a five-day official visit. The five-member delegation, led by General Dwivedi, also includes Sunita Dwivedi, chairperson of the Army Wives Welfare Association of the Indian Army. Upon arrival at Tribhuvan International Airport, the delegation was received by Major General Prem Dhoj Adhikari, head of the Department of Military Operations of Nepal Army, according to the Nepal Army Directorate of Public Relations and Information. The Indian Embassy in Kathmandu said that General Dwivedi discussed issues concerning bilateral relations between the two countries with the Indian Ambassador to Nepal Naveen Srivastava later in the afternoon.During the Nepal visit, President Ramchandra Paudel will confer General Dwivedi with the honorary rank of General of the Nepali Army at a special ceremony at the President’s Office on Thursday. Nepal and India have a long-standing tradition of honouring each other’s army chiefs with this honorary rank. In addition to meeting President Paudel, Prime Minister KP Sharma Oli and his counterpart, General Sigdel Dwivedi is scheduled to visit several locations. The Indian Army is a significant military donor to Nepal. General Dwivedi has been serving as the Indian Army Chief since June 30. Ahead of his visit, Amrit Mohan Prasad, director general of India’s Sashastra Seema Bal (SSB), visited Nepal to attend the eighth annual coordination meeting between SSB and Nepal’s Armed Police Force. During the two-day meeting that concluded on Monday, the two sides expressed concerns over the movement of third-country nationals through the Nepal-India border. ",
        "date": " November 20, 2024 ",
        "place": "Kathmandu ",
        "subject": "today News"
    },
    {
        "title": "Bandipur, a hill station where time stands still ",
        "text": "When Tanahun’s headquarters shifted to Damauli from Bandipur in November 1968, hordes of traders from Bandipur left for key cities like Chitwan, Damauli, Kathmandu, and Pokhara. The identity of Bandipur was at risk when the traders, along with the district headquarters, shifted.However, Bandipur has changed its identity due to the role of locals in cultural heritage conservation through community participation.Bikram Piya, a 55-year-old local, said that after the construction of the Prithvi Highway, if the headquarters had remained in Bandipur, people residing in the western part of Tanahun would be greatly inconvenienced in accessing government services.  “Therefore, Damauli is perfect for the district headquarters from the accessibility point of view.”Bandipur's history, a hilltop settlement 143 km west of Kathmandu and 80 km east of Pokhara, began in the 19th century when Newars from Bhaktapur arrived.Before that, it was inhabited mainly by Magars. After Prithvi Narayan Shah conquered Kathmandu Valley, the Newar merchants chose Bandipur as a trade route between India and Tibet. The merchants built their houses so as to reflect their style, architecture, and culture. Thus, the houses consist of pagoda-style roofs, lattice windows, and ornate doorways.Today, it is one of the most famous tourist destinations of Nepal. “The living culture, structure and natural beauty are the defining features of Bandipur,” said Piya.The Magars used to live in Bandipur and gave the place its name. In the Magar language, ‘Ban’ means forest, ‘Di’ means water, and ‘Pur’ means place. Civilisations have relied on forests and water since ancient times.According to old local documents, first Piya, then Pradhan, Shrestha, and Joshi settled here, and then other Newar types came.Bikram, a ninth-generation settler, says: “Bandipur is a living museum of Newari art and culture.”“Bandipur sits in the best of nature. It is also an appropriate place for business. That’s why it became a big draw for Newars from Bhaktapur,” said Chij Kumar Shrestha, an 80-year-old local. “Ancestors settled where there was water, land and jungle. Mine did the same too.”Trade was the major occupation of Newars. They supplied salt, edible oil, and other goods from Thori, Chitwan, on the Nepal-India border, and sold them in Bandipur Bazaar.Shrestha said that Bandipur developed as a trading point between the south and north. Goods imported from India used to be supplied to the hills and mountain areas like Tanahun, Kaski, Lamjung, and Gorkha, and goods brought from the hills and mountains would be supplied to the south from Bandipur.As highway expansion took place and traders started shifting to Chitwan, Kathmandu, Damauli, Pokhara, and Dumre, business activities in Bandipur started to slow down.“As young people moved away, the villages were left with old people. Even if tourists, by any chance, were found in Bandipur, they called it a ghost town,” said Sujan Shrestha, a 50-year-old local.Moved by the situation, people from Bandipur living in Kathmandu formed the Bandipur Social Development Committee in 1992. The committee's president, Sujan Shrestha, said the objective was to unite the people of Bandipur in tourism, education, and health.Sujan said Bandipur was promoted internationally because it represents different ethnicities' natural and cultural richness.“Foreign tourists started arriving, and homestays started to open,” said Sujan. “Training sessions on hospitability were provided on services ranging from tea brewing to homestay operations.” All types of vehicles started operating in Bandipur Bazaar in 1999. However, they were restricted due to the paving of market areas with stones.Bandipur is a destination preferred by those who want to escape crowds and pollution. A pleasant mountain range can be observed from the high hill of Bandipur, including the view of the rising and setting sun. A wide view of mountains is another feature of Bandipur.An open area stretches 3 km on the horizon, and hills can be observed from Tundikhel, a 10 minute walk from Bandipur.From top to bottom, mountain ranges like Langtang, Ganesh, Gorkha (Manaslu, Himchuli, and Boudha), Annapurna, Dhaulagiri, Machhapuchchhre, and Kanjirowa can be observed.A natural view tower, the land area near Marsyangdi River can also be observed from Bandipur.Developed as one of the outstanding tourism destinations of Gandaki province, Bandipur is also known as the ‘Queen of Hills.’ Located at a height of 1,317 metres, Bandipur is popular for its perfect view of mountain ranges and its cultural and religious significance. The living culture and natural beauty are the defining features of the old Tanahun district headquarters, says a 55-year-old local resident.  Post Photo “Agro-eco tourism and adventure tourism is the big draw of Bandipur,” said Kishan Pradhan, president of the Bandipur Tourism Development Committee.Tourism activity, which has slowed down due to the devastating earthquake of 2015 and the Covid-19 pandemic, is gradually reviving.“The presence of domestic and international visitors is now good,” said Pradhan.Bipin Pradhan, a hotelier, said traditional art and culture, natural views, and a clean environment are the reasons why domestic and foreign tourists come.Siddha Cave in Bandipur, a rural municipality, is claimed to be Asia’s largest.Basanta Poudel, secretary of Bandipur Tourism Development Committee, said Bandipur is also an appropriate place for hiking.“Bhanjyang and resting area located at the height of 1,150 metres from sea level, paragliding from Gurungche Hill attracts tourists,” said Basanta.Around 90 big and small hotels and restaurants are operating in Bandipur, while four community homestays in the market area and 11 in the rural municipality are in operation.The hotel and homestay services in Bandipur can cater to 5,000 people.To increase tourists' stay, a mini great wall was constructed in 2019. The 6-km wall is being constructed from Thanimai temple to Mukundeshwari hill.The construction of the mini-great wall is expected to cost around Rs20 million.“The construction of structures like this can attract tourists,” said Surendra Bahadur Thapa, chairman of the rural municipality.Construction of projects like Thanimai temple, selfie garden, paragliding area, horse riding arena, Pushpalal memorial garden, Mukundeshwari garden, and a glass bridge is moving ahead. ",
        "date": " November 21, 2024 ",
        "place": "Tanahun ",
        "subject": "today News"
    },
    {
        "title": "Cooperative victims protest at Maitighar ",
        "text": "Cooperative victims staged a protest at Maitighar, Kathmandu, on Wednesday, demanding the return of their savings. The demonstration turned tense as clashes broke out between the protesters and police near the Nepal Army headquarters gate.The march, which began from Thapathali, was intervened by police, leading to confrontations as the agitators attempted to advance further ahead. Several demonstrators sustained injuries during the scuffle. The victims have been demanding the return of their savings deposited in cooperatives, which they claim have been embezzled. Various studies, including the one carried out by the special parliamentary committee formed to probe irregularities in the sector, have concluded that billions of rupees from hundreds of cooperatives have been embezzled across the country.Here are some photos of the protest by the Post’s photojournalist Angad Dhakal.",
        "date": " November 20, 2024 ",
        "place": "kathmandu",
        "subject": "today News"
    },
    {
        "title": "Police probe Prasai on cybercrime as district court gives 5-day remand ",
        "text": "The Kathmandu District Court on Wednesday permitted police to hold controversial medical entrepreneur Durga Prasai in custody for five days.Police arrested Prasai on Tuesday on charges of cybercrime for disseminating false information against Prime Minister KP Sharma Oli on social media.Through a video call with another person, Prasai made some documents public alleging that Prime Minister Oli has invested Rs32.5 billion in a telecom company in Cambodia.On Tuesday, a screenshot of the allegation was widely circulated on social media, and some media outlets even published news reports based on that. In one of the videos, Prasai claims that he spent over Rs10 million to obtain the documents related to Oli’s investment.However, Oli’s purported signature on the document that Prasai made public, which went viral on social media, was false, and his name was spelt incorrectly. The Central Investigation Bureau (CIB) of Nepal Police apprehended Prasai from his residence in Bhaktapur on the charge of cybercrime that was later handed to the Cyber Bureau of Nepal Police. The bureau presented Prasai to the Kathmandu District Court on Wednesday and obtained permission to detain him for five days. Superintendent of Police Deepak Raj Awasthi, spokesperson for the Cyber Bureau, confirmed that the Kathmandu District Court on Wednesday granted them the permission. According to Awasthi, the bureau would only investigate Prasai's involvement in cybercrime.“If Prasai is to be investigated on charges other than cybercrime, the CIB will do it,” Awasthi told the Post. CIB spokesperson Hobindra Bogati said the police are investigating Prasai under section 47 of the Electronic Transaction Act 2008. The investigation report of the cybercrime will determine whether there should be further investigation on him. If yes, it will also be based on the cybercrime report, Bogati said.“As Prasai has been arrested twice under Section 47 of the Electronic Transaction Act 2008, if proven guilty, chances remain of him being punished to a maximum degree,” Bogati told the Post.Section 47 (1) of the Act states that if any person publishes or displays any material on electronic media that is prohibited from publishing or displaying by the prevailing law, they shall be liable to a fine not exceeding Rs100,000 or be punished with imprisonment not exceeding five years or with both.If any person repeats an offence as referred to in Sub-section (1), they shall be liable to the punishment for each time—one and one-half percent of the previous punishment, reads sub-section (2) of the law.Earlier, with an order from the Kathmandu District Court, the Nepal Police arrested Prasai on September 18 on charges of violating the Electronic Transaction Act-2008.However, the Kathmandu District Court on October 1 ordered his release on Rs100,000 bail. Police had arrested him based on a complaint by Rastriya Swatantra Party central committee member Tika Sangraula and other women, accusing him of character assassination.Prasai was nominated a central committee member of the CPN-UML after the 10th general convention held in November 2021 and was considered close to UML chair Oli.The UML, however, expelled Prasai from the party in February 2023 after he led a campaign to reinstate monarchy. He organised various events to felicitate former king Gyanendra Shah in his home district Jhapa. Prasai was previously affiliated to the CPN (Maoist Centre). ",
        "date": " November 21, 2024 ",
        "place": "Kathmandu ",
        "subject": "today News"
    },
    {
        "title": "Climate change drives dengue as mosquitoes climb to new altitudes ",
        "text": "During monsoon last year, the Chandannath Municipality of Jumla district reported several cases of dengue. The local unit has reported cases of infection from the deadly virus this year too.Although most cases were locally transmitted, health workers in the district don’t consider the virus spread a serious public health problem. This is because Jumla is among the coldest places in the country, with temperatures dipping to subzero levels in the winter.Studies, however, show a disturbing development.“My study shows the presence of Aedes aegypti and Aedes albopictus mosquitoes and their larvae in Chandannath Municipality,” said Buddhi Ram Oli, a PhD scholar at the Central Department of Zoology of the Tribhuvan University. “Chandannath Municipality is located at an elevation of 2,438 metres, and this is the first time that dengue virus-spreading mosquitoes and their larvae have been found at such a high altitude.”Earlier, vectors spreading the deadly disease were recorded only up to 2,100 metres.Local residents and health officials serving in Jumla are aware of the presence of vectors spreading deadly diseases and growing number of infections. But they don’t take the issue seriously, thinking that the vectors cannot survive long due to the climatic conditions of the region.“We once met officials at District Health Office Jumla and discussed launching an awareness drive and destroying breeding sites of mosquitoes,” said Chhatra Bahadur Mahat, health coordinator at the Chandannath Municipality. “But neither does the health office provide a budget for such programmes nor does the local unit allocate any funds. So we couldn’t do anything.”Along with Jumla, all districts across the country have recorded dengue infections this year.Oli, who carried out vector surveillance, said that, as in Chandannath Municipality, health workers at other local units too have not taken the risk of the virus-spread seriously.Experts say the country’s health workers and health facilities are ill prepared to cope with the emerging public health challenges brought about by climate change. Several health facilities were overwhelmed with dengue patients this year, too. Due to a lack of beds, patients were forced to sleep in corridors, on the floor, on chairs, in storerooms, and out in the hospital compound. Hospitals even lacked basic supplies like IV stands, and patients’ visitors had to hold the IV bags or health workers had to improvise by tying them to windows.Experts say the deadly virus outbreak in most mountain districts and all hill districts shows the impact of climate change on Nepal’s healthcare system. Despite these challenges, no effective mitigation measures have been adopted.Many hospitals are overwhelmed with an influx of patients, and health workers are forced to place seriously ill patients in corridors and other makeshift spaces, compromising patient safety.“Our health facilities are not equipped to endure the climate crisis,” said Dr Meghnath Dhimal, chief researcher at the Nepal Health Research Council. “Many are built on hilltops or riverbanks and are vulnerable to climate impacts. These health facilities are also unprepared for emerging problems and surges in patient flow.”Experts say climate change, along with some other factors, such as increased mobility and improved transportation, has been contributing to the spread of deadly diseases in places considered no-risk zones in the past.“The rise in the temperature caused by climate change provides a conducive environment for dengue vectors to thrive and spread in the mountainous areas,” said Dhimal. “Risks posed by climatic factors cannot be ignored or underestimated.”A report by the United Nations titled ‘Climate Change 2022: Impacts, Adaptation and Vulnerability’ states that at least six major vector-borne diseases have recently emerged in Nepal and are now considered endemic, with climate change implicated as the primary driver.The report also showed increasing evidence that climate change has extended the elevational distribution of Anopheles, Culex and Aedes mosquitoes, which carry viruses to above 2,000 metres in Nepal.Dengue is a viral disease transmitted by female Aedes aegypti and Aedes albopictus mosquitoes. According to the World Health Organisation, the same vector also transmits chikungunya, yellow fever, and the Zika virus.So far, 12 people have died due to dengue and over 29,000 have been infected since the start of 2024 if the government data is to be believed. Experts say reported dengue cases may only represent a small fraction of the true scale of the outbreak, as around 90 percent of the infected people do not show any symptoms and health authorities often conceal the actual number of deaths and infections.This year, districts in Tarai region reported fewer cases of dengue infection than districts in the hills and mountains. Experts attribute this to the residents of Tarai’s becoming more aware of the deadly virus and taking preventive measures. High temperatures (above 35 degrees Celsius) could also have contributed to less infection, as mosquito vectors do not survive above 35 degrees Celsius.Over the past few years, dengue has become a year-round threat in Nepal, with cases consistently on the rise. ",
        "date": " November 12, 2024 ",
        "place": "Kathmandu ",
        "subject": "today News"
    },
    {
        "title": "Exports hit as India wants ‘no Chinese component’ in Nepali goods ",
        "text": "Manufacturers and exporters say they are in a dilemma over trade with India following the restrictive measures imposed by New Delhi on Nepali goods. Making matters worse is the Nepali government’s silence even though the goods have not been sold to India for months.Dol Raj Adhikari, president of the Nepal Sanitary and Diaper Association, said sanitary pads and diapers worth of Rs250 million had been stranded in the warehouses for the past three months.“We completed all the processes to acquire the Bureau of Indian Standards [BIS] certificate to export our products, but no team from India is coming to inspect the factory. We even wrote to the Indian authority multiple times but our requests have fallen on deaf ears.”As per the provision, once the Indian inspection team gives a green signal after factory inspection, goods can be exported to India.In 2020, the Indian government asked the BIS to prescribe mandatory standards for imported goods in line with international quality norms. The move aimed to prevent Chinese goods from entering India from any of its neighbours.After the suppression of Chinese apps, the Indian government imposed import restrictions on more than 370 Chinese products. Insiders say India does not want any products from Nepal that have Chinese components, including Nepal’s hydroelectricity, greatly worrying Nepal’s top exporters.The BIS deals with the marking and certifying of goods, incorporating quality standards and information on international norms to be followed while importing.The rules worry Adhikari, who owns the AG Health Industries Private Limited that produces sanitary pads and diapers in Bhairahawa. “India seems intent to halt imports from Nepal,” said Adhikari. According to the association, Nepal used to export three truckloads of sanitary pads and diapers daily. There are 29 sanitary pads and diaper factories in Nepal, both large and small, employing 6,000 workers.Sanitary pads and diaper factories used to operate 12 hours a day when the demand boomed, but due to the export obstacles, factories have reduced operating hours by 4 hours, said Adhikari.According to the Department of Customs, Nepal exported 201.99 million pieces of sanitary pads and diapers worth Rs719 million to India in the last fiscal year, ending mid-July.Likewise, a big consignment of Goldstar shoes failed to get export clearance after India refused to issue the BIS certificate, putting Nepal’s homegrown shoemaker on the brink.Exporters said there were rumours on Friday that India had extended the deadline to obtain a BIS certificate, and the Nepali exporters were allowed to export goods with their existing certificates.“But we have not received any formal notice from the Indian authority on the time extension of the BIS certificate,” said Baburam Adhikari, spokesperson for the Ministry of Industry, Commerce and Supplies. “If the BIS had made such a decision, we would have been informed.”“Neither the BIS India nor the domestic industries has confirmed or communicated with us on the issue.”After Nepali exports were halted over the BIS issue, the industry ministry has written multiple times to its Indian counterpart. Meetings were held, and the issue was forwarded even during Industry Minister Damodar Bhandari’s visit to India in August. “However, there is no progress,” said Adhikari. Adhikari said none of the Nepali exporters who applied for the BIS certificate have gotten it till now.“The BIS certificate issue has put the industries in Rupandehi in a big dilemma. They were opened to export goods to India,” said Thakur Kumar Shrestha, president of the Siddhartha Chamber of Commerce and Industry. It has negatively impacted both the industries and Nepal’s trade.Shrestha said factories are either running at half capacity or getting shut down, and workers are being laid off. Exports from the cement makers in Rupandehi—such as Arghakhanchi Cement, Sarbottam Cement, Palpa Cement, and Balaji Cement—have completely stopped for nearly two months.“Even as the domestic consumption of cement declined, production was not impacted due to the huge demand from India. But now cement plants in Rupandehi are on the verge of shutting down or running under-capacity,” said Shrestha.Except plywood, the export of all the listed goods that require a BIS certificate has come to a halt, said Shrestha. “India has neither renewed the certificate nor provided a new one.”Goods under the BIS with compulsory certification are any variety of cement manufactured or sold in India, steel and iron products, chemicals, fertiliser, polymers and textiles, cables, flat transparent sheet glass, cattle feed, footwear, centrifugally cast (spun) iron pipes, jute bags, viscose staple fibres, geo textiles, portable water bottles, plywood, and wooden flush door shutters, among others.“Plywood is currently not restricted. But despite having already paid the BIS charges and completed the process, the inspection team from India has not provided a BIS certificate for Nepali goods,” said Hom Prasad Ghimire, president of the Nepal Plywood Manufacturers Association. Ghimire said that his company completed the process of getting the BIS certificate in June. He said the Nepali plywood is of better quality than the Indian plywood.Plywood has been given until March 2025 for certification-free export. He said that out of 80 plywood factories, 52 have even deposited charges to obtain the certificate. The plywood industry employs 25,000 workers across the country.According to the association, Nepal exported Rs8 billion worth of plywood to India. The volume could have increased had the exports not been interrupted.Trade with India has been repeatedly obstructed. Experts say there is a need to seek long-term solutions for uninterrupted trade with the southern neighbour. “There must be a mutual recognition agreement on select exportable items. Under such an agreement, exportable goods certified by the government will be recognised by the Indian government. This would be the best long-term solution for standard certification,” said Posh Raj Pandey, chairman of the South Asia Watch of Economics, Environment and Trade.Under the 2009 bilateral trade agreement with Nepal, India agreed to support the setting up of standard-purpose labs, said Pandey. However, Nepal has not been able to push for the labs during talks with India— even after 15 years of the agreement. He said lack of coordination among government agencies and frequent changes of bureaucrats have put the issue on the back burner. ",
        "date": " November 10, 2024 ",
        "place": "Kathmandu ",
        "subject": "today News"
    },
    {
        "title": "Trump’s victory and South Asia ",
        "text": "The US has just concluded our generation's most eagerly watched presidential elections. Donald J Trump has won the White House resoundingly, and in addition, the Republican Party, also known as the Grand Old Party, has now wrested control of the Senate and has a comfortable majority in Congress. Simply put, Trump and the GOP now have complete control of the executive and legislative branches of the government, which will embolden the new Trump administration to pursue policies with determination. The world is closely watching how the Trump administration will usher in a new foreign policy paradigm that revolves around Trump’s “America First” philosophy. Foreign policy mandarins across the globe have mixed feelings about Trump's victory: Allies in Europe are gripped with anxiety, whereas in South Asia, there is a sense that since the rhetoric of Trump’s election campaign focused on combating China, Asia is on the cusp of witnessing unprecedented American engagement. It is in this context of American outreach in Asia that South Asia will play a pivotal role in shaping outcomes of a constantly evolving new world order. Nepal must remain steadfast in keeping up with developments of the great power games whilst constantly safeguarding and pursuing its interests independently. The heart of the US’s contention with China revolves around two critical issues: Trade and technology. The Covid-19 pandemic demonstrated to the world how global trade supply chains depended on supply lines in China. With the resurgence of the America First policy, the Trump administration is determined to impose new trade tariffs of up to 60 percent on Chinese exports. While the supposed new tariffs are likely to come into play in the second half of 2025, there is palpable fear that new trade tariffs could bring in disruptions to global trade as costs are likely to increase in the coming days. The Trump administration is determined to create new jobs to revitalise the economy by incentivising manufacturing in the country. Whilst Trump's plan to re-establish the US as a manufacturing hub is seen as a patriotic move, could higher labour costs in a developed country contribute towards lower production costs? The US’s trade conflict with China presents other developing nations in Asia with a unique opportunity to attract investments in the manufacturing industry. Although it is outlandish to suggest China will be entirely substituted as a manufacturing hub, the emergence of new manufacturing opportunities in the global south presents the US with the opportunity to fuel economic growth essential for the sustenance of democracy. South Asia gives the US a unique avenue for enhanced collaboration. With a democratic polity spread across most of South Asia’s landmass, job creation and energy production are the key elements for stability in the region. The Indo-Gangetic delta is among the most populous regions in the world and possesses the human capital to fuel economic growth across South Asia. Although the Civilian Nuclear Deal between India and the US is a milestone agreement for the use of clean nuclear energy to generate electricity in India, the nuclear plants in India only contribute 3.11 percent of the total electricity generated in India. For India to meet the energy requirements to set up a large-scale industrial base, access to high-quality uninterrupted energy will be critical for industrialisation in India and across South Asia. The Millennium Challenge Corporation pact signed between Nepal and the US is a significant breakthrough in Nepal’s energy sector, as American investment in upgrading transmission line infrastructure is greatly required to transport high-quality, uninterrupted energy.Nepal still requires robust investment in the transmission side to feed supply lines across South Asia. The fact that Nepal, Bangladesh and India have signed a power trade agreement demonstrates the potential of Nepal’s energy sector in fuelling energy to propel economic growth in the region. South Asia missed the industrial flight back in the decades of the 80s and the 90s; it’s time the region reaped the benefits of the US capital that could trigger a wave of industrialisation. Another focal point of tension between the US and China is the issue of semiconductors. The US would want to retain the technological leadership of high-end chips in the hands of its allies, namely Taiwan, South Korea and the Netherlands. Currently, the world relies solely on Taiwan and its crown jewel, Taiwan Semiconductor Manufacturing Company Limited (TSMC), for high-end chips—TSMC has a market share of 90 percent of advanced chip manufacturing. Both the US and China know the strategic advantage one can gain by accessing high-end chips, which is critical for next-generation AI modelling in sectors such as defence, intelligence, telecom, medicine and aerospace. The ability to store big data also depends on the quality and the advanced functioning of high-end chips. In simple words, the US’s ability to retain control and contain access to high-end chips to compete whilst diversifying the production of low-end chips will provide the US and its allies the political leverage it desperately wants. The tech industry in South Asia has been recognised as a force to reckon with, particularly in India and the periphery of Bangladesh. Sri Lanka seems to have made progress, while Nepal also aspires to expand its tech business reach. Cross-border payments, the expansion of data centres and the use of technology in the delivery of governance are areas of expansive collaboration. India’s ability to produce low-end chips in the future is also critical to expanding the tech industry in South Asia, as indigenously produced chips can help reduce manufacturing costs and the tech industry’s dependency on accessing chips elsewhere, which are always in high demand globally. But there are also areas of concern for South Asia regarding Trump’s ascendency to the White House. Trump has vowed to pull out of the Paris Climate Agreement and climate change is an issue that confronts South Asia, particularly Nepal. Nepal has witnessed firsthand the impacts of climate change and, therefore, the country and South Asia at large cannot afford to ignore the impact of climate change. This issue cannot become secondary for either Nepal or the region. Climate change challenges the livelihoods of our people, and the Government of Nepal must voice its concern visibly and work towards creating strategic alliances that will compel the new US administration to rethink walking away from Paris Climate Agreement. The new US administration and its South Asian partners must work on issues impacting human welfare to achieve wider social and economic participation in the democratic process in the region. Trump’s vision of America First is virtuous, but to restore the US’s trust globally, he must take its allies into confidence.  ",
        "date": " November 11, 2024 ",
        "place": "kathmandu",
        "subject": "today News"
    },
    {
        "title": "Complexity of transgender life in Janakpur ",
        "text": "In a rented four-room flat in Pidari Chowk, Janakpur, nine people live rather challenging lives due to their identities in a heteronormative world.These nine individuals share no biological ties, come from different castes and religions. Yet their bond is deeper than family—they follow the system of “hijra gharana.”Tabu Khan, 27, is one such member. Though Khan is a Muslim, she lives harmoniously in the gharana, where religious and cultural diversity coexist under the guidance of 56-year-old Pawan Kali Yadav, known as ‘Guru Mai’ by the group.The ‘hijra gharana’ forms a non-heteronormative kinship structure, operating through a discipleship-lineage system. Through ritualistic ceremonies, a guru adopts a ‘hijra’, or ‘chela’, creating a nonbinary family network.While they adhere to the ‘hijra kinship’ model, Malti Mahaset, 45, says, “Though we embrace the ‘hijra gharana’ system and profession, many in our group, including myself, prefer not to be labeled as ‘hijra/kinnar’. These terms are often used derogatorily against us, so ‘third gender’ or ‘trans’ feels more respectful.”She adds, “It ultimately depends on personal preference; not everyone avoids these terms.”This gharana primarily relies on income from ‘badhai’—traditional dances performed at weddings, childbirths, and festivals, where they bestow blessings on families in Nepal and India.Yadav said they also engage in ‘challa maga’ (a form of begging in public spaces).“When we go for ‘challa maga,’ people often give us coins and ask us to bless their gold or silver,” says Roshni Ray, a resident of Janakpur sub-metropolis’s ward 14.Some even invite them to their homes for blessings, treating them with respect. During ‘badhai,’ they receive similar respect, as many believe the blessings from trans communities are auspicious.“People respect us only when they need blessings,” Ray, 28, says. “They invite us to ceremonies but turn away afterward. We’re seen as good luck charms, not as equal humans.”Despite some improved recognition and respect from family and society, their access to healthcare remains dire and inhumane.Khan describes their treatment at Janakpur Provincial Hospital as “worse than given to animals.” When she visited the hospital six months ago for a syphilis injection, she was ridiculed by the staff. “The doctors treated me like an animal in a zoo,” she says. “They asked about my issue in front of a crowd, made crude remarks about people like us and humiliated me by asking me to lift my sari for the injection in front of everyone.”Manisha Shah, 27, had a similar experience. According to Shah, in the hospital, staff are often rude and ask them to sit separately from the general line, as if they are ‘dirty evil things.’“We depend on government hospitals since we can’t afford private care, but even there, we don’t get adequate treatment,” added Shah. “When we file complaints with the District Police, they often mock us, and some go so far as to say, ‘Come meet me at night, and then I’ll help you’.”In addition to facing discrimination in public spaces and government institutions, they are often subjugated to physical and sexual harassment.Six days ago, while returning home from the market in Barbigha Ground, Khan was cornered by four boys and molested.“It’s true that some in our community engage in sex work, but that’s their choice,” Khan said. “But that in no way gives others a right to violate us. Even if I were a prostitute, nobody could touch me without my consent… But we are often treated like objects. I completely froze during that incident. But this was not the first time I had been subjected to incidents like this. I had been raped three years ago.”After the incident, she went to the provincial hospital for treatment of her injuries. “Anyone could see what I had gone through, yet the nurse kept saying, ‘Why do you people engage in these things for money?’ while treating my wounds,” Khan adds.“Harassment and rape have become so common that we’ve grown numb to them,” another 25 year old trans woman Puja said, showing the injury around her neck that resulted from the harassment that she faced a month ago.For the gharana, in a society that seldom accepts them, organisations like Sunaulo Bihani Samaj offer comfort by advocating for their rights and encouraging them to speak up.However, Puja says, “Where is the government? Why are hospitals and police stations still so unwelcoming?”Aside from doing ‘badhai’ and ‘challa maga’, they are also famous as ‘natuwas’, performers invited to dance at festivals like Holi and Chhath. For many, including Puja, these performances provide a livelihood. “As a natuwa, I get to dance and express myself beautifully,” she says.However, the path to earnings is not without challenges.While trans individuals are celebrated as entertainers, they often face objectification and ridicule. Puja says that during performances, some make vile comments and invade their personal space, even entering their makeup rooms.They rarely get the promised full payment. The payment for performances often depends on youth and beauty, leaving older members of the community at a disadvantage.“As we age, we’re less likely to be hired,” said Muskan Sahiba, another member of the community. “So we younger ones share our earnings with older members, or our ‘Guru’, as a way of supporting those who no longer have a way to earn or family to rely on.”Since earnings in Nepal are hardly enough, they often travel to India for ‘badhai’ and ‘challa maga’. When in India, they live in ghetto communities of Mumbai and Patna.Despite facing some mistreatment, the support from ‘hijra gharanas’ in India keeps them going. Khan, the only Nepali trans individual from their gharana in Patna, says, “Here, they call me ‘beti’ [daughter] and love me. This support within our community is the shield from external hate.”However, the instances of trans community being murdered and raped in Patna and Mumbai keeps them on their toes.Nepal too is unsafe. Many like Mahaseth face harassment while walking through the roads and markets of Janakpur. Police often threaten to arrest them, assuming they are begging or engaging in prostitution, and sometimes even resort to violence.Mahaseth says, “Nobody wants to beg for a living; we want to work, but no one offers us jobs. The government provides jobs for men and women—why not for us? We’re not asking for high-profile positions; I can do cleaning or cooking.”Satya Narayan Shah from the Sunaulo Bihani Samaj, a sister organisation of the Blue Diamond Society in Janakpur, says they connect around 3,000 queer people in the Dhanusha district and conduct sensitisation programmes for hospitals and police.“While we’ve seen some improvements, changing people’s mindsets is still a challenge,” Shah adds. Hate crimes, including rape and physical abuse, are common, with many perpetrators going unpunished.For the trans community of Madhesh, the roles they perform—whether as natuwas in local festivals or performing badhai and challa maga in Indian cities—are essential to their survival.But these roles are also traps, perpetuating their status as outsiders. “We’re tired of being treated like objects of entertainment or like something to be feared under the guise of respect,” says the ‘guru mai’ Yadav.Their fight is not just for economic stability but for dignity. “I want to work and live a normal life, but no one gives us that chance,” Khan adds. “Why, because we are different?”The community’s demands are simple: respect, safety, and the right to live as equals. But even these basic demands remain unmet.“We need systemic changes that grant us the rights and dignity we have long been denied,” Puja says. ",
        "date": " November 17, 2024 ",
        "place": "Janakpur ",
        "subject": "today News"
    },
    {
        "title": "TIA’s reduced flight hours could stall economic growth ",
        "text": "How big will the impact be as Nepal’s major international airport closes for ten hours starting Friday?Economists say it’s too early to quantify, but the losses for the Nepali economy will be huge.Nepal’s economic momentum has slowed down since the late September floods, and the government’s decision to close the key airport could stifle growth.“It will be a big setback for the country’s ailing economy as it will hit tourism and business activities, including transport, hotels, restaurants, telecommunication and other sectors,” said Bishwambhar Pyakurel, a noted economist. Pyakurel called it a deliberate “restriction” imposed by the government, despite it having many alternatives to carry out construction at the airport.Tickets prices are soaring, with most destinations, including Nepal’s labour markets, witnessing a fourfold price rise due to a widening gap between supply and demand.A notice to airmen, popularly known as NOTAM, issued by the Civil Aviation Authority of Nepal, states that the airport will be closed from 10pm to 8am from Friday for five months, until March 31, to expand the taxiways. The airport is currently closed from 2am to 6am. Two parallel taxiway projects are ongoing at the Tribhuvan International Airport in Kathmandu. The extension of the parallel taxiway was initially planned in 2009.Travel trade entrepreneurs said the civil aviation body’s mismanagement could shave off at least Rs50 billion in airline and tourism industry revenues, even as the government struggles with revenue generation.The outlooks for 2024-2025 of the World Bank, the Asian Development Bank, and the International Monetary Fund forecast economic recovery on the basis of improved tourist arrivals in Nepal. Growth in food, transport, and accommodation sectors have been better than expected even as other economic indicators lag.In September, the Asian Development Bank revised Nepal’s economic growth forecast upward to 4.9 percent for the current fiscal year beginning mid-July, based on projected agricultural and electricity output growth and buoyant tourist arrivals.The National Statistics Office’s annual account estimated that accommodation and food service activities, which are linked to tourism, would see a robust growth of 21.84 percent, the highest among 18 economic compositions in the Nepali economy, in the last fiscal year ended mid-July.According to the respective ministries, the late monsoon floods and landslides affected agriculture and electricity output, and now tourism has received a big jolt.It will be more painful for domestic airlines as winter will bring more fog and pollution, curtailing flight frequencies.“It’s an unplanned construction,” said Pyakurel. “Today, time is money. For trading, business and leisure, coming to Nepal will be a big challenge,” he said, adding that the airfares are so high that tourists and businessmen will think twice before flying. Hoteliers say that due to high ticket prices, key events planned in Kathmandu have either been postponed or cancelled.As part of the improvement plan, a 1,140-metre-long parallel taxiway is being built on the runway’s southern side, or the Koteshwar end. This will connect the existing international apron to the end of runway 02.Similarly, another 450-metre-long parallel taxiway is being built at the northern end of the runway.Considering the planned infrastructure, the maximum runway capacity will see 42 aircraft movements per hour in mixed-mode operation, enabling 187,000 aircraft movements per year from the 128,449 flight movements last year. In 2023, the Kathmandu airport recorded 8.7 million passengers—4.54 million international air travellers and 4.15 million domestic ones, according to statistics of the Tribhuvan International Airport.Similarly, in terms of flight movement, the airport handled 128,449 flight movements—31,460 flights by international airlines and 96,989 by domestic carriers.Travel trade entrepreneurs say the ill-planned construction would take way too long, extending until another peak tourism season in spring (March).“These will be painful months for travel trade entrepreneurs as the plan is being implemented in the peak tourism season. We, however, cannot oppose the airport’s infrastructure development,” said Sagar Pandey, president of the Trekking Agencies Association of Nepal.“On different occasions, we have suggested that the government and the civil aviation body find alternatives to such a long closure, such as incentivising airlines to fly from Bhairahawa and Pokhara international airports.”However, international airlines are hesitant to connect to the new airports, which have remained idle for months due to the technical and financial issues of flying to them.Pandey said they might lose at least 40 percent of trekkers this year considering the flight cancellations.Nepal Tourism Board has revised its 2024 tourist arrival forecast to 1.1 million from the projected 1.3 million. As of October, Nepal has received 900,000 tourists.Some entrepreneurs say that five hours of construction time, as it used to be, was appropriate, but insiders suspect that a 10-hour closure would force many airlines to divert to Bhairahawa. For instance, on October 27, the Civil Aviation Authority of Nepal (CAAN) took action against a Thai AirAsia flight, refusing to allow it to land at Kathmandu airport.Media reports show that the flight was later permitted. However, after the plane landed, authorities temporarily suspended the airline and its general sales agent. Later the restrictions were lifted on the “condition” that the airline would fly from Bhairahawa as well. Airline officials say the “punitive measure” was not the aviation regulator’s first action. On October 30, 2022, the CAAN cancelled Nepal Airlines’ scheduled flight to Delhi as punishment for defying instructions to move some of its international services to the newly-built Bhairahawa airport.Nepal Airlines’ jet remained on the ground, and more than 500 passengers were affected by the last-minute cancellation.“I would like to seriously draw the attention of the government that Tribhuvan International Airport is being closed for 10 hours daily from November 8 to March 31. It cannot be considered normal to close an international airport for 10 hours to build structures. Earlier, during the rehabilitation of the main runway, the airport was closed only for 5/7 hours at night,” lawmaker Udaya Shumsher Rana wrote on X on October 29.“It is clear that closing the Kathmandu airport means diverting flights to Pokhara and Bhairahawa to show that those two airports are fine. There are technical reasons behind international airlines not being ready to fly to these two airports. Undoubtedly, the Civil Aviation Authority leadership is trying to hide its weaknesses by closing the Kathmandu airport for 10 hours.”Rana argued that if this decision is not revised, Nepal’s global image and tourism business would suffer. The airport closure will also hit domestic flights. Buddha Air, Nepal’s largest domestic carrier, currently operates 180 daily flights. As the airline must reduce its flights to 135, there will be a substantial drop in its revenue and government’s taxes. Some other domestic airlines have complained to the regulator that flight allocation is not proportionate under the new arrangement. ",
        "date": " November 8, 2024 ",
        "place": "Kathmandu ",
        "subject": "today News"
    },
    {
        "title": " Mental Health of Young Nepal | Idea of Nepal with Shreya Giri",
        "text": "Recently, Giri was chosen as a ‘Forbes 30 under 30’ for her pioneering work in mental health advocacy in Nepal and abroad. In this conversation, they discuss the main mental health problems of the Nepali youth, the changing landscape of mental health in the digital age, the Nepali state’s intervention (or lack of it), differences in mental health issues among men and women, as well as tips and strategies for dealing with some of these problems. ",
        "date": " October 15, 2024 ",
        "place": "kathmandu",
        "subject": "today News"
    },
    {
        "title": " Nepal, Bangladesh and South Asia | Idea of Nepal with Nilanthi Samaranayake",
        "text": "She is also an Adjunct Fellow at the East-West Center in Washington DC. Samaranayake specialises in the analysis of Indian Ocean security, small states’ navigation of great power competition, and the relations of smaller South Asian countries with China, India, and the US.  In this conversation, Samaranayake talks about, among other things, the similarities and differences of the ground realities in Nepal and Bangladesh, the relations of smaller South Asian states with big powers, how Nepal’s internal politics appears from the outside, the Indo-Pacific Strategy, the Belt and Road Initiative, and Nepal’s handling of the competing influences of India, China and the US. ",
        "date": " October 1, 2024 ",
        "place": "kathmandu",
        "subject": "today News"
    },
    {
        "title": " Nepal-India ties | Idea of Nepal with Ranjit Rae",
        "text": "Rae was the envoy to Kathmandu during the promulgation of the 2015 constitution and the subsequent blockade. In this conversation, Rae talks about the evolution of Nepal-India ties since the blockade, regional geopolitics, what the two countries get wrong about each other, how New Delhi views Nepali communist parties and the governments they lead, and the change (if any) in India’s neighbourhood policy since the start of Narendra Modi’s third term in office. ",
        "date": " September 12, 2024 ",
        "place": "kathmandu",
        "subject": "today News"
    },
    {
        "title": " Nepali e-commerce | Idea of Nepal with Aanchal Kunwar",
        "text": "Kunwar has been the MD for just under three years. Before coming back to her homeland to join Daraz Nepal, she worked at different American companies, including Amazon, the world’s biggest e-commerce platform. In this conversation, Kunwar talks about the opportunities and challenges of running an e-commerce enterprise in Nepal, as well as the country’s overall business environment.  ",
        "date": " August 14, 2024 ",
        "place": "kathmandu",
        "subject": "today News"
    },
    {
        "title": "What I watch online: Manisha ThapaThapa is a public health practitioner, artist and travel content creator.",
        "text": "The Shooting Star Shivya Nath, an Indian traveller, runs this channel. I love her sustainable, meaningful solo travel stories and offbeat adventures.Herne Katha I find myself revisiting the channel for the untold stories of everyday lives in Nepal. I love their empathetic lens and ability to connect with local lives.Purvi Blues I enjoy watching this Nepali travel vlog more than many others. The team's storytelling and dedication to their travel content on YouTube are commendable.Art Candy Nepal As a self-taught artist, I frequently visit this art channel for inspiration, particularly in landscape acrylic painting. I find it easy to grasp their art techniques.Period Power Podcast by Maisie Hill My profession in Sexual and Reproductive Health advocacy leads me to watch this channel for thought-provoking content on women’s health, focusing on menstrual health and advocacy.Dishanirdesh TV Run by my favourite journalist, Vijay Kumar Panday, who initially ran a TV show under the same name, this channel covers politics, society, history and culture with good storytelling. I love the way he adds some subtle humour to his analysis.  ",
        "date": " November 20, 2024 ",
        "place": "Kathmandu ",
        "subject": "today News"
    },
    {
        "title": "The role of microbiome in skincareMaintaining a balanced skin microbiome can help protect your skin and reduce irritation....",
        "text": "Dr Namrata Basnet and Dr Arnija Rana, dermatologists of Elara Clinic, explain the benefits of skin microbiomes and ways to balance them for better and healthier skin. Dr Basnet is a dermatologist with an MD from Hubei University of Medicine in China. Dr Rana has an MBBS degree from Manipal Pokhara College of Medical Sciences and an MD in Dermatology from Nepal Medical College under KU.What is the skin microbiome?The skin microbiome is a mix of tiny, invisible organisms like bacteria, fungi, and viruses that live on our skin. They’re mostly found on the skin’s outer layer and in hair follicles, sweat glands, and oil glands. These little organisms naturally live all over your skin and help keep it healthy.What are its uses and importance for skin health?The skin microbiome acts like a natural shield, protecting against harmful germs and helping the skin stay balanced. It helps keep the skin hydrated, reduces redness and irritation, and even protects against breakouts and other skin issues. Essentially, it keeps your skin firm and healthy.How does the microbiome keep your skin healthy?The skin's microbiome is crucial for maintaining health and balance. It blocks harmful germs by supporting beneficial microbes, calms inflammation by aiding the immune system, and maintains a slightly acidic pH to protect against external threats. Some microbes also help retain moisture, keeping the skin soft and hydrated ensuring overall health and resilience.What happens when the microbiome is disrupted?When the microbiome gets out of balance, called “dysbiosis,” it can cause several issues. Sensitive skin can become red, itchy, or easily irritated, and acne and pimples may become more frequent. Moreover, the skin may lose moisture and become rough, resulting in dry or flaky skin. Additionally, skin conditions like eczema and psoriasis can flare up when the microbiome is off-balance. How can you support a healthy skin microbiome?To support your skin's microbiome, use gentle cleansers that don’t sting and avoid harsh soaps or products with excessive alcohol or fragrance, as they can disrupt the balance. Keeping the skin hydrated is essential, as it locks in moisture and fosters a healthy environment for beneficial microbes.Ingredients like prebiotics (inulin, FOS) nourish good bacteria, while probiotics (Lactobacillus, Bifida ferment) restore balance and reduce irritation. Postbiotics, such as lactic acid, repair and hydrate the skin while calming inflammation. Niacinamide strengthens the skin barrier, glycerin provides hydration, and ceramides prevent moisture loss while protecting against harmful microbes. Squalane balances oil production, and plant-based ferments like rice water and green tea enhance microbial diversity. Antioxidants like Vitamin C and resveratrol protect against oxidative stress, while beta-glucans soothe and promote balance, ensuring a healthy, resilient skin barrier. Namrata Basnet  Photo: Courtesy of Elara ClinicWhat lifestyle factors affect your skin microbiome?A diet rich in whole foods and fermented products supports a thriving microbiome, while processed foods and excess sugar can disrupt it. Gentle hygiene practices with microbiome-friendly products help maintain balance, as over-cleansing or using harsh products can strip away beneficial bacteria. Chronic stress increases inflammation and disrupts microbial harmony, highlighting the importance of stress management. Environmental factors, such as pollution and climate changes, reduce microbial diversity, while poor sleep disrupts skin repair and microbial balance.Regular exercise improves circulation and microbial diversity, though excessive sweating without proper cleansing may cause bacterial overgrowth. Medications like antibiotics and steroids can disturb the microbiome by eliminating beneficial bacteria.How can you maintain or restore a healthy skin microbiome?To keep your microbiome balanced, use a gentle skincare routine, use mild cleansers, and avoid harsh products. Keep your skin hydrated, which helps to keep the skin’s natural barrier strong, and use products with prebiotics, probiotics, and postbiotics. Moreover, avoid overusing exfoliants and acids, as they can strip the skin of good bacteria. Thus, a simple skincare routine often benefits the microbiome.What are the benefits and risks of microbiome-focused skincare?Microbiome-focused skincare offers many benefits, such as strengthening the skin barrier, enhancing moisture retention, and protecting against environmental damage. These products help reduce inflammation, making them ideal for sensitive or inflamed skin and conditions like eczema and acne. By supporting the skin’s moisture retention, they improve hydration and help maintain microbial balance, protecting against harmful bacteria and infections. Additionally, they can support anti-ageing efforts by reducing oxidative stress and improving skin elasticity.However, there are risks. Misuse or overuse can disrupt the microbiome, leading to imbalances. Some ingredients may cause allergic reactions, irritation, or breakouts in specific individuals. Not all products are scientifically validated, and some probiotic-based products may have a short shelf life due to the degradation of live bacteria. Despite these challenges, microbiome-focused skincare can be effective when used carefully and with proper research. ",
        "date": " November 20, 2024 ",
        "place": "Kathmandu ",
        "subject": "today News"
    },
    {
        "title": "Another missed opportunity in Nepali filmmaking‘Hrashwo Deergha’ boasts a strong cast but is undermined by illogical plot twists and ...",
        "text": "Whenever life felt dull, I’d watch Brahmanandam’s funny South Indian movies to relax. So, as a fan, I couldn’t miss his role in the new Nepali movie ‘Hrashwo Deergha’.With a substantial ensemble of talented Indian actors, lavish set designs, stunning lighting, and elegant costumes, the movie, directed by Chandra Pant, has become the talk of the town. Falling under the action-comedy-romance genre, the romantic storyline overshadows the other two aspects. While Brahmanandam's presence adds charm to the movie, his limited screen time underwhelms the comedic element. In its exposition, the movie attempts to illustrate the two distinct worlds of the lead characters: Narayani (Neeta Dhungana) and Hari (Harihar Adhikari).Narayani is portrayed as the daughter of renowned Indian actor Pradeep Ram Singh Rawat, who plays the role of Mahamant. She resides in Devadham, which is depicted as a hub of religious and spiritual significance. Growing up in such an environment, Narayani embodies a conformist nature. Her life revolves around discipline, deeply rooted in traditions, values, and ideals. In contrast, Hari is the son of the mayor of Bharatpur, played by Bipana Thapa. His upbringing, shaped by the privileges of his position, leads to a more materialistic outlook on life, starkly different from Narayani’s.The film’s title metaphorically represents their opposite cultural and familial backgrounds and personalities.The main plot revolves almost entirely around the blossoming romance between Narayani and Hari, and it kicks off in a somewhat serendipitous way. Their first encounter occurs during a ritual at Devadham, where a twist of fate brings them together. A man selling Fevicol accidentally drops his box, sending the glue bottles rolling toward Narayani. Just as one bottle is about to hit her, Hari rushes forward to protect her. In a surprising turn of events, their hands stuck together, glued by the spilt adhesive.This unexpected mishap forces them into an awkward yet intimate situation—they cannot separate their hands, no matter how hard they try. While Narayani is initially flustered, Hari secretly delights in the situation. He is clearly on cloud nine as he spends time with his crush. Since it would be inappropriate to be seen together in such a state at Devadham, they leave the temple premises and find refuge in a nearby hotel. However, as they walk, Hari’s eyes remain fixed on Narayani, and he can not stop grinning. I know he is trying his best to woo her. Yet, this unblinking gaze feels unsettling rather than romantic. It might be intended to express infatuation, but it borders on making Hari seem more like a creepy stalker than a sincere admirer. This raises the question: is the film intentionally portraying Hari as a bit of a creep, or does this indicate a missed opportunity for a more profound character development?From a viewer’s perspective, if a man were genuinely interested in me, I would prefer he court me subtly, considerately, taking the time to understand who and how I am. However, the protagonist in this film seems blindly consumed by his infatuation, declaring a lifelong commitment without understanding her. This one-dimensional portrayal of love feels forced and artificial to me. I feel like filmmakers not being meticulous in these small things make it hard for the audience to connect with the character or believe in the rapid progression of events. After reaching the hotel, Hari and Narayani began searching for something. Eventually, unable to find it, they are lost in the middle of a jungle in Chitwan at night. While there, they start sharing about their personal lives. It's not even been twenty-four hours since they met, and they started oversharing! So, again, this felt unnatural to me. Furthermore, the film’s second half was packed with rapid twists and turns, coming one after another until it became overwhelming. The filmmakers seemed intent on amplifying the drama at every opportunity, which unfortunately led to a sense of exaggeration and felt quite unnatural.Another element that contributed to the film’s artificial feel was the excessive use of VFX. Typically, VFX creates scenes or elements that are difficult, costly, or impossible to capture. However, filming river scenes in Nepal, a country with many rivers and stunning landscapes isn’t particularly challenging. So, every time I saw these river scenes filled with VFX, I couldn’t help but wonder why it was used so excessively.Let me be upfront: their love story does not survive the light of the day. Both protagonists tragically drown in water bodies, marking the film’s most emotional moment. But instead of feeling heartbroken, I found myself laughing—and so did the audience sitting by my side. Why? Because the water they drowned in was such an unnaturally bright blue that it looked more like a swimming pool than a natural river. It was hard to take the scene seriously, and what should have been a tear-jerking moment was unintentionally comical to me. The acting was good, apart from Harihar Adhikari’s. Anmol KC could have done better if he had been cast instead of Adhikari. The grandeur of actors from South India might have overshadowed Adhikari’s performance, making his performance bland. Adarsha Mishra’s entry in the movie was well-received by the audience, whereas Adhikari’s was not. The film featured characters speaking both Nepali and Hindi. For example, Brahmanandam’s character fully understood Nepali but responded exclusively in Hindi, which felt somewhat jarring. While the film briefly mentions his recent return from India, this explanation seems inadequate. Providing a more detailed backstory—exploring his time in India and the reasons for his stay in Nepal—could have added depth, making his consistent use of Hindi feel more natural and cohesive within the narrative.Overall, viewers who enjoy Nepali films may find this movie appealing. However, for audiences who are familiar with South Indian cinema and have a more diverse taste in films, this movie might not meet expectations. Hrashwo DeerghaDirector: Chandra PantCast: Harihar Adhikari, Neeta Dhungana, BramanandamDuration: 2 hours 35 minutesYear: 2024Language: Nepali, Hindi ",
        "date": " November 20, 2024 ",
        "place": "Kathmandu ",
        "subject": "today News"
    },
    {
        "title": "Addressing men’s mental healthOn International Men’s Day, it’s vital to recognise the mental health struggles men fa...",
        "text": "Did you know that November 19 is observed as International Men’s Day? Many people might not be familiar with this. Unlike other well-known and widely celebrated days, it hasn’t received as much attention, which is understandable.Since men are often perceived as the dominant gender, there is a tendency to assume they can handle most challenges on their own. This belief can lead to the idea that days like International Men’s Day are unnecessary. However, the importance of addressing issues like men’s mental health is often underestimated. When we examine the facts, a stark contrast emerges between our assumptions and reality.Men are less likely to seek help for anxiety and stress compared to women, which can lead to untreated mental health issues and exacerbate symptoms. They often display anxiety through anger, irritability, or substance use rather than seeking support. Men are more than 3.5 times more likely to die by suicide than women, often due to societal expectations and traditional gender roles discouraging them from seeking help. Additionally, men are less likely than women to seek treatment for mental health issues. Only 1 in 3 men take medication for depression or anxiety, and just 1 in 4 have spoken to a mental health professional. Men are more likely to use alcohol and drugs as coping mechanisms rather than talking about their feelings. These issues primarily arise from a common challenge many men face: the difficulty of opening up and seeking help. While factors like upbringing, peer influence, and the support systems one has built can play a role, the undeniable truth remains that these problems are real and significant.A common story for many men is the desire to succeed in life. This doesn’t mean women don’t feel the same way, but often, a man’s mental health is associated with how much they have accomplished in their life and what they can do further. The stigma surrounding mental health is already a significant barrier to addressing these issues effectively. When combined with the traditional expectation that men should be strong, stoic, and self-reliant, this problem is only exacerbated. Without changes to these societal norms, men will continue to feel discouraged from expressing their emotions and seeking help, perpetuating these challenges and leading to even more significant issues in the future.This doesn’t mean men should suddenly start sharing all their thoughts and emotions, but it also highlights the need for a safe outlet for them. Raising awareness about men’s mental health issues doesn’t diminish the importance of addressing mental health for other groups, such as women, children, the elderly, or LGBTQ+ individuals. The reality is that vital conversations about mental health are still not happening as they should. This remains a significant challenge for anyone striving to create meaningful change, not just in men’s mental health but in the broader field of mental health. Conversations that lead to real change are essential.Bringing about change has always been challenging. Many adults struggle to open up because their thoughts and beliefs have become rigid over time, making it harder to shift their perceptions of what the norm should be. However, one positive approach lies in starting early. Teaching and guiding younger generations in schools about the importance of mental health and how it should be understood and addressed can be highly effective. While this approach may take time to show results, it promises lasting, meaningful change that works in the long run.What about the present? Can we do something for men’s mental health now? The simple answer is yes, but it will still require time. One effective way to educate and reach those with rigid or traditional mindsets is through consistent engagement and meaningful conversations. This means organising recurring awareness sessions on mental health topics to promote understanding and empathy.Just as we teach children basic math or English through repetition and practice, the same approach can be applied to mental health. By repeatedly reinforcing the importance of mental well-being and creating safe spaces for discussion, we can gradually break down stereotypes and foster healthier attitudes toward mental health.Raising awareness also means keeping the conversation about mental health open. You don’t need to share everything all at once, but it’s essential to talk about what’s bothering you, especially with people who care about you. Finding a group of individuals who understand and support you can indeed be a blessing.Counselling can be an excellent option for those who feel unheard or lack the support they need from their peers. It provides a safe space to explore thoughts and express feelings without fear of judgment. Take it one step at a time. Remember, it’s never too late to reach out and seek help.Tandukar works as an organisational psychologist at FHEAL, a counselling hub for mindful healing. ",
        "date": " November 19, 2024 ",
        "place": "Kathmandu ",
        "subject": "today News"
    },
    {
        "title": "Driven by a passion to performMulti-instrumentalist Aman Mali balances teaching, performing, and exploring the boundarie...",
        "text": "Aman Mali has wanted to do something in music since he was a boy. Today, he is a professional flautist and multi-instrumentalist with over 12 years of experience in teaching and performing. He is also a Kuma Sagar and Khwopa band member, where his flute skills complete the band.In ninth grade, a monk’s flute playing inspired him, sparking his interest in the instrument. With the monk's guidance, he purchased a flute for Rs400 in Jamal and learned the basics. Eager to refine his skills, he searched for flute classes the day after his SLC exams but couldn’t find any. Eventually, a friend recommended Om Sangeet Pathshala in Bhaisepati, where he enrolled. He recalls walking 45 minutes daily from Thecho to attend lessons, saying, “I was excited to learn the flute, and my days at the Pathshala started it all.” He completed a four-year diploma in Eastern Classical Music at Om Sangeet Pathshala, affiliated with Prayag Sangeet Samiti, Allahabad. After finishing the course, though these sessions were irregular, he occasionally took lessons from Narendra Bikram Rai, a teacher at Om Sangeet Pathshala. As of now, Mali is pursuing a specialised two-year Jazz Diploma in Saxophone and Concert Flute at the Kathmandu Jazz Conservatory. In addition to the flute, he plays several other instruments, including the tabla, saxophone, harmonium, guitar, harmonica, and djembe. He shares, “I know the basics of almost all instruments played using the mouth.”He recalls his first live performance at Utsav Restaurant in Durbar Marg, describing it as a memorable yet challenging experience. “I didn’t know much back then. My teacher sent me to play the flute as I knew it, but I had no experience playing with a team since I was used to performing solo,” he says. After a month at the restaurant, he formed the Nawa Durga Band with friends from his locality, where he also played guitar and practised flute. He fondly remembers a gig with Subani Moktan, where he taught himself to adapt flute scales to suit different songs.Mali later formed the Render Band, which marked the beginning of consistent restaurant gigs. This band provided him with a stable income and opened doors to performing at numerous venues. During this time, he began teaching flute at Little Angels’ School, where he continues to teach today. After a few years with Render Band, he had the opportunity to join the renowned 1974 AD band for a year when they were restructuring their lineup. He was introduced to the band by Rojman Maharjan, a Kuma Sagar and Khwopa Band member, whom Mali had met at Om Sangeet Pathshala. His time with 1974 AD allowed him to participate in a Pokhara tour and perform at prestigious events such as the Hits FM Music Awards, the Image Awards, and other high-profile shows and venues. Reflecting on this experience, he shares, “Working with 1974 AD helped me reach new heights. It was a wonderful opportunity to be part of the band I grew up listening to.”While working with 1974 AD, Mali had the opportunity to perform in a charity show in France organised by Nepali Youth Om Peace. During the month-long tour, he performed three shows in France and Switzerland, including a collaboration with a Swiss choir group called Eloquence. He recalls, “I was the only Nepali musician in the group and had a great experience. It was my first time travelling outside Nepal, and I had a meaningful experience.”  Photo: Courtesy of Pradip MaharjanUpon returning to Nepal, Mali took on various freelance projects, collaborating with artists in several studios. He later joined Kuma Sagar and Rojman Maharjan for a concert in Biratnagar following the release of their song ‘Champa’. After returning to Kathmandu, the song became popular. Mali shares, “Our vibe matched, and we later decided to record the song ‘Hawa ko Lahar’ at our own homes, which eventually led to me becoming a band member. I’ve played the flute in every song of Kuma Sagar that came after ‘Hawa ko Lahar’.”Mali has collaborated with many artists, including Rohit John Chhetri, Swopna Suman, Subani Moktan, and Kunti Moktan. He has also played the flute in four songs by Rojman Maharjan: ‘Salugu Gacha’, ‘Aila Luwaya’, ‘Makhan Twa ya Gwa’, and ‘Maya Madula’. He says, “I recorded the flute from my home and sent it to him.”When reflecting on his most memorable performance, he recalls a recent concert with Kuma Sagar and Khwopa Band in Banepa. “The crowd was huge and wild; even the police couldn’t control them. I’ve never seen such a crowd,” he shares.Mali views the flute as a versatile instrument that blends into various genres. He explains, “It works well in folk, fusion, classical, and even jazz music. The flute is one of the major instruments in Nepal and is used in all kinds of songs and music. Since joining the jazz diploma course, a new dimension has opened up for me.” He has also explored playing other flutes, including the pan flute from France and the Hulusi from China.Mali is also passionate about teaching: “Teaching what I know is a rewarding experience. I am happy to see youths eager to learn the flute, as they are the ones who will shape the future of the music industry.”He also encourages people to listen to good, quality music, “Simply having more listeners isn’t enough; we need literate listeners. They should be aware of good, quality music, which will help promote and popularise quality songs.”In addition to teaching, Mali runs a YouTube channel where he shares videos of himself playing and teaching the flute.Mali plans to open a music institute in the future, as there are no such institutions in his locality. He also hopes to create and perform his own instrumental album in the coming years. He is looking forward to his upcoming Australia tour with Kuma Sagar and Khwopa Band.Mali advises aspiring musicians to work diligently and practice with patience and consistency. He says, “It may seem glamorous from the outside, but a lot of hard work, dedication, and passion go on behind the scenes. If you work hard and bring creativity, this field has a huge scope in Nepal.” ",
        "date": " November 18, 2024 ",
        "place": "Kathmandu ",
        "subject": "today News"
    },
    {
        "title": "47 Nepalis deported from Russia and BulgariaTwo dead in separate road accidents in RautahatLand mounds offer refuge to wildlife during floodingPolice probe Prasai on cybercrime as district court gives 5-day remandCongress and UML scramble to resolve differences over BRI",
        "text": "A total of 47 Nepalis deported from Russia and Bulgaria have arrived home. Russia repatriated 29 individuals for not attending regular university classes and working without permits, while Bulgaria sent back 18 Nepalis who were victims of human trafficking.Russian authorities arrested 34 Nepalis on October 30 from a call centre in Moscow’s Kuzminki area. The following day, a local court approved their deportation. Twenty-nine of them were sent to Nepal on Monday night via an Air Arabia flight and arrived in Kathmandu on Tuesday evening. The remaining five are still undergoing deportation processes.Many of the deported students said education consultancies had misled them about opportunities in Russia. One student said, “We were told we could study and work without restrictions, but that was untrue. Living in Russia without work was impossible, and we were arrested while working.” Before deportation, they were held at a detention centre in Sakharovo, 60 km from Moscow.Most of them had gone to Russia two years ago.An immigration officer at the Tribhuvan International Airport said they didn’t investigate further. “We did not find it necessary to take them into custody for further statements,” said an immigration officer. “All of them were released through standard procedures.”The returning students said they would discuss whether to file complaints against the education consultancies. “We are all under mental stress right now,” one student said. “We will discuss what steps to take to prevent other students from being exploited like us.” Keshav Timilsina, president of the Non-Resident Nepali Association (NRNA) Russia, said the lack of proper documentation prevented them from receiving legal support.“If dissatisfied with the court’s decision, an appeal can be filed,” he said. “Relatives and friends of the detained students had contacted the NRNA for assistance. We were prepared to hire a lawyer to pursue legal remedies, but they could not provide documents such as contracts with the employer or proof of university attendance. Without these papers, the plan to appeal was cancelled.”Sushil Ghimire, Nepal’s acting ambassador to Russia, said the embassy could not assist as the students had violated local laws. “Russian law mandates attendance for students, but most were working instead. Violating labour laws left us with no legal grounds to support them,” he said.Timilsina said that most students who travelled to Russia through consultancies, except those on government scholarships, have faced such issues. “Russia provides scholarships to 200 Nepali students annually, and those receiving scholarships do not incur any expenses,” he said. “Russia is a destination for studying only through government educational scholarships. It is impossible to work while studying, as some consultancies claim.”Meanwhile, Bulgaria deported 18 Nepalis who were trafficked via India, Romania, and Hungary. They lacked proper entry documents and were detained for three months in a deportation centre in Sofia. The Nepalis were sent back to Nepal on government-sponsored tickets, arriving in Kathmandu last Thursday. The Nepali embassy in Germany, which oversees consular services for Bulgaria, said the deported individuals had been arrested for lacking official documents. ",
        "date": " November 21, 2024 ",
        "place": "Kathmandu ",
        "subject": "today News"
    },
    {
        "title": "Kirtipur mayoral race set to be a test for traditional partiesPolice now investigating RSP chair, others in three districtsDhungana, first Speaker post-1990, champion of rights and democracy, dies410 candidates file nominations for local by-electionsCode of conduct comes into force for December 1 local by-elections",
        "text": "Candidates for mayor in Kirtipur Municipality, where a by-election is being held on December 1, have started their election campaign. In the race are a total of 20 candidates—nine from various political parties and 11 independents.In the 2022 local elections, independent candidates presented a formidable challenge to political party candidates in various local units. Independent candidates won mayorships in the Kathmandu Metropolitan City, the Dharan Sub-Metropolitan City and the Dhangadhi Municipality. Will the outcome in Kirtipur be different this time, or will the traditional parties prevail? The by-election comes after the death of Rajkumar Nakarmi, former Mayor of Kirtipur Municipality, who died in July due to kidney failure. He had won on a Nepali Congress ticket.Major political parties including the Congress, the CPN-UML and the CPN (Maoist Centre) have fielded their candidates. But the fourth largest political party in the House of Representatives, the Rastriya Swatantra Party, did not field anyone reportedly after failing to find a suitable candidate.The candidates include Krishnaman Dangol from the Congress, Surendra Manandhar from the UML, and Shiva Sharan Maharjan from the Maoist Centre. Besides these, seventeen others, including 11 independents, have filed their nominations. Candidates from other parties include Dil Kumar Maharjan of the Nepal Samajbawadi Party, Shri Krishna Maharjan of the Nepal Majdoor Kishan Party, Dhurba Maharjan of the Rastriya Prajatantra Party, and Keshav Shrestha of the Janamat Party. Similarly, independent candidates include Navaraj Kumar Baniya, Rajman Manav, Ram Krishna Maharjan, Mim Maharjan, Prem Bahadur Maharjan, Dinesh Kumar Adhikari, Naresh Shrestha, Dharmaratna Manandhar, Ananda Maharjan, Nareshraj Pande, and Kabir Kumar Maharjan. In the 2022 local elections, the Congress candidate Nakarmi won the mayorship with 9,043 votes, while his closest competitor, Keshav Ratna Bajracharya of the UML, secured 5,507 votes. The Maoist Centre’s Shiva Saran Maharjan, who is contesting for the position in the by-election, had obtained 4,090 votes then. Of the total 31,112 registered voters, almost 14,000 live in the core area of Kirtipur, and the remaining 17,000 reside in the peripheral regions. The core area includes the municipality’s wards 1, 2, 3, 9, 10, including Tyanglaphat, whereas the peripheral areas include wards 4, 5, 6, 7, and 8. The core area is predominantly inhabited by the Newar community, while the peripheral region is more diverse with migrants in big numbers. Political leaders and analysts say that the peripheral region will be decisive in the election.But Congress candidate Krishnaman Dangol disputes this claiming that the concept of peripheral region is a misrepresentation. “The area that some people call ‘peripheral’ is in fact the core of Kirtipur,” Dangol told the Post. “From Nagau, Panga, Bhajungle, to Chobhar all are part of Kirtipur’s core area.”UML candidate Surendra Manandhar agrees with Dangol and says dividing the local unit along community lines is not a good idea.Dangol, the Congress candidate, considers UML’s Manandhar his close competitor, but some local residents say the true challenge could come from the Maoist Centre’s Shiva Sharan Maharjan, who had a strong showing in the 2022 local election. “Majarjan already contested and did well. The UML’s Manandhar is new, therefore we believe there will be a tough competition between the Congress and the Maoist Centre,” said a local resident.The Maoist Centre has also forged an electoral alliance with the CPN (Unified Socialist) and the Janata Samajbadi-Nepal, led by Upendra Yadav, to strengthen its bid.“I lost the previous election due to a technical mistake, but this time, we are confident of a win,” the Maoist Centre candidate Maharjan told the Post. He said his chances have improved due to the growing public disenchantment towards the current ruling Congress-UML coalition.But UML’s Manandhar appears unbothered by the competition. He said he is better prepared than others and is confident of a win.For the Congress, the contest appears more difficult as former Congress party members are running as independents. Kabir Kumar Maharjan and Dinesh Kumar Adhikari, who were previously with the Congress, are among the independent candidates.“The situation of Congress is different. For other parties, winning adds a seat, but losing doesn’t make much difference because they hadn’t won this seat in the previous election,” Himal Karki, a local Congress leader, told the Post. “But, for Congress, there’s a pressure to win because this is a seat our party earlier won.”An overwhelming presence of independent candidates makes the contest more complex for Congress, as local figures who have established their own identity in Kirtipur, such as Rajman Manav, are getting considerable voter attention.Harka Sampang, the independent mayor of Dharan Sub-metropolitan City, has also expressed his support for Manav. Sampang is set to join Manav’s election campaign starting from November 23.“Harka Sampang will be in Kirtipur for my election campaign,” Manav told the Post.Congress candidate Dangol, meanwhile, does not consider Manav as a competitor. He claimed that Manav is a former UML cadre and quit the party to focus on social activities, especially sanitation campaigns. “So Manav could draw UML votes, not ours,” Dangol said.Meanwhile, Suresh Maharjan, a Kirtipur resident who identifies himself as a Maoist Centre sympathiser, says the votes garnered by independent candidates will determine the election’s outcome.  ",
        "date": " November 20, 2024 ",
        "place": "Kathmandu ",
        "subject": "today News"
    },
    {
        "title": "One dead, five injured in Bhaktapur tractor accidentKMC designates 47 places for farmers to sell garlandsTen injured in bus accident at BhaktapurTraffic police relaunches no horn campaign in Kathmandu ValleyKathmandu Metropolitan City to crack down on polluting vehicles",
        "text": "One person was killed and five others injured in a tractor accident in Bhaktapur on Saturday.The incident occurred when the tractor lost control and overturned while travelling to Dekochha from Changunarayan.According to Deputy Superintendent of Police Dhundiraj Neupane of the District Police Office, Bhaktapur, 45-year-old Hari Govinda Suwal from Changunarayan Municipality-5 succumbed to his injuries while undergoing treatment at Bhaktapur Hospital. Four others—35-year-old Radhika Awal, 60-year-old Gopal Koju, 44-year-old Radheshyam Sitikhu, and 74-year-old Purnakesi Shilpakar—suffered minor injuries and were discharged after receiving treatment at the hospital.The 48-year-old driver, Ganesh Suwal, from Bhaktapur Municipality-2, is currently undergoing treatment at the hospital. ",
        "date": " November 16, 2024 ",
        "place": "Bhaktapur ",
        "subject": "today News"
    },
    {
        "title": "Bandipur, a hill station where time stands stillDDC eyes export on subdued domestic demandA Baglung youth is set to bring millet biscuits to urban shelvesYoungsters lead cyber fraud surge in NepalVisitors from ten countries, regions in Southeast Asia and Europe can scan and pay in Nepal",
        "text": "When Tanahun’s headquarters shifted to Damauli from Bandipur in November 1968, hordes of traders from Bandipur left for key cities like Chitwan, Damauli, Kathmandu, and Pokhara. The identity of Bandipur was at risk when the traders, along with the district headquarters, shifted.However, Bandipur has changed its identity due to the role of locals in cultural heritage conservation through community participation.Bikram Piya, a 55-year-old local, said that after the construction of the Prithvi Highway, if the headquarters had remained in Bandipur, people residing in the western part of Tanahun would be greatly inconvenienced in accessing government services.  “Therefore, Damauli is perfect for the district headquarters from the accessibility point of view.”Bandipur's history, a hilltop settlement 143 km west of Kathmandu and 80 km east of Pokhara, began in the 19th century when Newars from Bhaktapur arrived.Before that, it was inhabited mainly by Magars. After Prithvi Narayan Shah conquered Kathmandu Valley, the Newar merchants chose Bandipur as a trade route between India and Tibet. The merchants built their houses so as to reflect their style, architecture, and culture. Thus, the houses consist of pagoda-style roofs, lattice windows, and ornate doorways.Today, it is one of the most famous tourist destinations of Nepal. “The living culture, structure and natural beauty are the defining features of Bandipur,” said Piya.The Magars used to live in Bandipur and gave the place its name. In the Magar language, ‘Ban’ means forest, ‘Di’ means water, and ‘Pur’ means place. Civilisations have relied on forests and water since ancient times.According to old local documents, first Piya, then Pradhan, Shrestha, and Joshi settled here, and then other Newar types came.Bikram, a ninth-generation settler, says: “Bandipur is a living museum of Newari art and culture.”“Bandipur sits in the best of nature. It is also an appropriate place for business. That’s why it became a big draw for Newars from Bhaktapur,” said Chij Kumar Shrestha, an 80-year-old local. “Ancestors settled where there was water, land and jungle. Mine did the same too.”Trade was the major occupation of Newars. They supplied salt, edible oil, and other goods from Thori, Chitwan, on the Nepal-India border, and sold them in Bandipur Bazaar.Shrestha said that Bandipur developed as a trading point between the south and north. Goods imported from India used to be supplied to the hills and mountain areas like Tanahun, Kaski, Lamjung, and Gorkha, and goods brought from the hills and mountains would be supplied to the south from Bandipur.As highway expansion took place and traders started shifting to Chitwan, Kathmandu, Damauli, Pokhara, and Dumre, business activities in Bandipur started to slow down.“As young people moved away, the villages were left with old people. Even if tourists, by any chance, were found in Bandipur, they called it a ghost town,” said Sujan Shrestha, a 50-year-old local.Moved by the situation, people from Bandipur living in Kathmandu formed the Bandipur Social Development Committee in 1992. The committee's president, Sujan Shrestha, said the objective was to unite the people of Bandipur in tourism, education, and health.Sujan said Bandipur was promoted internationally because it represents different ethnicities' natural and cultural richness.“Foreign tourists started arriving, and homestays started to open,” said Sujan. “Training sessions on hospitability were provided on services ranging from tea brewing to homestay operations.” All types of vehicles started operating in Bandipur Bazaar in 1999. However, they were restricted due to the paving of market areas with stones.Bandipur is a destination preferred by those who want to escape crowds and pollution. A pleasant mountain range can be observed from the high hill of Bandipur, including the view of the rising and setting sun. A wide view of mountains is another feature of Bandipur.An open area stretches 3 km on the horizon, and hills can be observed from Tundikhel, a 10 minute walk from Bandipur.From top to bottom, mountain ranges like Langtang, Ganesh, Gorkha (Manaslu, Himchuli, and Boudha), Annapurna, Dhaulagiri, Machhapuchchhre, and Kanjirowa can be observed.A natural view tower, the land area near Marsyangdi River can also be observed from Bandipur.Developed as one of the outstanding tourism destinations of Gandaki province, Bandipur is also known as the ‘Queen of Hills.’ Located at a height of 1,317 metres, Bandipur is popular for its perfect view of mountain ranges and its cultural and religious significance. The living culture and natural beauty are the defining features of the old Tanahun district headquarters, says a 55-year-old local resident.  Post Photo “Agro-eco tourism and adventure tourism is the big draw of Bandipur,” said Kishan Pradhan, president of the Bandipur Tourism Development Committee.Tourism activity, which has slowed down due to the devastating earthquake of 2015 and the Covid-19 pandemic, is gradually reviving.“The presence of domestic and international visitors is now good,” said Pradhan.Bipin Pradhan, a hotelier, said traditional art and culture, natural views, and a clean environment are the reasons why domestic and foreign tourists come.Siddha Cave in Bandipur, a rural municipality, is claimed to be Asia’s largest.Basanta Poudel, secretary of Bandipur Tourism Development Committee, said Bandipur is also an appropriate place for hiking.“Bhanjyang and resting area located at the height of 1,150 metres from sea level, paragliding from Gurungche Hill attracts tourists,” said Basanta.Around 90 big and small hotels and restaurants are operating in Bandipur, while four community homestays in the market area and 11 in the rural municipality are in operation.The hotel and homestay services in Bandipur can cater to 5,000 people.To increase tourists' stay, a mini great wall was constructed in 2019. The 6-km wall is being constructed from Thanimai temple to Mukundeshwari hill.The construction of the mini-great wall is expected to cost around Rs20 million.“The construction of structures like this can attract tourists,” said Surendra Bahadur Thapa, chairman of the rural municipality.Construction of projects like Thanimai temple, selfie garden, paragliding area, horse riding arena, Pushpalal memorial garden, Mukundeshwari garden, and a glass bridge is moving ahead. ",
        "date": " November 21, 2024 ",
        "place": "Tanahun ",
        "subject": "today News"
    },
    {
        "title": "Seminar held on climate risks and green finance opportunities in bankingShrouded in smog, Delhi pollution reading is the highest this yearEndless stream of storms draining Philippine GDP, home incomesLahore’s dangerous smog: where disease and death stalkAgri Direct wins most innovative startup at Climate Change Competition",
        "text": "Participants at a seminar on climate risks and opportunities in Nepal’s banking sector discussed challenges posed by climate change and the need for a regulatory framework to promote green finance.The event was jointly organised by the Nepal Rastra Bank (NRB) and International Finance Corporation (IFC), with support from the European Union (EU), as part of the regional initiative ‘Accelerating Climate Smart and Inclusive Infrastructure in South Asia’ (ACSIIS).The organisers said that the seminar disseminated findings from a Climate Finance Risk Exposure Assessment and facilitated discussions on risks, opportunities, and potential steps to develop a regulatory framework for green finance in Nepal.“A well-defined and structured regulatory framework to develop a green finance market will enable Nepal’s financial sector to channel private sector capital towards climate-related projects, which will contribute to achieving our climate commitments,” said Bam Bahadur Mishra, deputy governor of NRB. “With support from the World Bank Group, NRB will work with the banking sector to strengthen Nepal’s financial sector to adapt to the growing challenges of climate change.”David N. Sislen, regional country director for the World Bank, said that climate change poses a significant threat to financial stability but also offers unique opportunities. “By helping integrate climate risks into operations, we can together build a more sustainable banking sector,” he said. “Making a difference on climate will require coordinated action between the public and private sectors, and the financial sector is central to that work.”Nepal is highly vulnerable to climate change, with its GDP projected to shrink by 7 percent by 2050 due to unchecked impacts, according to the World Bank.Jose Luis Vinuesa-Santamaria, head of cooperation at the EU, reiterated the EU’s commitment to supporting Nepal’s climate-resilient future. “Green finance fits within the EU’s Global Gateway approach, which mobilises private capital for climate and sustainable development projects,” he said. The strategy involves technical assistance, risk-sharing instruments, and de-risked funds to support sustainable infrastructure and green finance projects.IFC Country Representative Babacar S. Faye highlighted the importance of climate finance for Nepal’s green growth. “This will help the country build a greener economy that fosters sustainable growth and resilience,” he said. ",
        "date": " November 21, 2024 ",
        "place": "Kathmandu ",
        "subject": "today News"
    },
    {
        "title": "Antimicrobial resistance widespread among intensive care patients in NepalSafe motherhood programme faces funding crisisFMTC rolls out fortified rice in KathmanduNo additional mutated poliovirus in Valley sewage, national lab saysThais urged to change habits as diabetes cases cross 6.5 million",
        "text": "Antimicrobial resistance is a common problem for most patients requiring intensive care in hospitals. What alarms doctors and experts is that the problem is not limited to patients with serious ailments but it also affects those seeking outpatient care.The irrational use of antimicrobials in humans, animals, and plants has led to a ‘silent pandemic’, and many people, including policymakers, have not taken the issue seriously.“Misuse, random use, and irrational use of antimicrobials, which can be purchased over-the-counter, has been leading to a serious crisis in our country,” said Dr Raju Pangeni, a pulmonary and critical care physician at Hams Hospital. “Most patients arrive at the hospital after using higher-grade antibiotics.”Experts warn that antimicrobials, which have saved millions of lives throughout the world, could soon become ineffective due to the high resistance rate caused by their irrational use.The World Health Organisation said antimicrobial resistance occurs when bacteria, viruses, fungi and parasites evolve over time and no longer respond to medicines, making infections harder to treat and increasing the risk of disease spread, severe illness, and death. As a result, medicines become ineffective and infections persist in the body, increasing the risk of their spread to others.Antibiotics, despite being prescription drugs, can be easily purchased over the counter in Nepal. Many people buy them without explaining their exact problems to pharmacists. And in many cases, pharmacists do not bother to inquire and fail to emphasise the importance of completing the prescribed course of medicine, which is among the main reasons for the growing rate of antimicrobial resistance, according to experts.Moreover, doctors usually prescribe antibiotics based on clinical diagnoses, even before receiving laboratory test reports. Experts say antibiotics do not work if the underlying infection is caused by a virus. According to experts, a patient’s sensitivity to antibiotics must be known before prescribing them, but very few doctors take the time to understand their patients' sensitivity to the drugs they prescribe. Patients are also unaware that the course of antibiotics must be completed and stopping them halfway could render the same antibiotic ineffective in the future. According to a 2021 study of the Nepal Health Research Council (NHRC), only 32 percent of the doctors and health workers have access to laboratories for antibiotic susceptibility testing. Among them, only 49 percent recommend antibiotic susceptibility testing before prescribing antibiotics. This means that only 16 percent of doctors recommend antibiotics after conducting susceptibility testing.“There is a significant reason influencing rational prescriptions of antibiotics,” the report stated. The study also shows that more than one-third—37.8 percent—of prescribed medicines were antibiotics, which is higher than the World Health Organisation’s standards.The study shows about one-fourth (22 percent) of the outpatients did not consume a full course of antibiotics. Similarly, about 10 percent of outpatients consume antibiotics as prophylaxis while eight percent take double-dose antibiotics for a quick recovery. Around 22 percent of them save leftover antibiotics for the treatment of similar symptoms in the future. Additionally, around 28 percent of outpatients said they buy antibiotics without doctors’ or health workers’ prescriptions. While human antibiotic use contributes to antibiotic resistance, the widespread use of antibiotics in agricultural applications—most notably livestock and poultry production—is also a potential driver. Doctors say agricultural antibiotics contribute to the presence of resistant bacteria in meat and poultry products. Also, resistant organisms are released from farms into soil, groundwater, and surface waterways, leading to contamination of water sources used for crop irrigation and domestic purposes.The NHRC study showed around 70 percent of farmers used progressively higher doses of antibiotics and more frequently for faster recovery of sick animals or fowls. The study identified major shortcomings in the awareness and availability of national guidelines for prescribing antibiotics and infrastructures for recommending antibiotic susceptibility tests among human and animal health professionals. In a study of human, animal, and environmental samples carried out in the past, antimicrobial resistance genes were detected in 81 percent of the total samples on which antimicrobial resistance tests were carried out. ",
        "date": " November 21, 2024 ",
        "place": "Kathmandu ",
        "subject": "today News"
    },
    {
        "title": "Dusit Princess Kathmandu hosting trout festivalThe trials and tribulations of home-bakingKathmandu’s queer ‘oasis’Taking Nepali taste to New YorkPatience, passion and pastries",
        "text": "Dusit Princess Kathmandu is organising a five-day trout festival at its SOI restaurant. The dishes will be available for order from 12:30 pm to 10:00 pm every day till August 30. In celebration of Nepal’s rivers and lakes, which provide an ideal environment for high-quality trout, the Director of Culinary Food and Beverage Service, Chef Utpal Mondal, and his team at Dusit Princess Kathmandu have crafted a menu showcasing the flavours and versatility of locally sourced trout. “As the festive month of Shrawan ends, people focus on healthy and nutritious food. Trout, rich in omega-3 fatty acids, vitamins, and essential minerals, offers a heart-friendly option that checks all the boxes from a nutritional and culinary standpoint,” says Mondal.He adds that the goal of the culinary event is to offer their guests a rare opportunity to experience a wide variety of trout dishes they wouldn’t typically find at home.The event menu features twelve unique dishes, six of which are drawn from diverse culinary traditions across continents. Three dishes are inspired by oriental cuisine, while the remaining three highlight flavours from Nepal and India. The menu has been designed to include various dishes, from soups and starters to main courses, including Mexican, Italian, Continental, and Thai flavours.While discussing the event’s highlights, Mondal said, “The celebration presents a unique opportunity for guests to indulge in a diverse range of trout-based dishes, something they wouldn’t typically have the chance to experience elsewhere.” ",
        "date": " August 26, 2024 ",
        "place": "Kathmandu ",
        "subject": "today News"
    },
    {
        "title": "Khokana: A serene time capsule away from Kathmandu bustleThis summer, I saw the Everest up-closeSri Lanka: Exploring Ravana’s ancient realm7 places in Nepal you should visit in 2024Old memories and new realities in Phidim",
        "text": "The noise of ever-growing traffic, the breaking and mending of black-topped roads, and an ever-expanding concrete jungle are some features that one would associate with the Kathmandu Valley.It is a wildly growing urban forest quickly transforming into a busy metropolis where every inch of space is ready to be sold and built. Yet, pockets of the past remain—small, peaceful neighbourhoods where houses are still made of wood, paths are made of stone tiles, and the stillness of a world that wants to stay intact and immobile. These places are known for tourism, culture, and the restoration of community pride. One such stop is the quiet village of Khokana in southern Lalitpur.Khokana is comparatively close to the mainland urban Lalitpur; from the ring road junction of Bagdole, it takes only a 10-minute drive to reach there. From the airport, you can take a cab directly to Khokana, which will take around half an hour. Get your cameras and hiking boots ready; the area is filled with historical artefacts and hiking trails.However, it is vastly different from the city. It is much nearer to the hills, where stone-paved paths, which could easily be goat trails, are rare in today’s Kathmandu.One such goat trail leads to Sikali temple, a major attraction of the area and accessible only on foot. The pavements are lined with big and small temples on each side, along with ponds that serve as clean water sources and a location for religious rituals. The houses are made of bricks and wood. The concrete invasion, although present, is minimal. Scattered every few hundred metres are small mustard oil mills, co-operative businesses of the locals of Khokana that have existed since medieval times.A site well-recognised for its historical significance, Khokana was even proposed to be made a UNESCO World Heritage Site in 1996. Ponds like this one are used for religious rituals.  Kshitiz Pratap Shah/TKPSikali TempleAround an hour’s walk from the historic town, Sikali Temple can be reached, which is also the location for its famed Sikali Jatra.While it can be reached through any public vehicle, a more holistic and adventurous route is to follow the goat trails on the outskirts of Khokana. This route, albeit long, allows for great hiking opportunities, scenic views of the hills surrounding the Kathmandu Valley, and a close-up view of the mediaeval but well-maintained architecture of the local houses.Even if you lose the way, which is very possible, the locals are very welcoming and more than willing to guide you. The main temple itself is three stories tall, and built in the Pagoda style, a common style in many temples in the valley.It is surrounded by a lush grass field which plays the stage to the Sikali Jatra held every year. The temple, like many religious spots around Khokana, is dedicated to the local deity Shree Rudrayani.The Sikali Jatra, a five-day festival that serves as an alternative to Dashain for the Khokana locals, is filled with chariot dances, battle enactments, and storytelling celebrations in the worship of Goddess Rudrayani.Starting from Ghatasthapana in mid to late September, the Jatra is vibrant and an essential experience for every visitor. A map showing the way to Khokana from Tribhuvan International Airport.  Kshitiz Pratap Shah/TKPHistorical Khokana townKhokana’s historical town is located around 5 minutes walking distance from the local bus park. The town complex, paved with hand-made stone tiles, is graced with the Indrayanee temple but also has many red-bricked houses built in the local Newari architecture, some of them centuries old.One such house is the ‘Khokana Museum’. Although closed, it is widely popular for being the first house to be lit with electricity in Nepal, as Chandra Shamsher did in 1911.The stand-holder of the first light bulb can still be seen, serving as a historical monument for everyone to see.Similarly, the town complex is also filled with Guthi houses, small ponds, and even the local Ward office. While the Ward office provides a wealth of information for visitors interested in the area’s history, the Guthi halls symbolise the strong community support culture of the locals.The ponds, a notable one present right opposite the Indrayanee temple, have stone taps and remind us of primitive ways of obtaining clean water—a practice many locals are still engaged in.Yet, these ponds are also religious locations, especially used in rituals in the Sikali Jatra.Finally, a stroll through the complex allows visitors to explore old houses and historical artefacts in the serene quietness of Khokana, while the small outlets and Choila places nearby allow you to enjoy the spicy duck or chicken delicacies at the same time.Overall, the historical complex is enough to transport visitors back to a glimpse of the medieval past of the Kathmandu Valley. Some of the equipment used in mills date back to 300-400 years.  Kshitiz Pratap Shah/TKPMustard oil millsThe most well-known feature of Khokana is its mustard oil mills, which have been operational for hundreds of years and have been using the same methods of preparation since their inception.These mills, scattered throughout Khokana, are often community-owned, and even the ones owned by certain individuals have almost exclusively employed locals.Despite the advent of modern machinery, there is still substantial demand for their products due to the assured guarantee.When I visited one such mill, the local staff informed me that the furnace and oil presser used by them were 300 years old, given by the Patan royalty even before the Shahs became king.In addition to buying pure, organically created mustard oil and pellets, visiting these oil mills offers many educational benefits for international and local tourists alike.Khokana offers visitors a unique glimpse into a preserved bubble of the past through its tranquillity, preservation of ancient lifestyle and cultural elements, and remarkable self-sustenance.  ",
        "date": " July 5, 2024 ",
        "place": "Kathmandu ",
        "subject": "today News"
    },
    {
        "title": "Lessons on coding and AI to start in fourth grade: Indonesia Education MinisterAI to detect accidents in real-time in MalaysiaChina’s humanoid robot industry records robust profitsOsaka-Kansai Expo: Robot avatars to be operated by online visitorsBillionaire and engineer conduct first private spacewalk in SpaceX mission",
        "text": "Elementary and Secondary Education Minister Abdul Mu’ti said the ministry will soon roll out a new plan that will allow students to be taught the subjects of artificial intelligence and coding.Mu’ti, however, said that the lesson on AI and coding would be elective and would only be available for students in fourth grade.“For elementary school, the subjects won’t be available for first graders, but only for fourth graders, fifth or sixth,” Mu’ti said, as quoted by Antara.The newly-inaugurated minister also said that the ministry is looking into the possibility of hiring new instructors to teach AI and coding or collaborating with institutions already specializing in the two subjects.In a statement published on Thursday, the ministry said that only schools with adequate tools and a reliable internet connection could start giving lessons on coding and AI.Earlier on Thursday, Communications and Digital Minister Meutya Hafid said he was in talks with Mu’ti on how to include coding in a new curriculum drawn up for elementary and secondary school students.“In principle, we have agreed that we need to have a curriculum on coding,” Meutya was quoted by Antara state news agency.Discussion on the plan to include coding and AI in the new curriculum was sparked earlier this week by a statement from Vice President Gibran Rakabuming Raka who said he had given orders to Mu’ti to start working on a plan to teach coding to elementary students.“We should not lag behind India [on coding]. To get to Golden Indonesia we need a golden generation, those who are experts on coding and AI,” Gibran told a gathering on Monday.-In Association with ANN ",
        "date": " November 19, 2024 ",
        "place": "Jakarta ",
        "subject": "today News"
    },
    {
        "title": "Brilliant Paolini leads Italy to fifth Billie Jean King Cup titleGerson stunner gives Brazil 1-1 draw with Uruguay in World Cup qualifierSuperb Martinez strike gives Argentina 1-0 home win over PeruNo fairytale ending as Nadal’s career ends in defeatNathan Sowter joins Kathmandu Gurkhas",
        "text": "Jasmine Paolini put on a tennis masterclass to steer Italy to a fifth Billie Jean King Cup title as she beat Rebecca Sramkova 6-2 6-1 in the second singles rubber to wrap up a 2-0 win over Slovakia in the final on Wednesday.A year after Italy suffered a heartbreaking defeat to Canada in the decider and over a decade since their last title in 2013, the charismatic Paolini demolished Sramkova before celebrating wildly with her teammates and jubilant Italian fans, including men’s world number one Jannik Sinner.Underdogs Slovakia, who had stunned Britain on their way to the final, never got going against an imperious Italy who got off the mark with Lucia Bronzetti’s dominant 6-2 6-4 win over Viktoria Hruncakova in the opening match.“It’s unbelievable, amazing, I don’t have words to describe how I feel right now, it’s just incredible,” an emotional Paolini said on court.“I think we played an unbelievable week and I'm so proud of how we did it in every match. I’m very happy that this year we finally were able to bring the title back to Italy,” the world number four added.Paolini fell to a 6-2 6-3 defeat to Canada’s Leylah Fernandez in last year’s final in Seville.Yet this time around the Wimbledon and Roland Garros finalist Paolini put in a commanding performance against the 43rd-ranked Sramkova, who tried to gut it out while suffering with cramp throughout the second set.“I think last year Leylah (Fernandez) played really well, she played better than me. That’s the way it is sometimes in sports,” Paolini said.“Today when I stepped on court I told myself that I was going to give 100%... If you win, you win. But if you lose you have to accept that. We are going to fight for every ball and today it went well for us.”Italy's perfect day started with a superb performance from 25-year-old Bronzetti, who was playing only her second BJK Cup singles match, following her debut win in the semi-final against Poland .Bronzetti was firing rockets with her serve and dominated Hruncakova in two quick sets that lasted just one hour and 20 minutes.“I’m very proud to be here, to represent Italy, I’m so happy for this win,” Bronzetti said.“It was not as easy as it may have looked. We are in the final so every match is tough. I’m very happy to have earned the point for Italy.”Paolini went about her business even quicker, beating her opponent in one hour. ",
        "date": " November 21, 2024 ",
        "place": "Spain ",
        "subject": "today News"
    },
    {
        "title": "Elon Musk’s Neuralink receives Canadian approval for brain chip trialUkraine launches UK cruise missiles into Russia, a day after using US ATACMSBillionaire Gautam Adani of India’s Adani Group charged in US with bribery, fraudIsraeli strikes kill 19 in Gaza; hospital in north makes distress callBiden approves anti-personnel mines for Ukraine, US official says",
        "text": "Elon Musk’s Neuralink said on Wednesday it has received approval to launch its first clinical trial in Canada for a device designed to give paralysed individuals the ability to use digital devices simply by thinking.The brain chip startup said the Canadian study aims to assess the safety and initial functionality of its implant which enables people with quadriplegia, or paralysis of all four limbs, to control external devices with their thoughts.Canada’s University Health Network hospital said in a separate statement that its Toronto facility had been selected to perform the complex neurosurgical procedure.Regulator Health Canada did not immediately respond to a request for comment.In the United States, Neuralink has already implanted the device in two patients. The company says the device is working well in the second trial patient, who has been using it to play video games and learn how to design 3D objects.Founded in 2016 by Musk and a group of engineers, Neuralink is also building a brain chip interface that can be implanted within the skull, which it says could eventually help disabled patients to move and communicate again, and restore vision.In September, the startup received the US Food and Drug Administration’s “breakthrough device” designation for its experimental implant aimed at restoring vision. ",
        "date": " November 21, 2024 ",
        "place": "kathmandu",
        "subject": "today News"
    },
    {
        "title": "Are Nepali independent singers struggling for a platform?Kites over Kathmandu skyThe Kumari tradition lives on, balancing ancient and modern valuesThe royal roots of Central ZooMinpachas: Adventures in the time of Kathmandu’s long winters",
        "text": "Piroo Rana, the singer of the popular song ‘Satayera’, says that even today, many people are unaware that she sang the song. “I did not get proper credit for it,” she says.Today, going viral on TikTok, Instagram reels, or any other social media platforms is key to making a song garner millions of listeners. “Until a song becomes a trend, regardless of its quality, it is difficult to reach a wider audience,” says Rana. There has been a significant rise in the number of indie musicians in Nepal. Originally from Itahari, the Chumbak band says, “There are a lot of artists coming from the East as well.” With artists creating original music, the growth of indie artists is encouraging. However, the challenge of getting noticed amidst the overwhelming noise of viral trends remains. Singer-songwriters Piroo Rana, Amit Jung, Abiskar Bikram Gautam and Chumbak band have struggled to get a platform to showcase their musical talents. Each of their journeys to get recognition in the musical landscape of Nepal has been unique. Reflecting on his journey, Gautam shares, “I have always tried to be genuine while creating music. My recent songs like ‘Timi Sangai’ and ‘K Saath Dinchau’ are drawn from my experiences.” Despite the major setback in her song ‘Satayera’, Rana says, “Before putting out my original music, I felt I needed to have some relevance, so I started my journey by singing cover songs.” Only after the release of her song ‘Shabda’, which she had roughly put out, did she start getting noticed for her music. This also helped her gain a lot of followers on Instagram and YouTube. Jung, who has turned music into his full-time career for nearly six years, says he is still refining his craft. His song ‘Barsa Bhayecha Nepal Nafarkeko’ earned views on Youtube. “This song encapsulates my thoughts when I hadn't returned to Nepal for years. Especially during Dashain, nostalgia hits hard when you are away,” says Jung, signifying the importance of connecting music to his audience. Piroo Rana  Photo: Courtesy of Piroo RanaAccording to Chumbak Band with Sahil Sen (guitarist), Anil Tamang Gonba (Vocals), Lav Sherpa (guitarist), Sanjaya Shrestha (drums) and Bibek Tamang (bass guitar), “We used to upload videos every day. We put out small ideas even if it wasn't the final product. At first, it was just one or two people noticing, but gradually, more and more started following us.”Now, the band has its record label, KLM Records, through which it organises an event called ‘NO cover day’, during which budding artists are encouraged to sing their originals. While financial challenges remain for every artist, the band lacked support in their early days. The band did not receive support from its hometown, Itahari, during its initial phase. “Promotion companies back home did not do their jobs properly; some even told us that we weren't ready and discouraged us,” Sen recalls.Acknowledging the challenges of starting something new, the band also criticised the lack of proper infrastructure in music institutions in Itahari. “Those so-called institutions were just mere buildings as major practice rooms or studios; full drum sets and amplifiers were lacking, which made recording and practising difficult,” says the guitarist of the band Sherpa.They add, “Compared to other regions, it is easier to work in Kathmandu because we get to work with professional people.” As for Jung, breaking free from his family's expectations remains a major challenge. “Especially in Nepal, when one decides to earn by pursuing a career in the arts, it is difficult because both the family and the society impose certain expectations from you: what you should do, how much you should earn, etc,” he explains.Jung acknowledges that such challenges are inevitable, considering music his full-time job. “These challenges are part of being an independent artist,” he says. Drawing from his experience performing abroad, Jung also observed a pattern in the event organisers where they often prioritise artists from their community. “An artist might not belong to a particular community, but they could still be talented. To allow art to flourish, it is important to recognise and promote the best talent, regardless of one's background,” says Jung. Amit Jung  Photo: Courtesy of bullet rokkaFor someone belonging to the LGBTQ community, Rana faced multifold challenges. “When I first started singing, people would ask if I was a boy or a girl.” Rana also felt that her neutral vocal texture presented as a challenging factor. “I have a very neutral voice; that is why I never fit into the category of a typical female vocalist,” says Rana.For her, the first challenge stemmed from her insecurity of being queer, which led to a lack of confidence and fear of rejection. “However, in terms of my identity-whether I'm straight or queer, music is what matters most to me. My identity has never stopped me from creating music,” says Rana.Rana also noticed nepotism in the music industry. “It seems the more influencers you know, the more popular your song becomes,” she says.Like Rana, Gataum also feels pressured to stay relevant on social media. While he acknowledges staying active on social media to build a fanbase and networking, he says, “Staying active on social media consumes a considerable amount of my time that could otherwise be devoted to my music.” Gautam has been creating his own music without the backing of a record label or a dedicated team. He says, “Balancing the creative side of making music with the business and promotional aspects is challenging.”However, Gautam sees this responsibility as an opportunity. He says, “Being shouldered with responsibilities compels me to be more innovative and resourceful and makes me seek new ways to stand out and connect with my audience in a crowded music landscape.”When asked about the changes required for the Nepali indie music industry to grow, Gautam emphasised the importance of creating a stronger sense of community among indie musicians. Abiskar Bikram Gautam  Photo: courtesy of Avhisekh giriIn addition, Rana says, “Compared to the male artists, who frequently work together, the Nepal music industry lacks female collaborators.” On the other hand, Jung believes that artists need to take their art seriously, quoting, “Art should comfort the disturbed and disturb the comfortable”.He also believes that music as a form of art can act as a bridge connecting people living abroad to their roots back in Nepal. “By reconnecting the authenticity of Nepali music, artists can create a richer, more diverse indie music scene that resonates with local listeners,” says Jung. He also highlights the importance of pioneers like Narayn Gopal, who kept Nepali music alive even when global trends dominated, ensuring that Hindi songs did not overshadow Nepali songs. He emphasises the responsibility of artists to preserve and carry forward this authenticity.The artist advocates for blending global influences with local taste in Nepali music, focusing on preserving Nepal's unique musical traditions while staying open to global trends. Chumbak group and Rana agree on the importance of consistency while making music. “It might take twenty songs before you get noticed. However, how often you release songs and push yourself will determine how successful you become,” says Rana.According to Chumbak band, while remaining consistent and confident in one’s creation is important, “Listeners should also explore new songs, and they should explore beyond just TikTok and trending songs,” says Sherpa.Lastly, Rana feels like there should be a collaboration platform where artists can give feedback to each other before showing their work to the audience. “I just hope everyone keeps trying and doesn’t give up,” she says. ",
        "date": " October 26, 2024 ",
        "place": "Kathmandu ",
        "subject": "today News"
    },
    {
        "title": "PTI’s political tactics Sleeping through the AnthropoceneA voice of reason goes silentCPA and post-conflict NepalEconomic costs of leaders’ rants",
        "text": "Pakistan Tehreek-e-Insaf (PTI) is bracing for a confrontation on November 24 as it has called a massive rally in Islamabad demanding the release of its leader, Imran Khan. Khan has been imprisoned for a year on several cases, including the attack on a military installation, corruption and the Al Qadir Trust case. Initially, the party leaders and its members of Parliament were set to participate in the protest; now, it has been extended to the entire nation. The PTI is apprehensive that its leaders may not join the rally as they might come under pressure. Therefore, general participation by sympathisers would keep the party’s popularity in good standing. Despite challenges and roadblocks, the party has always worked on show of strength; however, the May 9 incidents of violence and attack on the army installation, including a Corp Commander’s house, are a reminder of how such confrontation may go out of control.The PTI has put forward three demands to call off the rally. First, reversal of the ‘stolen mandate’. The PTI thinks that in the last election, the party would have won but was denied due to the ‘mechanisation’ of the establishment, which allowed the Pakistan Muslim League (N) to form a new government. However, this narrative is not new. The party spoke about this when the last election voted the PML (N) into power. Second, the release of all the political prisoners of the party, and third, the reversal of the 26th Amendment Act passed recently by the Parliament.PTI’s confrontationKhan was perceived as the blue-eyed boy of Pakistan’s military establishment when he was elected prime minister. However, he fell from grace due to his confrontationist attitude with the powerful military. He blamed General Qamar Javed Bajwa, former Army Chief, for the no-confidence motion in the Parliament that forced him to resign in 2022 and, later, his election defeat in the February 2023 election. This was despite Bajwa being granted a three-year extension by the Khan government.His attempt to promote Lieutenant General Faiz Hameed as the next Army Chief did not succeed. Gen. Hameed has been arrested and is facing court-martial on charges of corruption and abuse of power. Khan’s removal of Gen. Asim Munir, the current Chief of Army Staff, as Director-General of Inter-Services Intelligence was considered a political blunder. Yet, this was the first time the Pakistan Army was divided over their support for Khan, showing how he could create a political space for himself within the army as their best bet.The army blames Imran Khan for the May 9, 2023, attacks, which severely blew the image of Pakistan’s military as an invincible player in domestic politics. The army holds Khan responsible for the inflammatory speech that motivated his supporters to attack. The military strengthened its position after the Shehbaz Sharif government passed an amendment to the Pakistan Army Act, 1952, extending the tenure of the heads of the armed forces to five years. This would mean that Khan’s troubled relationship with the current Army Chief will not end soon. Parliamentarians from the PTI tore the bill in the National Assembly as a symbolic protest. Imran’s offer of dialogue with the government to resolve the problem notwithstanding, both for Sharif’s government and the PTI, the rally is a show of strength. This call for protest may rejuvenate the cadres and prove Khan’s political strength; however, the government will take all steps for its failure.Imran Khan and populismKhan has used his popularity for populist politics, evident through street power asking for fresh elections even after losing the election. He flags the ‘injustice’ he has suffered with false cases to motivate their workers to hold rallies. Despite attempts by the military, the leaders have remained united, fought the last election as independent candidates and desisted allurement to leave the PTI.Yet Khan feels that some Parliamentarians may not join the PTI workers on the street. He has underlined that those elected on party ticket must be in Islamabad to support the PTI leadership. Meanwhile, the government has imposed Section 144 to foil the rally. The ban on it came after Khan’s supporters fired at the police during one of the overnight raids. If the past is an indicator, the PTI supporters have broken curfews and participated in party rallies. Each member of Parliament from the PTI is asked to get as many supporters as possible to make the rally successful.Khan’s narrative is that he is innocent and is being politically persecuted for his stance on several issues of corruption and the role of the Army and external powers, especially the United States, in Pakistan’s politics. His supporters also believe that their leader is being politically victimised through the judiciary, where several corruption cases have been decided against him. Top party leaders are also in jail. So, who will lead the party and motivate the supporters to break the curfew and join the Islamabad rally? His wife, Bushra Bibi, is facing several corruption cases, and his sister, Aleema Khan, has been making statements for the past few weeks asking his supporters to march to Islamabad. She is also meeting the PTI supporters and has been critical of the party leaders who have failed to pressurise the government for the release of their leader.The PTI may not be able to hold the rally in Islamabad on November 24, but it is hell-bent on giving a fight to the establishment and putting forth their demand to release Khan. It will also demonstrate that their leader continues to hold sway over the party and has the charisma to organise rallies even while in jail. ",
        "date": " November 20, 2024 ",
        "place": "kathmandu",
        "subject": "today News"
    },
    {
        "title": "Korala lessonRegion to worryA promising startWhy go to China?Dangers of diabetes",
        "text": "The inauguration of an immigration office at Korala border point in Upper Mustang’s Lo Manthang on October 30 had given a message of improved connectivity with the northern neighbour. But the excitement didn’t last as the office, opened with fanfare, was closed without delivering service for a single day. While unveiling the commemorative plaque, Home Minister Ramesh Lekhak was flanked by a group of high profile officials. Gandaki Province Chief Minister Surendra Raj Pandey, heads of three security agencies, director general of the immigration department, among others, landed at Lo Manthang to attend the function. No sooner had the VIPs returned to Kathmandu, other officials deployed there also decamped as Tihar festival began the next day. But they didn’t go back even after the end of the festivities citing the biting cold of the high mountain. Nepal has kept the border facility closed since the inauguration citing severe cold. This is a lame excuse. The weather didn’t suddenly turn cold there, nor has the situation on the ground worsened due to a natural disaster or other unforeseen events. Everyone knew that Lo Manthang, which is situated at an altitude of 4,650 metres, would witness a freezing cold in the winter. The authorities should have prepared before the inauguration. By contrast, the offices on the Chinese side are operating just fine. Bringing the immigration and other offices into operation at Lo Manthang is important as the Korala border point not only connects Nepal and China but also has a potential to be a trilateral trade junction between Nepal, India and China. Nepal has been building the Kaligandaki Corridor national pride project that connects the Siddhartha Highway in the south to Korala in the north. When the road is complete, the route from Nepal-India border point at Sunauli to Nepal-China border point at Korala through Siddhartha Highway and Kaligandaki corridor can be an alternative trilateral trade route linking the three countries. While important religious destinations such as Lumbini and Muktinath are on the route, it also connects Nepal’s important cities including Pokhara and Chitwan.Failure to bring this border point into operation has multiple effects. First, it undermines the route’s huge potential. Second, it leaves a bad impression on the Chinese. Indian, Chinese, and other countries that have been supporting us have a serious concern about Nepal’s negligence in development works. We sign agreements or inaugurate projects with a lot of noise, but don’t work on their maintenance or sustainability.Closure of Korala immigration is a case in point. Several projects started with Indian support have met with similar fate. India’s railway company constructed the Kurta-Bijalpura rail section and handed over the rail line to the Nepal Railway Company Limited last year. It has since been helping operate the train as Nepal is still to train its own staff to run the train.As Prime Minister KP Sharma Oli works on a wish list to be presented before Chinese leaders during his Beijing visit in the first week of December, such failure in bilateral initiatives weaken Nepal’s position. When Nepal seeks other countries’ support in its development endeavours, it must at least be ready to shoulder its share of responsibility. India and China have shown ability in infrastructure development, both at home and abroad. By failing to do even the bare minimum to take them into confidence, Nepal is severely undercutting its development prospects.  ",
        "date": " November 20, 2024 ",
        "place": "kathmandu",
        "subject": "today News"
    },
    {
        "title": "India should not have a veto on third-party investment in NepalChina should show magnanimity and waive off the Pokhara airport loanFailure of UML-Congress coalition may be projected as a failure of the systemBeing a politician does not shield anyone from investigationWe must revisit our infrastructure designs after recent weather event",
        "text": "Indian Political Scientist Pratap Bhanu Mehta has served on many central government committees, including India’s National Security Advisory Board and the Prime Minister of India’s National Knowledge Commission. A distinguished academician, Mehta has taught at Harvard, Princeton and JNU. Mehta, who was recently in Kathmandu for the fourth edition of Kantipur Conclave, talked to Purushottam Poudel and Jagdishor Panday on a range of issues. Excerpt:How can we hold populist leaders accountable? Populist leaders who rise to power questioning traditional political parties and elites, seldom entertain the questions they themselves get. Let alone be accountable, the populist leaders even disagree with how they are described. If we talk about Indian Prime Minister Narendra Modi, you see him most of the time at election rallies. There is a joke in India that it is always in election mode. Why should they be accountable to intermediate institutions when they are accountable to the people themselves? The essence of populism is to, in a sense, say that there is nothing between them and the people. And they feel like, who are the other people to ask them questions? When they get reelected with people’s mandate, what better accountability can there be? In the age of information technology, populists speak directly to the people. Like Indian Prime Minister Modi, Donald Trump, the newly elected President of the US, had a similar approach during the US election. One short video can reach millions of people, and there are Elon Musk-like people who make sure that such a video reaches the masses.When they are directly connected to the general public, they feel like they need not be accountable to a certain group of people in society, let’s say, elite professionals. Populism is not a new phenomenon, but with the rise of social media, it seems to be gaining momentum. Can we differentiate between populism pre-social media and post-social media? We should not exaggerate the importance of social media for the rise of populism. When we look at the Bharatiya Janata Party, the major ruling party of India, the remarkable thing is how hard they work in old-fashioned campaigns; they knock on people’s doors to reach out to them. Trump did rallies after rallies before the US presidential election, so it is not necessary to buy the myth that it is the only social media that ignites populism. However, I do not want to discredit social media. The thing that is easy to do with social media is to destroy the credibility of old elites. There is an asymmetry between truth and doubt. If I want to create doubt about you, it’s easy; I can cook up something stressing that what I claim is true. And we are in a moment where most authority structures are collapsing under the weight of that doubt. That is what all populist leaders thrive on. All they need to do is create doubt about the other side. They don’t have to test whether their claims are valid. Given the velocity at which social media works, fake information disseminates easily. If someone makes a provocative clickbait tweet, by the time the other side collects accurate information for clarification, thousands of people would already have seen the tweet.Soon after the printing press was invented in Europe in the 16th century, one consequence was a total collapse of the authority of the Catholic Church. After the press, people started to interpret things in their own way. The printing press coincided with two things: a great democratisation of knowledge and, on the other hand, a total collapse of authority. Populists like the collapse of authority because that creates space for them.Therefore, I think we are in a period of trial and error. For example, there was great optimism that after the Arab Spring, social media would help democratisation. But we now realise that more than creating conditions for emancipation, it is mobilising hate in society. For me, the more critical question for democracy is the ownership of social media. Right now, social media is not only a medium. It is embedded in a structure of private ownership whose motive is profit. When your revenue depends on the number of likes you get, you will speak or write in a way that gathers you more likes. So it is a big elephant in the room of democracy, just like it was for the mainstream media many years ago. During Modi’s first term, Sushma Swaraj led the foreign ministry. In his two latest terms, S Jaishankar has been doing so. Do you find any differences in their styles, or can we term Swaraj a liberalist and Jaishankar a realist? In international relations, as a cardinal rule, you always watch what people do, not what they say. I mean, personality becomes their statement in most cases. Swaraj was a very adept and endearing politician. She knew how to talk like a politician. There was something charming about her. But I don’t think that is the key difference here. When it comes to decision-making, the Indian power structure is very centralised. Foreign policy perhaps more so. Additionally, I do not think there has been a major shift in foreign policy in the three terms of Modi. The objective remains the same: to create maximum space for India’s development. India is always in an interesting position in the region, being friends with everybody and having better relations with everyone. It is the only power that can talk to Russia, America, Iran, and Israel; this is a remarkable achievement. In the neighbourhood, I think it is a bit different. Manmohan Singh represented a generation that was convinced that the fate of the subcontinent was tied together. India is in the region; it cannot claim to be a global leader if it doesn’t do well in its own region. I think the present regime in India thinks that India can transcend its region. They might think that they are the big power, and they deal with big powers. I see that the present government has invested less in the region compared to the previous government. The second big change is cultural, which is also reflected in policy. I think 15-20 years ago, Indian politicians and civil society had more broad-spectrum relations with politicians and civil society in our neighbouring countries. When disputes arise in the region, social familiarity can help get over them. Familiar relations also allow you not to focus just on the near future and on tactical gains. But due to the centralised policymaking in India, I see less public interest in India’s neighbourhood. I see much less intelligent discussion of our neighbourhood in India now than 10 years ago. Due to which we are constantly surprised by what’s happening in our neighbourhood. Which also shows that we have less social connection. Are you suggesting Modi’s ‘neighbourhood first’ policy has been a failure? To adjudicate on success or failure, you require prior account of your objective. At one level, you could say that. But, on the other hand, in Sri Lanka, India did well while addressing the debt crisis. There was also a period of blockade in Nepal years ago. India needs to reflect: Can we actually coerce our neighbours to do things we want? That’s not what we should do. Being of considerable power means we can care deeply about our neighbour’s well-being. The axiom should be that if Nepal and Bangladesh or any of the South Asian countries do well and grow, it’s to India’s benefit. Government comes and goes, but development remains. I don’t see that kind of commitment from India. Instead, I see it as being guided by geo-strategic considerations vis-à-vis China. India should not have a veto on third-party investment in any of the neighbouring countries, including Nepal. Ultimately, if investment comes to Nepal, it will benefit India. Honestly, I feel that our neighbouring countries’ leadership doesn’t help; they often try to trade off their short-term benefit with the long-term benefits of the country; they are often found using one card against another neighbour. Good relations between countries are often built on creative work of civil society, businessmen, and other sectors. Modi travels across the world to participate in different forums; plus he is an election man. How much time can he spare for neighbouring countries? Other sectors of India are investing less in the neighbours; if you think that’s a failure of India’s foreign policy, then yes, I also would say it is a failure. When it comes to India’s relations with other South Asian countries, why is China such a big concern?I will be very honest, there are many politicians who overplay China when it comes to relations with India, and vice-versa. Former president of Sri Lanka Mahinda Rajapaksa tried to do the same. The new government of the Maldives came in so hostile to India, expelled Indian troops soon after being elected as president. However, we have completely made up with them. The Maldives also realised that it struggles without Indian tourism. The problem is that some people in our political class, intelligence services and bureaucracy try to be clever by half. When it comes to China in South Asia, to be fair to the Indian establishment, they are actually quite sophisticated in their thinking about global chess moves. India is clear what its development interests are. And it is going to engage with whoever serves those interests. As I have already mentioned, India is the only power which is engaged with every great power.  Post Photo I think it’s time to evolve to a detente with China after the Galwan clash. Relations are opening up again. When it comes to South Asia, it is not only about what India thinks but also what China does. When it comes to India, the biggest puzzle is that India could not fully understand China’s motives. And this is not only a problem of India but of most of the world. It is hard to read Chinese preferences.The big tragedy and frustrating thing about foreign policy discussions in South Asia is that we know our stories, we talk, we write, but we have absolutely no idea what the Chinese preferences are in the countries in the region. So my own sense in the India-China relationship is going to be driven more by what China does. If China makes a conciliatory move, India is going to respond.With Trump being re-elected the US President, how will the India-US relations fare during his second term?It seems like the Trump administration will have a pro-India team. Trump has picked Mike Waltz as the National Security Advisor. Waltz used to be the head of the Indian caucus, and Marco Rubio is Secretary of State. Both are pro-India whereas they are bulwarks against China. So if you actually look at his team, India is happy.On the other hand, he has contradictory interests. The Americans have an interest in promoting India in the global system, at least as a kind of balance against China. And I think one of the things the US has realised is that India is not going to be any ally but just a friend. There used to be a joke in the US that Pakistan is an ally, but not a friend. India is a friend, not an ally. So now they have learned to deal with India differently. Additionally, Indian Prime Minister Modi has good relations with Israeli Prime Minister Benjamin Netanyahu, which is very important to the US.Despite all this, I think there is going to be friction or at least possibly friction in trade policy. For example, Elon Musk wants Starlink to come to South Asia, which is going to be tricky for India.The other area that would create friction with Trump in the Oval Office is the issue of climate, which also matters to Nepal. With Trump, there could be severe consequences, and the worst of it will hit South Asia.How do you think the twin developments of India-China rapprochement and Modi’s rapport with Trump will play out?India was actually comfortable with administrations of both the Democrats and Republicans. The Democrats sometimes lecture India a bit more, but the truth is there is a bipartisan consensus on India in the US. Given that the US is paranoid with Russia and Iran, who would have thought that India will have close relations with both these countries? So there is a bipartisan consensus.The Indian elite is now completely merged with the elites of the US. Every single ideological strand of US politics has a prominent Indian-American face. India-US relations are beyond geo-strategy. In my opinion, geo-strategy is the least interesting part. There are very few families in India’s elites who now don’t literally have family connections in the US.The governments of two countries might quarrel, geo-strategy will take its place, but the social dynamics of the relationship are much more powerful in a way which India can never have with China or even with Europe excluding the UK.However, India needs both the US and China. It needs the US for high-tech stuff. It needs China for lots of cheap intermediate imports to power its own industralisation.On the rapprochement between India-China, China reached out considering the possible Trump tariffs. China too will need some export partners.When India needs China for its industralisation why is Nepal’s economic ties with China a matter of concern for India?In South Asia, China is all in. We’re all reliant on Chinese imports, not just consumer goods, but even to power whatever industries we have. China is increasingly becoming a technological powerhouse. Nepal can be like India, it doesn’t have to choose anyone. Either India should invest in the development of Nepal or let others do so.It just has to reassure both partners that it’s not doing anything that’s going to be fundamentally detrimental to the relations with both the countries.India-China rapprochement is the best thing that can happen for Nepal.Though we feel that we know, we still fail to understand what China wants from the region. It might want assurance from Nepal that there is no anti-China activity. But, what beyond that? Honestly, no one knows.Many of the Chinese projects in the region do not make any economic sense. It seems China is using its economy to actually please the leadership of those countries. China has distorted the political systems of these countries by using its economy. If not, why would someone invest in Hambantota port in Sri Lanka knowing it is not economically viable?  Post Photo I think the interesting question is whether China will now take a more mature view in the relationship. It will be in South Asia’s interest if both India and China take a more mature view that clearly defines their core interests.India and China are both accused of influencing Nepal’s internal affairs. But it’s also the fact that internally Nepali forces also invite that influence. They play their factional politics using India and China. So the Nepali establishment has to be clear not to play this game.What in your opinion would most boost Nepal-India relations?Good relationships of countries depend on lots of things, along with people-to-people relations. When it comes to Nepal-India relations, there is an open border which takes our relationship to a different level and we take it for granted. Besides, business interests in both countries are something that promotes the relationship to different levels. Despite the Sino-US relations worsening, the creators of American capital urged the need of China for their economy. Same with Sino-India relations.Are you suggesting all political differences be kept at bay and Nepal-India focus on economic relationship?Nepal has to think about what is in its interest, but it has to take some intelligent strategic calls. Can Nepal get Tata, Adani and Ambani groups to invest in Nepal? I doubt it. But, if that happens, other trade stuff will automatically follow.To be honest, the political dispute between Nepal and India won’t be solved anytime soon. How can the government of both sides convince the people on the map and border issues even if they want to resolve it?The problem is that politicians of both our countries use those political disputes for domestic mobilisation. There have been politicians in Nepal who are tempted to use the anti-India card in popular politics. And there are politicians in India, a civil society structure that is very tempted to use Nepal in domestic politics. One should remember that using a foreign policy issue for domestic consumption is not something fruitful.There are media reports creating a narrative that India is unhappy with KP Sharma Oli and especially his impending China visit. Should the China visit by Nepali prime minister be a matter of concern for India?I fail to understand why India gets worried about this kind of thing. The nature of Nepal-India relations should be like they can walk in and out anytime. But it is not obvious that India is signalling that they are not happy with Nepali prime minister’s China visit.  ",
        "date": " November 18, 2024 ",
        "place": "kathmandu",
        "subject": "today News"
    },
    {
        "title": "Today’s weather: November 21, 2024Today’s weather: November 20, 2024Today’s weather: November 19, 2024Today’s weather: November 18, 2024Today’s weather: November 17, 2024",
        "text": "The weather will be partly cloudy in the hilly areas of the country on Thursday, with fair skies across most of the country. Light rain is likely in one or two places in the hilly regions of Koshi, Bagmati, and Gandaki provinces. Some high-altitude areas in these provinces may also experience light snowfall. Tonight, the hilly regions will remain partly cloudy, while the rest of the country will have mainly fair weather. The Meteorological Forecasting Division attributed the current conditions to the partial influence of westerly winds.On Wednesday, Janakpur reported the highest temperature at 33°C, while Jumla experienced the lowest temperature at -3.1°C. In Kathmandu, the maximum temperature reached 21.5°C, with a minimum of 9.2°C. ",
        "date": " November 21, 2024 ",
        "place": "Kathmandu ",
        "subject": "today News"
    }
]